[
  {
    "convesation": [
      "My husband likes video games - I've heard there is one called Quake - do you know much about it?",
      "Yes, O' my god. Love it! It's a first-person shooter developed by id software. ",
      "What could I tell my husband about it that would make him want to buy it?",
      "While playing the game players must find their way through various maze-like, medieval environments while battling a variety of monsters. It's amazing!",
      "Monsters - oh that sounds right up his alley - what else?",
      "It offers full real-time 3D renderings which is very rare for games of that type and time period. ",
      "I think he would really like the 3D renderings - how long does it take to play from beginning to end?"
    ],
    "suggestions": [
      "Crash Bandicoot: Warped (known in Europe as Crash Bandicoot 3: Warped) is a 1998 platform game developed by Naughty Dog and published by Sony Computer Entertainment for the PlayStation.",
      "It is the third game in the \"Crash Bandicoot\" video game series following \"\".",
      "A maze is a path or collection of paths, typically from an entrance to a goal.",
      "The word is used to refer both to branching tour puzzles through which the solver must find a route, and to simpler non-branching (\"unicursal\") patterns that lead unambiguously through a convoluted layout to a goal.",
      "The Kailyard school of Scottish fiction (1880-1914) was developed in the last decades of the 19th century as a reaction against what was seen as increasingly coarse writing representing Scottish life complete with all its blemishes.",
      "It has been considered to be an overly sentimental representation of rural life, cleansed of real problems and issues that affected the people, but proved for a time extremely popular."
    ],
    "actualResponse": "I'm not sure I've never beat it. The various maze-like levels take a long time."
  },
  {
    "convesation": [
      "I'd like to work in finance some day, do you have any good information about different branches of finance so I can maybe narrow it down?",
      "Well, just to clarify finance deals with the  study of investments. That's what you're looking to know about?",
      "Yes that's exactly the area of interest for me.",
      "Great! There are three categories. The public, corporate and personal finance. Do you have a preference of which area you might like best?",
      "I'd like to know more about public finance I think, what do you have for me?",
      "Good choice! Public finance deals with the governments role in the economy. I'm sure there a bit of stress when it comes to a job like this!",
      "Yes I think you might be right, but it seems like a very important job, we need to hold people accountable for what they spend!"
    ],
    "suggestions": [
      "Public finance is the study of the role of the government in the economy.",
      "It is the branch of economics which assesses the government revenue and government expenditure of the public authorities and the adjustment of one or the other to achieve desirable effects and avoid undesirable ones.",
      "Capitalism is an economic system and ideology based upon private ownership of the means of production and their operation for profit.",
      "Characteristics central to capitalism include private property, capital accumulation, wage labor, voluntary exchange, a price system and competitive markets.",
      "Broadband is a term normally considered to be synonymous with a high-speed connection to the internet.",
      "Suitability for certain applications, or technically a certain quality of service, is often assumed."
    ],
    "actualResponse": "Yes I agree! In most circumstances the private market allocates the services and good of a community to it's individuals efficiently. The goal is to match individual tastes with the what the economy is producing.  "
  },
  {
    "convesation": [
      "Hello! I heard you knew a lot about asthma. I have asthma and I'd like to know more about it.",
      "I am sorry you have the long-term inflammatory disease of the airways of the lungs.",
      "Yeah it's not great. What else can you tell me?",
      "Do you have symptoms like reversible airflow obstruction, and bronchospasm.",
      "Yes. It's really bad if I exercise too hard or am around cats and dust. ",
      "Afterwards you can start with pisodes of wheezing, coughing, chest tightness, and shortness of breath.",
      "That's right! That's when I have to use my medicine. What do you know about medication for asthma?",
      "Well your Diagnosis  depends on  the pattern of symptoms, response to therapy over time, and spirometry",
      "Yeah. I had to have a bunch of tests done."
    ],
    "suggestions": [
      "Atopy is a predisposition toward developing certain allergic hypersensitivity reactions.",
      "Atopy may have a hereditary component, although contact with the allergen or irritant must occur before the hypersensitivity reaction can develop.",
      "Asthma is a common long-term inflammatory disease of the airways of the lungs.",
      "It is characterized by variable and recurring symptoms, reversible airflow obstruction, and bronchospasm.",
      "Atopic dermatitis (AD), also known as atopic eczema, is a type of inflammation of the skin (dermatitis).",
      "It results in itchy, red, swollen, and cracked skin."
    ],
    "actualResponse": "They often classify it as atopic or non-atopic, where atopy refers to a predisposition toward developing a type 1 hypersensitivity reaction."
  },
  {
    "convesation": [
      "I love Classical Music. It helps me relax after a long day. Do you like Classical?",
      "I listen to it on occasion, I just find it rigid and structured unlike jazz or blues, but I do listen on occasion to clear my mind.",
      "I can't stand Jazz. I need something besides high pitch horns. Classical music tells a story.",
      "To each his own for sure!  But jazz is actually called America's classical music in some places.",
      "I'm native American and I don't consider it classical at all. Give me a drug circle that's classical. ",
      "Well music is an art form and not everyone has the same taste and that is perfectly fine.  If we did the world would be a boring place.",
      "I guess so. But in the end we only have one true classical music. It's the music of deep thought, relaxation and brain power."
    ],
    "suggestions": [
      "Ethnomusicology is the study of music from the cultural and social aspects of the people who make it.",
      "It encompasses distinct theoretical and methodical approaches that emphasize cultural, social, material, cognitive, biological, and other dimensions or contexts of musical behavior, instead of only its isolated sound component.",
      "MIDI (; short for Musical Instrument Digital Interface) is a technical standard that describes a communications protocol, digital interface, and electrical connectors and allows a wide variety of electronic musical instruments, computers and other related music and audio devices to connect and communicate with one another.",
      "A single MIDI link can carry up to sixteen channels of information, each of which can be routed to a separate device.",
      "Music is an art form and cultural activity whose medium is sound organized in time.",
      "The common elements of music are pitch (which governs melody and harmony), rhythm (and its associated concepts tempo, meter, and articulation), dynamics (loudness and softness), and the sonic qualities of timbre and texture (which are sometimes termed the \"color\" of a musical sound)."
    ],
    "actualResponse": "Maybe but I am happy music exists because all the different styles are forms of expression which makes all of us unique."
  },
  {
    "convesation": [
      "Have you ever heard of The Story So Far? They're my favorite band. ",
      "Story So Far is an American pop punk band.Do you love pop music?",
      "Pop music is great! Do you like pop music as well? ",
      "genre that fuses elements of punk rock and pop music",
      "Right, that's what pop punk is, which is the genre of my favorite band, Story So Far! ",
      "punk rock music genre and subculture that originated in the late 1970s.",
      "That's something I didn't know. Neat. Thanks for teaching me more about pop punk. ",
      "Also,2000s saw the creation or emergence of a few styles, such as indie-related genres",
      "I also like indie music. Can you tell me the names of any indie bands? "
    ],
    "suggestions": [
      "Britpop is a UK based music and culture movement in the mid 1990s which emphasised \"Britishness\", and produced bright, catchy pop music, partly in reaction to the popularity of the darker lyrical themes of the US-led grunge music, an alternative rock genre, and to the UK's own shoegazing music scene.",
      "The most successful bands associated with the movement are Oasis, Blur, Suede and Pulp; those groups would come to be known as its \"big four\".",
      "Rock music is a broad genre of popular music that originated as \"rock and roll\" in the United States in the early 1950s, and developed into a range of different styles in the 1960s and later, particularly in the United Kingdom and in the United States.",
      "It has its roots in 1940s and 1950s rock and roll, a style which drew heavily on the African-American genres of blues and rhythm and blues, and from country music.",
      "Grunge (sometimes referred to as the Seattle sound) is a subgenre of alternative rock and a subculture that emerged during the in the Pacific Northwest U.S. state of Washington, particularly in Seattle and nearby towns.",
      "The early grunge movement revolved around Seattle's independent record label Sub Pop and that region's underground music scene."
    ],
    "actualResponse": "grunge and punk revival bands in the US, and then Britpop bands in the UK, broke into the mainstream in the 1990s"
  },
  {
    "convesation": [
      "Swimming is my favorite form of exercise. It seems to be among the top recreational activities around the world.",
      "Swimming is a splash of a time. What all do you do, swim with friends or a team?",
      "I usually just swim by myself doing laps, but I enjoy watching competitions, especially during the summer Olympics.",
      "It sounds like you live a great and balanced life. Out of curiousity, why do you do it... fun, health or family thing?",
      "I used to be on swim team when I was younger and I loved it. Now that I'm older it's a good activity for me since it's low impact compared to running which hurts my knees.",
      "That is a great reason! I was just curious, I like to know the background to people I chat with. I bet you burn massive calories in a pool?"
    ],
    "suggestions": [
      "Swimming is the self-propulsion of a person through fresh or salt water, usually for recreation, sport, exercise, or survival.",
      "Locomotion is achieved through coordinated movement of the limbs, the body, or both.",
      "Pinnipeds, commonly known as seals, are a widely distributed and diverse clade of carnivorous, fin-footed, semiaquatic marine mammals.",
      "They comprise the extant families Odobenidae (whose only living member is the walrus), Otariidae (the eared seals: sea lions and fur seals), and Phocidae (the earless seals, or true seals).",
      "The beluga whale or white whale (\"Delphinapterus leucas\") is an Arctic and sub-Arctic cetacean.",
      "It is one of two members of the family Monodontidae, along with the narwhal, and the only member of the genus \"Delphinapterus\"."
    ],
    "actualResponse": "I try, some days more than others. It's amazing to me how the body is just slightly less dense than water and the water supports of weight of us while we swim. "
  },
  {
    "convesation": [
      "I enjoy Eating Italian Food :0) Especially Spaghetti. It originated in Italy",
      "I like Italian food too! I cook spaghetti quite often",
      "Italian food  tastes are regionally different , depending which part of the Italian boot one visits",
      "I have not been to Italy, but I would like to sample the different foods there",
      "Italian foods have diverse tastes. Its quite popular in the culinary world and its dishes are replicated much",
      "Yes, I think Italian food is very popular. Think of all the Pizza restaurants out there.",
      "I love the simplicity associated with Italian cooking.  Cooking is easily prepared with 2-4 main ingredients",
      "Yes, I like to prepare simple meals."
    ],
    "suggestions": [
      "Italian cuisine is food typical from Italy.",
      "It has developed through centuries of social and economic changes, with roots stretching to antiquity.",
      "Marcella Hazan (née Polini; April 15, 1924 – September 29, 2013) was an Italian-born cooking writer whose books were published in English.",
      "Her cookbooks are credited with introducing the public in the United States and Britain to the techniques of traditional Italian cooking.",
      "Elizabeth David, CBE (born Elizabeth Gwynne, 26 December 1913 – 22 May 1992) was a British cookery writer.",
      "In the mid-20th century she strongly influenced the revitalisation of home cookery in her native country and beyond with articles and books about European cuisines and traditional British dishes."
    ],
    "actualResponse": "Italian cooking relies on the quality of the ingredients and its simplistic preparation process"
  },
  {
    "convesation": [
      "Hello, Obsessive-compulsive disorder is a mental condition where people perform repetitive movements such as turning lights on and off.",
      "Do you know anyone who has OCD?",
      "Not personally. OCD sufferers also frequently wash hands and count things.",
      "That's interesting. Is that genetic?",
      "It is believed genes do play a part in developing the disease. Most sufferers realize that the behavior is not natural.",
      "Is there any method to \"cure\" OCD? What can sufferers do to stop it, if anything at all?"
    ],
    "suggestions": [
      "Cognitive-behavioral therapy (CBT) is a psycho-social intervention that is the most widely used evidence-based practice for improving mental health.",
      "Guided by empirical research, CBT focuses on the development of personal coping strategies that target solving current problems and changing unhelpful patterns in cognitions (e.g.",
      "Panic disorder is an anxiety disorder characterized by recurrent unexpected panic attacks.",
      "Panic attacks are sudden periods of intense fear that may include palpitations, sweating, shaking, shortness of breath, numbness, or a feeling that something really bad is going to happen.",
      "Cognitive behavioral therapy (CBT) is derived from both the cognitive and behavioral schools of psychology and focuses on the alteration of thoughts and actions with the goal of treating various disorders.",
      "The cognitive behavioral treatment of eating disorders emphasizes on the minimization of negative thoughts about body image and the act of eating, and attempts to alter negative and harmful behaviors that are involved in and perpetuate eating disorders."
    ],
    "actualResponse": "Although victims are unable to control their thoughts, cognitive behavior therapy (CBT) helps with developing coping techniques."
  },
  {
    "convesation": [
      "I like to make bagels.",
      "I enjoy eating them. They're usually topped with seeds baked on the outer crust. What kind of bagels do you like?",
      "I really like a whole wear bagel.",
      "What about cream cheese? That's commonly paired with bagels.",
      "I really like cream cheese but also sometimes peanut butter on my bagels.",
      "Ahh yes peanut butter is popular in many countries! Do you prefer chunky or smooth?",
      "Always chunky, I like the brunch when I take a bite.",
      "I do as well. Peanut butter typically contains additional ingredients to modify it's texture and even taste.",
      "What other kind of ingredients?"
    ],
    "suggestions": [
      "Peanut butter is a food paste or spread made from ground dry roasted peanuts.",
      "It often contains additional ingredients that modify the taste or texture, such as salt, sweeteners or emulsifiers.",
      "The peanut, also known as the groundnut and the goober and taxonomically classified as Arachis hypogaea, is a legume crop grown mainly for its edible seeds.",
      "It is widely grown in the tropics and subtropics, being important to both small and large commercial producers.",
      "A sugar substitute is a food additive that provides a sweet taste like that of sugar while containing significantly less food energy.",
      "Some sugar substitutes are produced by nature, and others produced synthetically."
    ],
    "actualResponse": "The peanuts themselves but also salt, sweeteners or emulsifiers."
  },
  {
    "convesation": [
      "i love eating on starbucks have you been there?",
      "I have been, I love Starbucks! I even went to the original location in Seattle, which was founded in 1971. ",
      "that is incredible, do you know who founded it?",
      "I actually don't but Starbucks now has 23,768 locations worldwide. WOW!",
      "that is really incredible, no wonder why they are the leading coffe restaurant worldwide",
      "I like the flavour of Starbucks darkly roasted coffee. ",
      "in is really incredible, i really like their frapuchinnos"
    ],
    "suggestions": [
      "The Pumpkin Spice Latte is a coffee drink made with a mix of traditional fall spice flavors (cinnamon, nutmeg, and clove), steamed milk, and espresso, topped with whipped cream and pumpkin pie spice.",
      "Since 2015, it has also contained a small amount of pumpkin puree.",
      "Starbucks Corporation is an American coffee company and coffeehouse chain.",
      "Starbucks was founded in Seattle, Washington in 1971.",
      "Vani Deva Hari (born March 22, 1979), who blogs as the Food Babe, is an American author, activist, and affiliate marketer who criticizes the food industry.",
      "She started the Food Babe blog in 2011, and it received over 54 million views in 2014."
    ],
    "actualResponse": "YEs, Starbucks really has a range of drinks! I like a pumpkin Spice Latte myself. "
  },
  {
    "convesation": [
      "My dad play a lot of golf and I want to take him out sometime. But i really dont know much about the sport.",
      "Golf is a club and ball sport, you should learn it is a good time!",
      "Do you know you score points at it.?",
      "Yeah the goal is to hit balls into a series of holes on a course in as few strokes as you can.",
      "Cool I have heard them refer to something as par before. do you know what that is?",
      "Yeah par is the predetermined number of strokes that a golfer should take to complete a hole, for example a par 3 hole should take 3 strokes.",
      "Interesting, Do you have any pointers for me?",
      "The only tips I have would be to get out there and start playing! it takes a lot of practice, the modern game of golf goes back as far as 15th century scotland!",
      "Well I will be sure to stick to it and practice thanks!"
    ],
    "suggestions": [
      "A hazard is an area of a golf course in the sport of golf which provides a difficult obstacle, which may be of two types: (1) water hazards such as lakes and rivers; and (2) man-made hazards such as bunkers.",
      "Special rules apply to playing balls that fall in a hazard.",
      "A golf course is the grounds where the game of golf is played.",
      "It comprises a series of holes, each consisting of a teeing ground, a fairway, the rough and other hazards, and a green with a flagstick (\"pin\") and hole (\"cup\").",
      "Golf is a club and ball sport in which players use various clubs to hit balls into a series of holes on a course in as few strokes as possible.",
      "Golf, unlike most ball games, cannot and does not utilize a standardized playing area, and coping with the varied terrains encountered on different courses is a key part of the game."
    ],
    "actualResponse": "Just remember to stay out of the sand traps, also called bunkers, and various water hazards, like ponds!"
  },
  {
    "convesation": [
      "Lady Gaga is so weird but interesting as well, since she is so well known for her provocative and unconventional work.",
      "I frankly must have been sleeping through her rise to fame.",
      "I know what you mean. Also even if she is weird, she started off like any small singer performing at open mic nights and school plays.",
      "Well that is a good story. I'm afraid that I must live under a rock though. Like Patrick from Spongebob!",
      "Have you never heard of her at all? She has topped the US charts many times.",
      "Well sure I have, but I couldn't pick her out of a crowd other than that I expect she dresses ridiculously."
    ],
    "suggestions": [
      "The iTunes Store is a software-based online digital media store operated by Apple Inc.",
      "It opened on April 28, 2003, and has been the largest music vendor in the United States since April 2008, and the largest music vendor in the world since February 2010.",
      "Shazam Entertainment Ltd. is a British app development company that created an app that can identify music, movies, advertising, and television shows, based on a short sample played and using the microphone on the device.",
      "On December 11, 2017, the company was bought by Apple Inc.",
      "Spotify is a music, podcast, and video streaming service that was officially launched on 7 October 2008.",
      "It is developed by startup Spotify AB in Stockholm, Sweden."
    ],
    "actualResponse": "That's fair enough, it's really impressive that someone so strange can make tracks that are so popular that they sell over a million songs in less than a week on iTunes."
  },
  {
    "convesation": [
      "I love The Beatles, Love Me Do is one of my favorite songs of theirs, made all the way back in late 1962.",
      "The Beatles are a classic, when did they first form?",
      "I believe they formed in Liverpool in 1960.",
      "Such a long time ago, arguably the biggest band of all time, had such a massive impact on the music industry. Who was your favorite member?",
      "It has to be Ringo Starr, who didn't join until 1962 after they tried a few other drummers, guess he was that good they knew he was the one.",
      "Im a John Lennon guy myself, tragic what happened to him, sadly we have some sick and twisted people in this world.",
      "It is quite sad, mental illness is quite the big topic nowadays given our current culture. I was quite fond the songwriting partnership he formed with McCartney myself.",
      "My favorite of theirs is probably A Day in the Life, they wrote so many famous songs."
    ],
    "suggestions": [
      "Beatlemania was the intense fan frenzy directed towards the English rock band the Beatles in the 1960s.",
      "The phenomenon began in 1963 and continued past the group's break-up in 1970, despite the band ceasing public performances in 1966.",
      "Beatlemania was a Broadway musical revue focused on the music of The Beatles as it related to the events and changing attitudes of the tumultuous 1960s.",
      "A \"rockumentary,\" advertised as \"\"Not the Beatles, but an incredible simulation\",\" it ran from 1977 to 1979 for a total of 1,006 performances.",
      "The Beatles were an English rock band formed in Liverpool in 1960.",
      "With members John Lennon, Paul McCartney, George Harrison and Ringo Starr, they became widely regarded as the foremost and most influential music band."
    ],
    "actualResponse": "Their popularity is certainly enermous, it's not wonder it was called Beatlemania, it really was like a mania."
  },
  {
    "convesation": [
      "My son loves Comic books, but I know literally nothing about them! Are you a comic book fan?",
      "I know a bit about them. Comic books are a publication that has sequential panels that represent individual scenes.",
      "Sounds interesting! What are some of the most popular comic books?",
      "Super hero comic books are very popular, though comic books originated in Japan in the 18th century.",
      "Oh wow! I had no idea they've been around that long. I'll bet those early Japanese ones were beautiful! ",
      "Yeah, one of the main things that comic books rely on is their organization",
      "I'll bet there are a lot of great stories! I think one of my favorite shows, The Walking Dead, started as a comic book!",
      "Yes, it was based on the comic book series by Robert Kirkman, Tony Moore, and Charlie Adlard.",
      "Nice, I'll have to check them out one day! What else can you tell me about comic books?"
    ],
    "suggestions": [
      "A comic book or comicbook, also called comic magazine or simply comic, is a publication that consists of comic art in the form of sequential juxtaposed panels that represent individual scenes.",
      "Panels are often accompanied by brief descriptive prose and written narrative, usually dialog contained in word balloons emblematic of the comics art form.",
      "The history of comics has followed different paths in different cultures.",
      "Scholars have posited a pre-history as far back as the Lascaux cave paintings.",
      "Speech balloons (also speech bubbles, dialogue balloons or word balloons) are a graphic convention used most commonly in comic books, comics and cartoons to allow words (and much less often, pictures) to be understood as representing the speech or thoughts of a given character in the comic.",
      "There is often a formal distinction between the balloon that indicates thoughts and the one that indicates words spoken aloud: the balloon that conveys thoughts is often referred to as a thought bubble."
    ],
    "actualResponse": "Balloons, text lines, characters, and panels are the key elements of comic books."
  },
  {
    "convesation": [
      "As much as I love cooking and have a TON of fun doing it, I don't think I'd cut it on a shop like Top Chef.",
      "Yes I love that show, I really love how it has lots of chefs competing against each other in various culinary challenges. It makes it more interesting.",
      "And there's usually a required ingredient, which is something insane like beer or lemons or something. Why are these shows so popular?",
      "People just like food shows, Top Chef actually got so popular that they made another show called \"Top Chef Junior\", It features ypung contestants in their early teens, It was premiered in October 2017 on Universal Kids.",
      "Yeah I try to avoid watching that one, because I don't need to feel like my childhood was worthless compared to these kids who can already cook better than me.",
      "Indeed, some people I know dont like that show, But it can make kids more interested in cooking and get into a culinary work for their career. ",
      "That's the hope at least, right? I feel like most of the time the way it plays out is that kids just want to get in the way in the kitchen."
    ],
    "suggestions": [
      "Top Chef is an American reality competition television series which premiered on March 8, 2006, on Bravo.",
      "The show features chefs competing against each other in various culinary challenges.",
      "Reality television is a genre of television programming that documents supposedly unscripted real-life situations, and often features an otherwise unknown cast of individuals who are typically not professional actors, although in some shows celebrities may participate.",
      "It differs from documentary television in that the focus tends to be on drama, personal conflict, and entertainment rather than educating viewers.",
      "Stephanie Izard (born October 30, 1976) is an American chef residing in Chicago, Illinois, best known as the first female chef to win Bravo's \"Top Chef\", taking the title during its fourth season.",
      "She is the co-owner and executive chef of three award-winning Chicago restaurants, Girl and the Goat, Little Goat, and Duck Duck Goat, and opened her first restaurant, Scylla (now closed) as chef-owner at the age of 27."
    ],
    "actualResponse": "Yep, I know that numerous international adaptations of \"Top Chef\" have also been produced, Thats pretty crazy, just goes to show you how popular it is overseas. "
  },
  {
    "convesation": [
      "Heavy metal music has roots in blues and acid rock. ",
      "I have never heard of acid rock, what is that? I like Heavy rock but not wuite metal",
      "Acid rock features distorted guitars and lyrics centered around drugs.",
      "Ah, did it originate back in the 70s or 80s then?",
      "Around the 60s, think psychedelic when it comes to Acid Rock. Think LSD too lol",
      "Ah okay, that makes more sense then. Are you a fan of the genre at all?",
      "Heavy metal, not much, nor Acid Rock. I'm not too familiar with either personally. ",
      "I understand that, Heavy rock is as far as I go, anything past that feels a bit too \"edgy\" I guess"
    ],
    "suggestions": [
      "Heavy metal (or simply metal) is a genre of rock music that developed in the late 1960s and early 1970s, largely in the United Kingdom.",
      "With roots in blues rock and psychedelic/acid rock, the bands that created heavy metal developed a thick, massive sound, characterized by highly amplified distortion, extended guitar solos, emphatic beats, and overall loudness.",
      "Nu metal (also known as nü-metal and ) is a form of that combines elements of with elements of other music genres such as hip hop, alternative rock, funk and grunge.",
      "bands have drawn elements and influences from a variety of musical styles, including multiple genres of heavy metal.",
      "Heavy metal lyrics are the words used in songs by heavy metal artists.",
      "Given that there are many genres of heavy metal, it is difficult to make generalizations about the lyrics and lyrical themes."
    ],
    "actualResponse": "Yeah, Heavy Metal is very aggressive, at least I feel that way personally."
  },
  {
    "convesation": [
      "Skateboarding is a hobby of mine, I am not good at it, but I like it",
      "I used to skateboard, but I really didn't have a lot of tricks up my sleeve. Most of the time I was just babysitting my younger brother at skate parks.",
      "I understand that, I started liking it when my oldest son got involved, I still love to watch the Dew Tour when it comes on",
      "I haven't really watched the Dew Tour. The only extreme sports event I used to watch was the X Games for it's first few years. I've been out of it for a while.",
      "It is amazing how far Tony Hawk took the sport, and that he still dabbles in it, but his oldest son skates too",
      "I remember playing his original video game. Tony Hawk's Pro Skater on the N64. That was really awesome back in the day.",
      "It was on the n64, it was really cool hoe you could sometimes skate through the walls..lol...I like the tricks like the ollie",
      "I remember once I learned to do an ollie myself, I tried to move to the kickflip. I don't think I ever mastered the kickflip.",
      "The kickflip is really hard, I remember practicing for hours at a time, and never mastering it"
    ],
    "suggestions": [
      "A flip trick is a type of skateboarding trick in which the skateboard rotates around its vertical axis, or its vertical axis and its horizontal axis simultaneously.",
      "The first flip trick called a kickflip, originally called a \"magic flip,\" was invented by professional skateboarder Rodney Mullen.",
      "A freestyle skateboarding trick is a trick done on a skateboard while freestyle skateboarding.",
      "Some of these tricks are done in a stationary position, unlike many other skateboarding tricks.",
      "John Rodney Mullen (born August 17, 1966) is an American professional skateboarder, entrepreneur, inventor, and public speaker who practices freestyle and street skateboarding.",
      "He is widely considered the most influential street skater in the history of the sport, being credited for inventing numerous tricks, including the kickflip, heelflip, impossible, and 360-flip."
    ],
    "actualResponse": "I landed kickflips here and there. But my stupid little brother could throw down 360 flips like they were nothing at all! It was a little discouraging."
  },
  {
    "convesation": [
      "I was thinking about becoming a yoga instructor but I don't know much about it. Do you?",
      "I do. The word yoga means \"listen\" in Sanskrit. It's a group of practices of both a physical and spiritual bent.",
      "Oh really? Listen....... that is interesting. I guess listen to your body?",
      "Kind of, yes. In India where yoga comes from, it is more than physical exercise. Meditation and spirituality are also an important part of the practice.",
      "Oh yes I have heard this as well. I have been learning to meditate recently. :)",
      "Meditation is a great way to reduce stress and anxiety. Meditative practices also originated in Asia.",
      "Yeah, they are all very spiritual people in that part of the world. I would love to visit there one day.",
      "It's a wonderful part of the world. It was actually yoga gurus from India who brought yoga to the West.",
      "Yes, they are so merciful to bring this knowledge to the west. We are so fortunate!"
    ],
    "suggestions": [
      "Hatha yoga is a branch of yoga that emphasizes physical exercises to master the body along with mind as well as exercises to withdraw it from external objects.",
      "The word \"haṭha\" means \"force\" in Sanskrit, and may have this association because the early Indians believed that its practice was challenging and \"forced its results to happen\" on the yogi.",
      "Yoga (; Sanskrit, योगः Listen) is a group of physical, mental, and spiritual practices or disciplines which originated in ancient India.",
      "There is a broad variety of yoga schools, practices, and goals in Hinduism, Buddhism, and Jainism.",
      "In Sanskrit texts, Rāja yoga () refers to the goal of yoga (which is usually samadhi) and not a method of attaining it.",
      "The term also became a modern retronym, when in the 19th-century Swami Vivekananda equated raja yoga with the Yoga Sutras of Patanjali."
    ],
    "actualResponse": "Indeed we are. If you're looking to get into yoga, the two most popular types are Hatha yoga and Raja yoga. Might be worth looking into!"
  },
  {
    "convesation": [
      "Do you know anything about being lactose intolerant?",
      "I think I may have lactose intolerance. I'm having a hard time digesting milk.",
      "Yes -- all dairy products make you have gas or indigestion; however, there are things you can do about it.",
      "I'm thinking about taking Lactaid tablets to avoid having gas and nausea every time I consume lactose.",
      "They do help, also you can get lactose free milk which is really good.",
      "I was happy to learn that Lactose intolerance does not cause damage to your gastro tract! Still, I need to avoid consuming too much of it, it isn't a pleasant feeling!",
      "True, but sometimes a little gas is worth the effort, especially for a milkshake.  ",
      "I agree. At least I was prepared for this, I was aware that as you age, it's more likely you will get primary lactose intolerance.",
      "Definitely the aging process has a lot to do with lactose intolerance, it appears to get worse as you age."
    ],
    "suggestions": [
      "Lactose intolerance is a condition in which people have symptoms due to the decreased ability to digest lactose, a sugar found in milk products.",
      "Those affected vary in the amount of lactose they can tolerate before symptoms develop.",
      "Milk is a white liquid produced by the mammary glands of mammals.",
      "It is the primary source of nutrition for infant mammals (including humans who breastfeed) before they are able to digest other types of food.",
      "Milk allergy is an adverse immune reaction to one or more of the protein constituents of cow's milk.",
      "Symptoms can be rapid or gradual in onset."
    ],
    "actualResponse": "Yeah and you can even get what they call secondary lactose intolerance due to injury of the small intestine."
  },
  {
    "convesation": [
      "I saw a documentary on snakes, did you realize they have skulls, that let them swallow prey much larger than their head?",
      "i know, they are pretty awesome. did you see how they manage to breath while they're eating?",
      "Wild, their paired organs aren't side-by-side and they only have one lung, because of their narrow body.",
      "i did not know that. only one lung, that is crazy. Did you know that despite how awesome they are, they can't manage to eat a full grown adult",
      "You hear they can, but I doubted it, but some species have a pelvic girdle and vestigial claws on either side of the cloaca.",
      "i never heard of claws in snakes before. which snake did the documentary talked about?"
    ],
    "suggestions": [
      "Snakes are elongated, legless, carnivorous reptiles of the suborder Serpentes.",
      "Like all squamates, snakes are ectothermic, amniote vertebrates covered in overlapping scales.",
      "Burton's legless lizard (\"Lialis burtonis\") is a species of lizard in the family Pygopodidae.",
      "The species lacks forelegs and has only rudimentary hind legs.",
      "\"Days Gone Bye\" is the first episode of the post-apocalyptic horror television series \"The Walking Dead\".",
      "It originally aired on AMC in the United States on October 31, 2010."
    ],
    "actualResponse": "There were many, but that elongated, legless body of a snake really creeps me out, so I couldn't watch long."
  },
  {
    "convesation": [
      "I saw a documentary on snakes, did you realize they have skulls, that let them swallow prey much larger than their head?",
      "i know, they are pretty awesome. did you see how they manage to breath while they're eating?",
      "Wild, their paired organs aren't side-by-side and they only have one lung, because of their narrow body.",
      "i did not know that. only one lung, that is crazy. Did you know that despite how awesome they are, they can't manage to eat a full grown adult",
      "You hear they can, but I doubted it, but some species have a pelvic girdle and vestigial claws on either side of the cloaca.",
      "i never heard of claws in snakes before. which snake did the documentary talked about?"
    ],
    "suggestions": [
      "Snakes are elongated, legless, carnivorous reptiles of the suborder Serpentes.",
      "Like all squamates, snakes are ectothermic, amniote vertebrates covered in overlapping scales.",
      "Burton's legless lizard (\"Lialis burtonis\") is a species of lizard in the family Pygopodidae.",
      "The species lacks forelegs and has only rudimentary hind legs.",
      "\"Days Gone Bye\" is the first episode of the post-apocalyptic horror television series \"The Walking Dead\".",
      "It originally aired on AMC in the United States on October 31, 2010."
    ],
    "actualResponse": "There were many, but that elongated, legless body of a snake really creeps me out, so I couldn't watch long."
  },
  {
    "convesation": [
      "I love the ocean, mostly because I love to surf! and kneeboarding",
      "I am not familiar with Kneeboarding, what is that?",
      "Knee boarding is alot like surfboarding, but its a special board that ridden in a kneeling stance",
      "That makes sense, is there an advatnage to doing it that way?",
      "Its just a different way of doing things haha, oddly enough surfing refers to the act of riding a wave, regardless of how",
      "That is interesting, I have only tried to surf on those fake machines that make a wave ",
      "Oh nice! Those are fun! surfers can actually use bother those and artifical waves made from boats and artificial wave pools",
      "I did not know they had boats to make waves too. I have seen some surfing on tv, it looks very difficult"
    ],
    "suggestions": [
      "An alaia (pronounced ) is a thin, round-nosed, square-tailed surfboard ridden in pre-20th century Hawaii.",
      "The boards were between long, weighed up to , and were generally made from the wood of Acacia koa.",
      "Bodyboarding is a water sport in which the surfer rides a bodyboard on the crest, face, and curl of a wave which is carrying the surfer towards the shore.",
      "Bodyboarding is also referred to as \"Boogieboarding\" due to the invention of the \"Boogie Board\" by Tom Morey.",
      "Surfing is a surface water sport in which the wave rider, referred to as a surfer, rides on the forward or deep face of a moving wave, which is usually carrying the surfer towards the shore.",
      "Waves suitable for surfing are primarily found in the ocean, but can also be found in lakes or in rivers in the form of a standing wave or tidal bore."
    ],
    "actualResponse": "Yeah it is haha, but not as tough as what the native people of the Pacific do, they surf on alaia paipo and wooden bark trees"
  },
  {
    "convesation": [
      "Steak is my favorite food I like mine grilled medium rare",
      "The word \"steak\" would also refer to many different meats like fish or pork.",
      "Oh yeah I prefer beef steak but I will eat chicken or pork",
      "How do you eat your steak? I usually like eating mine with a sauce.",
      "Oh no sauce for me but a baked potatoe on the side",
      "Do you like to grill, pan-fry, or broil your steak?",
      "I really prefer to grill but will pan fry if its bad weather",
      "I like grilling too, lets you get that good flavor having it over the coals and the fire.",
      "Yes but if pan fry you have to get a fast sear on first"
    ],
    "suggestions": [
      "Steak and kidney pie is a savoury pie that is filled principally with a mixture of diced beef, diced kidney (often of beef, lamb, or pork), fried onion, and brown gravy.",
      "Steak and kidney pie is a representative dish of British cuisine.",
      "A steak () is a meat generally sliced across the muscle fibers, potentially including a bone.",
      "Exceptions, in which the meat is sliced parallel to the fibers, include the skirt steak that is cut from the plate, the flank steak that is cut from the abdominal muscles, and the famous Silverfinger steak that is cut from the loin and includes three rib bones.",
      "The kidneys are two bean-shaped organs found on the left and right sides of the body in vertebrates.",
      "They are located at the back of the abdominal cavity in the retroperitoneal space."
    ],
    "actualResponse": "That's true. I also like having my steak with kidney pie."
  },
  {
    "convesation": [
      "I really love watching horror movies! Love the fright they give me. Do you know of any goods ones?",
      "Yes I like all the Halloween movies and all the Purge movies",
      "I think I have watched Halloween before! That's the one that takes place in Haddonfield, Illinois! What are the Purge movies about?",
      "Purge is scary about one night a year when people can commit any crime including murder without consequences, very scary!",
      "That would be a pretty scary world to live in. Do you think it's better than the film \"Scream\"? I know it's a bit dated, coming out in 1996, but it's still a great movie.",
      "Never saw scream? I like the Silence of the Lambs too, that is a real horror flick!"
    ],
    "suggestions": [
      "Hannibal is a 2001 American psychological horror film directed by Ridley Scott, adapted from the novel of the same name by Thomas Harris.",
      "It is the sequel to the 1991 Academy Award–winning film \"The Silence of the Lambs\" in which Anthony Hopkins returns to his role as the iconic serial killer, Hannibal Lecter.",
      "Sir Philip Anthony \"Tony\" Hopkins (born 31 December 1937) is a Welsh film, stage, and television actor.",
      "After graduating from the Royal Welsh College of Music & Drama in 1957, he trained at the Royal Academy of Dramatic Art in London, and was then spotted by Laurence Olivier who invited him to join the Royal National Theatre.",
      "The Silence of the Lambs is a 1991 American horror-thriller film directed by Jonathan Demme and starring Jodie Foster, Anthony Hopkins, and Scott Glenn.",
      "Adapted by Ted Tally from the 1988 novel of the same name by Thomas Harris, his second to feature the character of Dr. Hannibal Lecter; a brilliant psychiatrist and cannibalistic serial killer, the film was the second adaptation of a Harris novel featuring Lecter, preceded by the Michael Mann-directed \"Manhunter\" in 1986."
    ],
    "actualResponse": "Yes! I love Silence of the Lambs! Anthony Hopkins played his role incredibly well...he was so creepy!"
  },
  {
    "convesation": [
      "I was trying to remember the Walt Disney Pictures films I use to watch.",
      "There are many Disney movies like Cinderella and Frozen, Actually The studio has produced over 56 films, from \"Snow White and the Seven Dwarfs, My personal favorite is Moana which came out in 2016",
      "That is a lot of Walt Disney Pictures films. They must be very successful. ",
      "They are are! The Walt Disney Animation studio was founded way back on October 16, 1923, Its division of The main Walt Disney Studios.",
      "Oh wow. Anything else you can tell me about their history?",
      "Yes In fact Disney was founded on October 16, 1923 by two brothers by the name of Walt Disney and Roy O. Disney",
      "Oh okay. I believe I heard those names before. Did Walt Disney Pictures start making films that long ago?",
      "Yes the first movie was released all the way back in 1937, The movie was Snow White and the Seven Dwarfs",
      "I didnt realize it was that old. Im sure Walt Disney Pictures has won many awards."
    ],
    "suggestions": [
      "Walt Disney Animation Studios (WDAS), also referred to as Disney Animation, headquartered at the Walt Disney Studios in Burbank, California, is an American animation studio that creates animated feature films, short films, and television specials for The Walt Disney Company.",
      "Founded on October 16, 1923, it is a division of The Walt Disney Studios.",
      "The Walt Disney Company has owned and operated several animation studios since the company's founding on October 16, 1923, by Walt and Roy Disney as the Disney Brothers Cartoon Studio; the current Walt Disney Animation Studios in Burbank, California is the company's flagship feature animation studio and claims heritage from this original studio.",
      "Adding to the growth of the company and its motion picture studio division The Walt Disney Studios, several other animation studios were added through acquisitions and through openings of satellite studios outside the United States.",
      "Frozen is a 2013 American 3D computer-animated musical fantasy film produced by Walt Disney Animation Studios and released by Walt Disney Pictures.",
      "The 53rd Disney animated feature film, the film is inspired by Hans Christian Andersen's fairy tale \"The Snow Queen\"."
    ],
    "actualResponse": "They sure have, Walt disney animation took on its current name in the year 1983."
  },
  {
    "convesation": [
      "My favorite food is burritos. They are delicious.",
      "Interetingly burrito is a dish in Mexican and Tex-Mex cuisine ",
      "Is it really an authentic Mexican dish? When were burritos invented?",
      "The name \"burrito\", as applied to the dish, possibly derives from the appearance of bedrolls,related to packs carried by donkeys ",
      "That's interesting I didn't know they were named after that. What is the traditional burrito made out of? ",
      "We also have the burro percherón is a traditional dish in the Mexican state of Sonora.",
      "What exactly is a burro percheron? Is that a special type of burrito?"
    ],
    "suggestions": [
      "A burro percherón is a traditional dish in the Mexican state of Sonora, mainly in the cities of Hermosillo and Guaymas.",
      "A variation of the classic burrito, at present it is one of the most popular foods within the population of these cities, being offered in several establishments, fixed and mobile, where they are offered mainly at night, although recently there are establishments that offer burro percherón in its menu throughout the day.",
      "A burrito (, ) is a dish in Mexican and Tex-Mex cuisine that consists of a large wheat tortilla with various fillings.",
      "It is wrapped into a closed-ended cylinder, in contrast to a taco, where the tortilla is simply folded around the fillings.",
      "The cuisine of the United States reflects its history.",
      "The European colonization of the Americas yielded the introduction of a number of ingredients and cooking styles to the latter."
    ],
    "actualResponse": "Yeah, its a type of. classic burrito, at present it is one of the most popular foods offered mainly at night"
  },
  {
    "convesation": [
      "My favorite baseball team is the Baltimore Orioles. I like to watch the games on TV.",
      "I grew up in Baltimore, so they were my team as a child! ",
      "Cool, my favorite player is Cal Ripken, Jr. He was such an amazing talent.",
      "Cal's the best! A 19-time All-Star! ",
      "Yeah his playing streak will never be broken. I really liked Camden Yards but haven't been to the new stadium.",
      "Camden Yards actually is the new stadium, it was completed in 1992. Memorial Stadium is the old one, and the one I grew up going to. I hope you make it to the new one sometime, it's really nice. ",
      "Oh that's right. I meant Memorial Stadium. Camden does look very nice."
    ],
    "suggestions": [
      "Memorial Stadium was a sports stadium in Baltimore, Maryland, that formerly stood on 33rd Street (aka 33rd Street Boulevard or renamed \"Babe Ruth Plaza\") on an oversized block (officially designated as Venable Park, a former city park from the 1920s) also bounded by Ellerslie Avenue (west), 36th Street (north), and Ednor Road (east).",
      "Two different stadiums were located here, a 1922 version known as \"Baltimore Stadium\", or \"Municipal Stadium\", or sometimes 'Venable Stadium', and, for a time, \"Babe Ruth Stadium\" in reference to the then-recently deceased Baltimore native.",
      "California Memorial Stadium is an outdoor football stadium on the campus of the University of California, Berkeley in Berkeley, California.",
      "Commonly known as Memorial Stadium, it is the home field for the University of California Golden Bears of the Pac-12 Conference.",
      "Memorial Stadium is a double-decked concrete and steel stadium in northeast Bakersfield, California, near the Panorama Bluffs.",
      "It features a fast Bermuda grass football field with a high-centered crown that was renovated in 2014 and an all-weather track."
    ],
    "actualResponse": "Memorial Stadium was a classic! Right in the middle of the city!"
  },
  {
    "convesation": [
      "My uncle is a dental surgeon, who specializes in the diagnosis and prevention of diseases of the oral cavity.",
      "That's interesting, it sounds like a pretty hard job to do.",
      "It is, but he has a team full of assistants, hygienists, dental technicians and a dental therapist.",
      "Oh, I think a lot of people don't like going to the dentist, but it's necessary for health to go from time to time.",
      "It is necessary. It is good to seek oral health services especially if you are having issues.",
      "That's true, simple cavities can make big problems and cause pain if they're not treated."
    ],
    "suggestions": [
      "A dentist, also known as a dental surgeon, is a surgeon who specializes in dentistry, the diagnosis, prevention, and treatment of diseases and conditions of the oral cavity.",
      "The dentist's supporting team aids in providing oral health services.",
      "Dentistry is a branch of medicine that consists of the study, diagnosis, prevention, and treatment of diseases, disorders and conditions of the oral cavity, commonly in the dentition but also the oral mucosa, and of adjacent and related structures and tissues, particularly in the maxillofacial (jaw and facial) area.",
      "Although primarily associated with teeth among the general public, the field of dentistry or dental medicine is not limited to teeth but includes other aspects of the craniofacial complex including the temporomandibular and other supporting structures.",
      "Dentistry throughout the world is practised differently, and training in dentistry varies as well.",
      "Australian dentistry is overseen by the Australian Dental Council and the Dental Board of Australia The professional body for dentists is the Australian Dental Association."
    ],
    "actualResponse": "I recently found out that in China and France, the first people to perform dentistry were barbers!"
  },
  {
    "convesation": [
      "I'm about to work in the US Federal Judiciary, do you know anything about it?",
      "That's cool! The federal judiciary of the United States comprises one of three branches of the US federal government.",
      "Oh right, that's the supreme court right?",
      "Yes, the USA is required to have a Supreme Court by Article III of the Constitution.",
      "I see, I didn't realize it was required",
      "Yes, the judges are appointed by the President, but the Senate must also consent to the choice.",
      "Oh wow, what does the Supreme Court do?",
      "The Supreme Court is considered a last resort court.",
      "So they only see the most controversial cases."
    ],
    "suggestions": [
      "Nullification, in United States constitutional history, is a legal theory that a state has the right to nullify, or invalidate, any federal law which that state has deemed unconstitutional.",
      "The theory of nullification has never been legally upheld by federal courts.",
      "The Supreme Court of the United States (sometimes colloquially referred to by the acronym \"SCOTUS\") is the highest federal court of the United States.",
      "Established pursuant to Article Three of the United States Constitution in 1789, it has ultimate (and largely discretionary) appellate jurisdiction over all federal courts and state court cases involving issues of federal law plus original jurisdiction over a small range of cases.",
      "In the United States, judicial review is the ability of a court to examine and decide if a statute, treaty or administrative regulation contradicts or violates the provisions of existing law, a State Constitution, or ultimately the United States Constitution.",
      "While the U.S. Constitution does not explicitly define a power of judicial review, the authority for judicial review in the United States has been inferred from the structure, provisions, and history of the Constitution."
    ],
    "actualResponse": "Yes, by the time a case reaches the Supreme Court it has likely been in several other federal courts"
  },
  {
    "convesation": [
      "Do you like to go hiking?",
      "Hiking up large mountains or trails is not something i like to do",
      "That's awesome. I used to hike a lot in boy scouts. What else?",
      "In the united kingdom hiking is just referred to as walking",
      "Ah interesting. You're from the united kingdom?",
      "To an extent, i was born there but i live in america",
      "Ah cool. I want to hike more now that we're talking about it."
    ],
    "suggestions": [
      "The Appalachian National Scenic Trail, generally known as the Appalachian Trail or simply the A.T., is a marked hiking trail in the Eastern United States extending between Springer Mountain in Georgia and Mount Katahdin in Maine.",
      "The trail is estimated around 2,200 miles (3,500 km) long, though the exact length changes over time as parts are modified or rerouted.",
      "Mount Adams, known by some Native American tribes as Pahto or Klickitat, is a potentially active stratovolcano in the Cascade Range.",
      "Although Adams has not erupted in more than 1,000 years, it is not considered extinct.",
      "A trail is usually a path, track or unpaved lane or road.",
      "In the United Kingdom and the Republic of Ireland path or footpath is the preferred term for a walking trail."
    ],
    "actualResponse": "Hiking up mountains and up trails outside is something i do not enjoy, too much effort"
  },
  {
    "convesation": [
      "My friend has a yorkshire terrier, they are cute dogs",
      "Yes they are! Do you know where the breed comes from?",
      "19th century yorkshire, they were bred to kill rats",
      "Oh cool! I seen a video about that. It was pretty gross. does your friends dog do that too?",
      "No his yorkshire just runs around trying to lick people, hes a cool little dog",
      "Nice, I had a Burmese Mountain Dog but he passed away recently sadly."
    ],
    "suggestions": [
      "The Bernese Mountain Dog () is a large-sized breed of dog, one of the four breeds of Sennenhund-type dogs from the Swiss Alps.",
      "The name \"Sennenhund\" is derived from the German \"Senne\" (\"alpine pasture\") and \"Hund\" (\"dog\"), as they accompanied the alpine herders and dairymen called \"Senn\".",
      "The Greater Swiss Mountain Dog ( or ) is a dog breed which was developed in the Swiss Alps.",
      "The name \"Sennenhund\" refers to people called \"Senn\" or \"Senner\", dairymen and herders in the Swiss Alps.",
      "A drafting dog or draft dog is a dog bred and used for cart pulling.",
      "Dogs bred for this work have strong builds."
    ],
    "actualResponse": "Oh thats sad i love Bernese Mountain dogs they are so big and fluffy and gentle"
  },
  {
    "convesation": [
      "I used to go To Las Vegas more often when I lived in Los Angeles, have you ever been?",
      "I have never been, but always wanted to go. Vegas is renowned for their resorts, gambling, shopping, and fine dining. It sounds so fun!",
      "It is a fun place to visit, Do you gamble at all? ",
      "No, but it really does sound fun. One of my friends went to Caesars Palace and had the greatest time at the casino.",
      "I like to go to the sports book at Ceasars Palace and bet on Football. The Bellagio and the Wynn also have nice sports books",
      "Oh yes, I heard the Bellagio is famed for its elegance. I would love to go.",
      "The Bellagio is a nice hotel, many of the hotels on the Las Vegas strip are very nice"
    ],
    "suggestions": [
      "The Las Vegas Valley is a major metropolitan area in the southern part of the U.S. state of Nevada.",
      "The state's largest urban agglomeration, it is the heart of the Las Vegas–Paradise-Henderson, NV MSA.",
      "Las Vegas (, Spanish for \"The Meadows\"), officially the City of Las Vegas and often known simply as Vegas, is the 28th-most populated city in the United States, the most populated city in the state of Nevada, and the county seat of Clark County.",
      "The city anchors the Las Vegas Valley metropolitan area and is the largest city within the greater Mojave Desert.",
      "The Las Vegas metropolitan area is home to many sports, most of which take place in the unincorporated communities around Las Vegas rather than in the city itself.",
      "The Las Vegas Valley has one major league professional team: the Vegas Golden Knights of the National Hockey League (NHL) who began play in 2017 as the region's first major pro team."
    ],
    "actualResponse": "Not surprising, considering Las Vegas is one of the world's most visited tourist destinations!"
  },
  {
    "convesation": [
      "My family had a fish farm ",
      "Hi! That is interesting! What kind of fish?",
      "We reared salmon and Catfish",
      "Nice, I like the taste of salmon. Do you like to eat fish?",
      "of course I do, it's just that I wanted to pursue my own career that's why I left the business",
      "That makes sense! New horizons are sometimes needed. I hope to have my own business someday."
    ],
    "suggestions": [
      "Fish farming or pisciculture involves raising fish commercially in tanks or enclosures such as fish ponds, usually for food.",
      "It is the principal form of aquaculture, while other methods may fall under mariculture.",
      "Buildbox is drag-and-drop game building software focused on game creation without programming, coding or scripting.",
      "The core audience for the software is entrepreneurs, designers and other gaming enthusiast without prior game development or coding knowledge.",
      "Aquaculture is the farming of fish, crustaceans, molluscs, aquatic plants, algae, and other aquatic organisms.",
      "Aquaculture involves cultivating freshwater and saltwater populations under controlled conditions, and can be contrasted with commercial fishing, which is the harvesting of wild fish."
    ],
    "actualResponse": "Fish farming is easy but it requires your full attention. If you need a business that does not need your full attention then you can consider IT. game building for example , check buildbox on google :)"
  },
  {
    "convesation": [
      "I love me some Pepsi-Cola! I like it so much better than Coke.",
      "I can see why, Coke is great but it is really really sweet and hard to drink a lot of.",
      "Pepsi started out being called \"Brad's Drink\" in 1863! I thought that was pretty crazy.",
      "Really? That's such a strange name!",
      "There's also a drink called Pepsi Max that's low calorie and sugar free that's an alternative to Diet Pepsi.",
      "I quite like Diet Pepsi, I drink it more than any other soda."
    ],
    "suggestions": [
      "Diet Pepsi and Diet Pepsi Classic Formula Blend are no-calorie carbonated cola soft drinks produced by PepsiCo, introduced in 1964 as a variant of Pepsi-Cola with no sugar.",
      "First test marketed in 1963 under the name Patio Diet Cola, it was re-branded as \"Diet Pepsi\" the following year, becoming the first diet cola to be distributed on a national scale in the United States.",
      "Pepsi Zero Sugar (known as Diet Pepsi Max until early 2009 and Pepsi Max until August 2016), is a zero-calorie, sugar-free, carbohydrate-free, ginseng-infused cola sweetened with aspartame, marketed by PepsiCo.",
      "It has nearly twice the caffeine of Pepsi's other cola beverages.",
      "Pepsi is a carbonated soft drink produced and manufactured by PepsiCo.",
      "Originally created and developed in 1893 by Caleb Bradham and introduced as Brad's Drink, it was renamed as Pepsi-Cola on August 28, 1898, and then as Pepsi in 1961."
    ],
    "actualResponse": "SPeaking of crazy names, Diet Pepsi started out as \"Patio Diet Cola\" in 1963"
  },
  {
    "convesation": [
      "Are you a vegetarian?",
      "I'm not currently but I was previously. I think vegetarianism has its roots in ancient India and Greece.",
      "I think so too",
      "In both cases I believe it was based on the idea of nonviolence towards animals and it was even promoted by religious groups.",
      "Yeah, I dont really care about the religious aspect, but I definitely care about animals.",
      "It's definitely good not to inflict unnecessary violence in my opinion. It's too bad vegetarianism is so rare, only 0.5-4% of the Western world is vegetarian based on 2006 data.",
      "Thats so few people. Kind of ridiculous in this day and age.",
      "I don't have the current data, but I think it's growing in popularity as people consider the health-related and environmental benefits as well.",
      "Im sure it is. The Internet is raising people's awareness of animal rights issues."
    ],
    "suggestions": [
      "The animal rights movement, sometimes called the animal liberation movement, animal personhood, or animal advocacy movement, is a social movement which seeks an end to the rigid moral and legal distinction drawn between human and non-human animals, an end to the status of animals as property, and an end to their use in the research, food, clothing, and entertainment industries.",
      "It is one of the few examples of a social movement that was created, and is to a large extent sustained academically, by philosophers.",
      "Animal rights is the idea in which some, or all, non-human animals are entitled to the possession of their own lives and that their most basic interests—such as the need to avoid suffering—should be afforded the same consideration as similar interests of human beings.",
      "Advocates oppose the assignment of moral value and fundamental protections on the basis of species membership alone—an idea known since 1970 as speciesism, when the term was coined by Richard D. Ryder—arguing that it is a prejudice as irrational as any other.",
      "People for the Ethical Treatment of Animals (PETA ; stylized PeTA) is an American animal rights organization based in Norfolk, Virginia, and led by Ingrid Newkirk, its international president.",
      "A nonprofit corporation with nearly 400 employees, it claims that it has 6.5 million members and supporters, in addition to claiming that it is the largest animal rights group in the world."
    ],
    "actualResponse": "Definitely, the animal rights movement is growing, and is actually one of the few examples of a movement created by philosophers."
  },
  {
    "convesation": [
      "Fashion design involves the application of design to clothing and accessories.",
      "I watch a couple of fashion design shows.",
      "Oh cool, fashion designers work in many ways designing things such as bracelets and necklaces.",
      "I have friends who design bracelets.",
      "Yes, the fashion designers also design clothes that are functional too.",
      "That's true, though I tend to like seeing the really out there stuff they design.",
      "The fashion designers have a wide range of materials to work with to suit many situations.",
      "And sometimes, they use things that aren't even fabric! It's amazing."
    ],
    "suggestions": [
      "Fashion design is the art of application of design and aesthetics or natural beauty to clothing and accessories.",
      "Fashion design is influenced by cultural and social attitudes, and has varied over time and place.",
      "The history of fashion design refers to the development of the fashion industry which designs clothing and accessories.",
      "The modern industry, based around firms or fashion houses run by individual designers, started in the 19th century with Charles Frederick Worth who was the first designer to have his label sewn into the garments that he created.",
      "Native American fashion (also known as Indigenous American fashion) encompasses the design and creation of clothing and fashion accessories inspired by the traditional cultures and arts by the Native peoples of the Americas.",
      "Indigenous designers frequently incorporate motifs and traditional materials into their wearable artworks, providing a basis for creating items for the \"haute couture\" and international fashion markets."
    ],
    "actualResponse": "Fashion designers designs are utilized by manufacturers."
  },
  {
    "convesation": [
      "Sport utility vehicles are very useful for moving stuff and using as a car",
      "Isn't that what SUV stands for?",
      "yep, Sport utility vehicles are very good cars for people with families but are expensive",
      "I've noticed that too, they can get really expensive sometimes.",
      "most SUVs are just built on truck chassis",
      "That's interesting, they must be versatile."
    ],
    "suggestions": [
      "Sport-utility (vehicle), SUV or sport-ute is an automotive classification, typically a kind of station wagon / estate car with off-road vehicle features like raised ground clearance and ruggedness, and available four-wheel drive.",
      "Many SUVs are built on a light-truck chassis but operated as a family vehicle, and though designed to be used on rougher surfaces, most often used on city streets or highways.",
      "The Ford Explorer is a range of SUVs maufactured by Ford Motor Company.",
      "Introduced in 1990 for the 1991 model year, it is currently in its fifth generation.",
      "The history of plug-in hybrid electric vehicles (PHEVs) spans a little more than a century, but most of the significant commercial developments have taken place after 2002.",
      "The revival of interest in this automotive technology together with all-electric cars is due to advances in battery and power management technologies, and concerns about increasingly volatile oil prices and supply disruption, and also the need to reduce greenhouse gas emissions."
    ],
    "actualResponse": "Sport utility vehicles are very versatile"
  },
  {
    "convesation": [
      "I just love the world of finance.  There is so much money to be made at your fingertips.",
      "Yeah well  Finance is a field that deals in the world of investments.",
      "How long do you have to go to school to get into finance?",
      "2 to 4 years. It is technically the study of dynamics of assets and liabilities over time under conditions of different degrees",
      "Finance",
      "Some call it the science of money management.",
      "I wonder how many different conditions that market can be in.",
      "The goal of finance aims to price assets based on their risk level ",
      "I'm assuming it's better to get low risk assets."
    ],
    "suggestions": [
      "Finance is a field that deals with the study of investments.",
      "It includes the dynamics of assets and liabilities over time under conditions of different degrees of uncertainty and risk.",
      "Personal finance is the financial management which an individual or a family unit performs to budget, save, and spend monetary resources over time, taking into account various financial risks and future life events.",
      "When planning personal finances, the individual would consider the suitability to his or her needs of a range of banking products (checking, savings accounts, credit cards and consumer loans) or investment private equity, (stock market, bonds, mutual funds) and insurance (life insurance, health insurance, disability insurance) products or participation and monitoring of and- or employer-sponsored retirement plans, social security benefits, and income tax management.",
      "Kiplinger ( ) is a Washington, D.C.-based publisher of business forecasts and personal finance advice, available in print and online (Kiplinger.com).",
      "Its best-known publications are \"The Kiplinger Letter\", a weekly business and economic forecasting periodical for people in management, and the monthly \"Kiplinger's Personal Finance\" magazine."
    ],
    "actualResponse": "Yeah most questions in personal finance revolve around: Personal finance may involve paying for education and goods like cars and stuff."
  },
  {
    "convesation": [
      "I just started working at an Amazon warehouse. I like it so far!",
      "It is crazy how the company has grown. Amazon started as an online bookstore and slowly started selling other things. ",
      "It is crazy that a bookstore can take over the online marketplace like they have>",
      "Yes, it now has grown to be the largest internet retailer in the world!",
      "Thats impressive! What year was it founded?",
      "It was founded on July 5, 1994 by Jeff Bezos",
      "Wow! I didnt know it had been around so long.",
      "Yes! Now it has its arms reach to many other countries. Amazon now has retail websites for the US, the UK, and the Netherlands just to name a few places",
      "Its hard to believe that everyone can just shop from their homes!"
    ],
    "suggestions": [
      "Amazon.com, Inc., doing business as Amazon (), is an American electronic commerce and cloud computing company based in Seattle, Washington that was founded by Jeff Bezos on July 5, 1994.",
      "The tech giant is the largest Internet retailer in the world as measured by revenue and market capitalization, and second largest after Alibaba Group in terms of total sales.",
      "This is a list of products and services offered by American corporation Amazon.",
      "Amazon product lines include several media (books, DVDs, music CDs, videotapes, and software), apparel, baby products, consumer electronics, beauty products, gourmet food, groceries, health and personal-care items, industrial & scientific supplies, kitchen items, jewelry and watches, lawn and garden items, musical instruments, sporting goods, tools, automotive items and toys & games.",
      "The Amazon Kindle is a series of e-readers designed and marketed by Amazon.",
      "Amazon Kindle devices enable users to browse, buy, download, and read e-books, newspapers, magazines and other digital media via wireless networking to the Kindle Store."
    ],
    "actualResponse": "And just for giggles, Amazon also offers international shipping, so you can pretty much order anything. "
  },
  {
    "convesation": [
      "I love eating Bagels!  My favorite are blueberry bagels!  Do you enjoy them?",
      "That's what I eat: blueberry.  I think the blueberries provide relief from the density and chewiness of the bagels.",
      "I agree!  Do you make them from scratch or do you buy them from the store?",
      "I'm afraid I add to the $70 million in revenue that Lender's Bagels gets.  I'm from the south, so I don't know how to make bagels. Donuts, yes.",
      "Whoa!  $70 million!  I don't think I have ever tried a Lender's bagel.  Where are they from?",
      "It's a company started by Murray Lender (died 2012) in Connecticut.",
      "I will have to try it!  I particularly like \"Killer Dave's\" bagels.  Have you tried that brand?"
    ],
    "suggestions": [
      "Davidovich Bagels is a popular bagel brand produced by Davidovich Bakery, a wholesale company in New York City.",
      "It is widely regarded as the only genuinely \"hand-rolled\" bagel on the wholesale market.",
      "A bagel ( '; ), also spelled beigel, is a bread product originating in the Jewish communities of Poland.",
      "It is traditionally shaped by hand into the form of a ring from yeasted wheat dough, roughly hand-sized, that is first boiled for a short time in water and then baked.",
      "Lender's Bagels is a brand of bagels that pioneered the pre-packaged bagel industry in the United States.",
      "Established in 1927 in New Haven, Connecticut by the Lender family, it became a North American leader in the marketing, distribution and sales of bagels."
    ],
    "actualResponse": "Never heard of them!  Are they the same as Davidovich Bagels that are hand rolled?"
  },
  {
    "convesation": [
      "Have you ever watched Friends?",
      "Friends is an awesome comedy. I used to watch it like every week. Joey is the best character. It's an American television sitcom created by David Crane back in 1994.",
      "Yeah I didn't watch it much bck in the day but I watched it when it all went to Netlfix.",
      "Do you like the fictional character Monica Geller from friends?",
      "Monica was kind of the worst! Joey was of course the best.",
      "The other fictional character Rachel Green is probably the best girl on the show. Or Rachel. Monica can ruin things sometimes haha.",
      "Rachel is definitely the best.",
      "David Crane did a good job with actress Jennifer Aniston. The show had like 236 episodes it's crazy.",
      "Yeah that is crazy, who is David Crane?"
    ],
    "suggestions": [
      "Friends (stylized as F•R•I•E•N•D•S) is an American television sitcom, created by David Crane and Marta Kauffman, which aired on NBC from September 22, 1994, to May 6, 2004, lasting ten seasons.",
      "With an ensemble cast starring Jennifer Aniston, Courteney Cox, Lisa Kudrow, Matt LeBlanc, Matthew Perry and David Schwimmer, the show revolves around six 20–30-something friends living in Manhattan.",
      "Stephen Crane (November 1, 1871 – June 5, 1900) was an American poet, novelist, and short story writer.",
      "Prolific throughout his short life, he wrote notable works in the Realist tradition as well as early examples of American Naturalism and Impressionism.",
      "The Pilot, also known as \"The One Where Monica Gets a Roommate\", was the first episode of the American situation comedy series \"Friends\", premiered on NBC on September 22, 1994.",
      "It was written by series creators David Crane and Marta Kauffman, and directed by James Burrows."
    ],
    "actualResponse": "A crazy guy. Crane began developing Friends under the title \"Insomnia Cafe\" at first."
  },
  {
    "convesation": [
      "I recently visited New York, a city with an estimated population of 8.5 million.",
      "I love New York, but it is very busy",
      "Indeed, New York is a melting pot of different cultures and over the last decade is growing faster than the region.",
      "Yes, New York is a melting pot of dcultures which means a melting pot of food! New York has so much to offer.",
      "Exactly, New York has alos a great music scense which has gained a near global audience. ",
      "I agree, people travel to New York to make a living in a wide variety of fields.",
      "I like Manhattan the most, its the most densely populated area of New York has has a lot of tourist attractions. e.g Time Square",
      "Manhattan is great, it is definitley a must see city in New York. I also like the culture in Brooklyn."
    ],
    "suggestions": [
      "The City of New York, often called New York City or simply New York, is the most populous city in the United States.",
      "With an estimated 2016 population of 8,537,673 distributed over a land area of about , New York City is also the most densely populated major city in the United States.",
      "Brooklyn () is the most populous borough of New York City, with a census-estimated 2,629,150 residents in 2016.",
      "It borders the borough of Queens at the southwestern end in the same Long Island, and has several bridge connections to the nearby boroughs of Staten Island and Manhattan.",
      "Manhattan () is the most densely populated borough of New York City, its economic and administrative center, and its historical birthplace.",
      "Locally it is often referred to simply as \"The City\"."
    ],
    "actualResponse": "Yes, Brooklyn its New York's fourth-smallest country by land area but the second largest among the cities five boroughs."
  },
  {
    "convesation": [
      "Have you ever been snorkeling?",
      "I have been snorkeling in the Bahamas. It's fun but I don't enjoy the masking fogging up.",
      "I've never been - was it hard to do or scary?",
      "No, it's not scary at all. But you do have to be in a tropical location to really enjoy it.",
      "My girls have played around the jetties at panama city beach and looked at some fish through their goggles but i guess it's not the same thing",
      "Panama city is nice due to it's white, sand beaches but the snorkeling is best over a tropical reef.",
      "I think I might be worried about bigger fish coming to a reef for a snack LOL!",
      "Coral reefs have such a complex biodiversity to them that you'll get all sorts of creatures. My favorites are the sea turtles.",
      "I would love to see the sea turtles up close  - i have some friends that swam with them in Hawaii"
    ],
    "suggestions": [
      "Sea turtles (superfamily Chelonioidea), sometimes called marine turtles, are reptiles of the order Testudines.",
      "The seven extant species of sea turtles are: the green, loggerhead, Kemp's ridley, olive ridley, hawksbill, flatback, and leatherback.",
      "The green sea turtle (\"Chelonia mydas\"), also known as the green turtle, black (sea) turtle or Pacific green turtle, is a large sea turtle of the family Cheloniidae.",
      "It is the only species in the genus Chelonia.",
      "Sea Turtles 911 is a non-profit organization dedicated to the conservation of sea turtles.",
      "The organization was formed in Hawaii, in the United States, and operates primarily on Hainan island, China."
    ],
    "actualResponse": "Sea turtles are great, there are seven species of sea turtle."
  },
  {
    "convesation": [
      "What kind of phone do you use? I love my iPhone. I got the first gen version back in 2007 and have stuck with iPhone ever since. ",
      "I have an iPhone as well. I really like it too!",
      "I have the iPhone 7. Haven't made the move to the iPhone 8. I'm thinking about getting the Plus or the iPhone X that came out last year. ",
      "I think mine is just the 6 but I like it and so I'm still good with it. ",
      "I try and stick with what I've got fr as long as I can. The X sounds so cool though. Apple is using it to show what they think is the technology of the future, like wireless charging. ",
      "Yes, I'm sure it has some fantastic features. I used android phones for a long time, so this one is my first iPhone."
    ],
    "suggestions": [
      "Android is a mobile operating system developed by Google, based on a modified version of the Linux kernel and other open source software and designed primarily for touchscreen mobile devices such as smartphones and tablets.",
      "In addition, Google has further developed Android TV for televisions, Android Auto for cars, and Android Wear for wrist watches, each with a specialized user interface.",
      "A mobile operating system (or mobile OS) is an operating system for phones, tablets, smartwatches, or other mobile devices.",
      "While computers such as typical laptops are 'mobile', the operating systems usually used on them are not considered mobile ones, as they were originally designed for desktop computers that historically did not have or need specific \"mobile\" features.",
      "A smartphone is a handheld personal computer with a mobile operating system and an integrated mobile broadband cellular network connection for voice, SMS, and Internet data communication; most if not all smartphones also support Wi-Fi.",
      "Smartphones are typically pocket-sized, as opposed to tablets, which are much larger."
    ],
    "actualResponse": "Oh, my husband loves the Androids. He goes with whatever the latest is from Samsung. He prefers the mobile operating system that Google came up with for Android. "
  },
  {
    "convesation": [
      "Sleeping is one of my favorite things to do. It's a naturally occurring state of the body where there is inhibited consciousness and lack of interactions with your surroundings.",
      "I love to sleep, I wish I had more time to do so though!",
      "Sleep is very important. While sleeping the body systems are in an anabolic state which helps to restore the immune, nervous, skeletal, and muscular systems.",
      "Yeah it is a great way for us to recover from everything we do throughout the day, it's really interesting when you think about it.",
      "It's also interesting that our body has an internal clock called a circadian clock that promotes sleep at night time.",
      "Yeah it is, I wonder how people deal with the long days and nights near the poles.",
      "They probably have a Non-24-hour sleep-wake disorder which messes with the natural sleep cycle.",
      "Yeah I hear that also causes issues with depression."
    ],
    "suggestions": [
      "Irregular sleep–wake rhythm is a rare form of circadian rhythm sleep disorder.",
      "It is characterized by numerous naps throughout the 24-hour period, no main nighttime sleep episode and irregularity from day to day.",
      "Idiopathic hypersomnia is a condition which is characterized primarily by excessive daytime sleepiness (EDS).",
      "It has historically been rarely diagnosed and is often very difficult to diagnose at an early stage; it is usually a lifelong chronic disease, which is often debilitating.",
      "Shift work sleep disorder (SWSD) is a circadian rhythm sleep disorder characterized by insomnia and excessive sleepiness affecting people whose work hours overlap with the typical sleep period.",
      "There are numerous shift work schedules, and they may be permanent, intermittent, or rotating; consequently, the manifestations of SWSD are quite variable."
    ],
    "actualResponse": "Yes when someone has an irrecgular sleep-wake rhythm it can cause them to take naps throughout the day and not have a main sleep time."
  },
  {
    "convesation": [
      "I am a night owl, I can't seem to make myself go to sleep early, I always end up staying up really long.",
      "Me too! I am the total opposite of an early bird who loves to wake up early! I get stronger as the night grows! lol",
      "I understand, it' hard to wake up early during the day. ",
      "In Scandanavia, they refer to early birds as A People and night owls as B People! lol  I wish I knew where they came up with that!",
      "I never heard of it, I kind of like early bird and night owl phrases more to be honest. I've always wanted to visit Scandinavia.",
      "Interestingly, the term night owl refers to the primary nocturnal habits of the owl! haha",
      "Yes I always thought so, just like early bird refers to bird that wake up right when the sun rises on the horizon."
    ],
    "suggestions": [
      "A night owl, evening person or simply owl, is a person who tends to stay up until late at night.",
      "The opposite of a night owl is an early bird, a lark as opposed to owl, someone who tends to begin sleeping at a time that is considered early and also wakes early.",
      "Delayed sleep phase disorder (DSPD), more often known as delayed sleep phase syndrome and also as delayed sleep-wake phase disorder, is a chronic dysregulation of a person's circadian rhythm (biological clock), compared to the general population and relative to societal norms.",
      "The disorder affects the timing of sleep, peak period of alertness, the core body temperature rhythm, and hormonal and other daily cycles.",
      "Insomnia, also known as sleeplessness, is a sleep disorder where people have trouble sleeping.",
      "They may have difficulty falling asleep, or staying asleep as long as desired."
    ],
    "actualResponse": "Many night owls have difficulty adopting normal sleeping and waking habits and develop a sleep-phase disorder."
  },
  {
    "convesation": [
      "I love Tea it is so good",
      "Yes Tea is wonderful. Regular tea is made from the leaves of the Camellia sinesis plant , which is an evergreen from Asia.",
      "I think earl gray is the best in my opinion",
      "That is a good one! Tea is popular that it is the most widely drunk beverage after water.",
      "sounds good to me!",
      "There are so many types of different teas like Darjeeling, and Chinese greens. They have so many different flavors too.",
      "yeah you get so many to pick from"
    ],
    "suggestions": [
      "The history of tea is long and complex, spreading across multiple cultures over the span of thousands of years.",
      "Tea likely originated in southwest China during the Shang dynasty as a medicinal drink.",
      "Tea is an aromatic beverage commonly prepared by pouring hot or boiling water over cured leaves of the \"Camellia sinensis\", an evergreen shrub (bush) native to Asia.",
      "After water, it is the most widely consumed drink in the world.",
      "Since the eighteenth century, the United Kingdom has been one of the world's greatest tea consumers, with an average annual \"per capita\" tea supply of 1.9 kg (4.18 lbs).",
      "The British Empire was instrumental in spreading tea from China to India; British interests controlled tea production in the subcontinent."
    ],
    "actualResponse": "Tea was originally uses as a medicinal drink back in the day rather than an everyday drink."
  },
  {
    "convesation": [
      "A drum Kit Is also called a drum set And I love playing the drums at my church",
      "I like the drums ",
      "Did you no this about drums,in 2000s some kits also include eclectronics and New Sticks ",
      "Electronics drums?",
      "Some are both electronic and acoustic were used in 2000s",
      "That is very good technology"
    ],
    "suggestions": [
      "A drum kit — also called a drum set, trap set, or simply drums — is a collection of drums and other percussion instruments, typically cymbals, which are set up on stands to be played by a single player, with drumsticks held in both hands, and the feet operating pedals that control the hi-hat cymbal and the beater for the bass drum.",
      "A drum kit consists of a mix of drums (categorized classically as membranophones, Hornbostel-Sachs high-level classification 2) and idiophones - most significantly cymbals, but can also include the woodblock and cowbell (classified as Hornbostel-Sachs high-level classification 1).",
      "Hornbostel–Sachs or Sachs–Hornbostel is a system of musical instrument classification devised by Erich Moritz von Hornbostel and Curt Sachs, and first published in the \"Zeitschrift für Ethnologie\" in 1914.",
      "An English translation was published in the \"Galpin Society Journal\" in 1961.",
      "A percussion instrument is a musical instrument that is sounded by being struck or scraped by a beater (including attached or enclosed beaters or rattles); struck, scraped or rubbed by hand; or struck against another similar instrument.",
      "The percussion family is believed to include the oldest musical instruments, following the human voice."
    ],
    "actualResponse": "Yes but drum kits also membranophones and idiophones"
  },
  {
    "convesation": [
      "I love my mobile phones, can't do without it!",
      "Me too! I couldn't live with texting, email, internet, wifi, apps, video games, and pics.",
      "What's you best brand of mobile phones?",
      "I really like Samsung, but the first mobile phone was actually a Motorola. It weighed 4.4 lbs!",
      "Are motorola brands still in the market?",
      "Motorola was actually sold to Google back in 2012, and then to Lenovo in 2014.",
      "Wow! Never knew that. I see iPhone as a leading brand.all thanks to Steve jobs"
    ],
    "suggestions": [
      "Pixar (), also referred to as Pixar Animation Studios, is an American computer animation film studio based in Emeryville, California that is a subsidiary of The Walt Disney Company.",
      "Pixar began in 1979 as the Graphics Group, part of the Lucasfilm computer division, before its spin-out as a corporation in 1986, with funding by Apple Inc. co-founder Steve Jobs, who became the majority shareholder.",
      "Steven Paul Jobs (; February 24, 1955 – October 5, 2011) was an American entrepreneur, business magnate, inventor, and industrial designer.",
      "He was the chairman, chief executive officer (CEO), and co-founder of Apple Inc.; CEO and majority shareholder of Pixar; a member of The Walt Disney Company's board of directors following its acquisition of Pixar; and the founder, chairman, and CEO of NeXT.",
      "Toy Story is a 1995 American computer-animated buddy comedy adventure film produced by Pixar Animation Studios for Walt Disney Pictures.",
      "The directorial debut of John Lasseter, \"Toy Story\" was the first feature-length computer-animated film and the first feature film produced by Pixar."
    ],
    "actualResponse": "Steve Jobs was an incredible entrepreneur. He actually owned the majority of Pixar."
  },
  {
    "convesation": [
      "The automotive industry is such an important economic sector!  My dad worked in an automotive factory until he retired last year",
      "you know i have some relatives who work for GM and some who retired",
      "GM came about in 1908 as a holding company in Flint, Michigan, while the automotive industry itself began in the 1890s",
      "hard to believe the auto industry has been around that long",
      "I know! And it began with the horseless carriage!  ",
      "one of these days we may go back to the horseless carriage :)",
      "LOL  It was once common that carriages were pulled by animals - usually horses!",
      "i mean horse driven carriage, everything goes back to the horse even horsepower for cars"
    ],
    "suggestions": [
      "This article provides an overview of the automotive industry in countries around the world.",
      "The United States was the world's largest automobile producer by volume from the early years of the 20th century until the 1980s, when it was overtaken by Japan.",
      "The automotive industry in the United States began in the 1890s and, as a result of the size of the domestic market and the use of mass-production, rapidly evolved into the largest in the world.",
      "However, the United States was overtaken as the largest automobile producer by Japan in the 1980s, and subsequently by China in 2008.",
      "France was a pioneer in the automotive industry and is the 11th-largest automobile manufacturer in the world by 2015 unit production and the third-largest in Europe (after Germany and Spain).",
      "It had consistently been the 4th-largest from the end of World War II up to 2000."
    ],
    "actualResponse": "The U.S. produces a lot of cars - after World War II it produced about 75 percent of the world's auto production."
  },
  {
    "convesation": [
      "Do you know any good role-playing games?",
      "No but I would love to learn more about them thats where people assume roles?",
      "Yes I think so.",
      "I think players act out roles of characters in role playing",
      "Kind of like charades I guess.",
      "Yeah some role playing games are live action while others are done through a discussion",
      "What are some examples?"
    ],
    "suggestions": [
      "Labyrinth (or Terra Incognita) is a logical game played with pencil (or pen) and paper by three or more participants.",
      "One participant, known as the \"game master\" or \"game leader\", designs the labyrinth map, sets the game rules, and announces results of every move.",
      "The Legend of the Five Rings Roleplaying Game is a role-playing game originally written by John Wick and published by Alderac Entertainment Group, under license from Five Rings Publishing Group, in 1997.",
      "The game uses the Legend of the Five Rings setting, and primarily the nation of Rokugan, which is based on feudal Japan with influences from other East Asian cultures.",
      "The Simple System is a card based Tabletop role-playing game system that was funded using Kickstarter in May 2014.",
      "The Simple System uses reusable double-sided Character Cards for each player (up to 5 players), Skill Cards and Item Cards with complete rule text to represent commonly used skills, weapons and other items."
    ],
    "actualResponse": "Both forms have a game master and a referee"
  },
  {
    "convesation": [
      "I enjoy a good novel. I read 3 books a week.",
      "That's a ton of reading, wow! I majored in English in college, so I really like reading too. ",
      "It is very relaxing to me",
      "Well, you are not alone. Novels have been around since the early 18th century, according to Ian Watt, who is an expert I learned about in school.",
      "That is interesting. I wonder how they were started?",
      "Well apparently they started in classical Greece and Rome, a good 2000 years ago.  ",
      "how were the first ones written or what about?"
    ],
    "suggestions": [
      "Sir Eglamour of Artois is a Middle English verse romance that was written sometime around 1350.",
      "It is a narrative poem of about 1300 lines, a tail-rhyme romance that was quite popular in its day, judging from the number of copies that have survived – four manuscripts from the 15th century or earlier and a manuscript and five printed editions from the 16th century.",
      "Gothic fiction, which is largely known by the subgenre of Gothic horror, is a genre or mode of literature and film that combines fiction and horror, death, and at times romance.",
      "Its origin is attributed to English author Horace Walpole, with his 1764 novel \"The Castle of Otranto\", subtitled (in its second edition) \"A Gothic Story\".",
      "As a literary genre of high culture, romance or chivalric romance is a type of prose and verse narrative that was popular in the aristocratic circles of High Medieval and Early Modern Europe.",
      "They were fantastic stories about marvel-filled adventures, often of a knight-errant portrayed as having heroic qualities, who goes on a quest, yet it is \"the emphasis on love and courtly manners distinguishes it from the \"chanson de geste\" and other kinds of epic, in which masculine military heroism predominates.\""
    ],
    "actualResponse": "I believe they got started in medieval romance writing, which was in the form of poems and novellas. "
  },
  {
    "convesation": [
      "I work in a preschool educational institute as a teacher. ",
      "Does that pay well?",
      "Not really but I enjoy the social interaction with children.",
      "That is good, do you feel it is rewarding enough to justify the stress?",
      "For me personally, yes. Its just so satisfying to work with children ranging from two to seven years of age.",
      "That is a pretty broad range, how do you deal with that?"
    ],
    "suggestions": [
      "Constructivism is a philosophical viewpoint about the nature of knowledge.",
      "Specifically, it represents an ontological stance.",
      "Psychology is the science of behavior and mind, including conscious and unconscious phenomena, as well as thought.",
      "It is an academic discipline of immense scope and diverse interests that, when taken together, seek an understanding of the emergent properties of brains, and all the variety of epiphenomena they manifest.",
      "Culturally relevant or responsive teaching is a pedagogy grounded in teachers' displaying cultural competence: skill at teaching in a cross-cultural or multicultural setting.",
      "They enable each student to relate course content to his or her cultural context."
    ],
    "actualResponse": "Well mostly using a variety of teaching methods for each different age group."
  },
  {
    "convesation": [
      "I have been experiencing morning sickness for the past three weeks. The nausea and vomiting is terrible",
      "That does not sound good! Maybe you should go and see a doctor?..... maybe you are pregnant?",
      "Yes it can be a symptom of pregnancy. I'll make an appointment soon. ",
      "Tell more more about being pregnant. I have never been.",
      "Also known as gestation. Pregnancy is when one or more offspring develop inside a woman.",
      "Wow, I think it is amazing that the human body can reproduce tow humans at the same time.",
      "It really is amazing. I believe you are more likely to have a multiple pregnancy if you used reproductive technology to get pregnant.  ",
      "Totally true. Because they actually are placing the little humans in there purposefully."
    ],
    "suggestions": [
      "A multiple birth is the culmination of one multiple pregnancy, wherein the mother delivers two or more offspring.",
      "A term most applicable to placental species, multiple births occur in most kinds of mammals, with varying frequencies.",
      "Twins are two offspring produced by the same pregnancy.",
      "Twins can be either \"monozygotic\" (\"identical\"), meaning that they develop from one zygote, which splits and forms two embryos, or \"dizygotic\" (\"fraternal\"), meaning that they develop from two different eggs.",
      "Elizabeth Mary Bryan (13 May 1942 – 21 February 2008) was a British paediatrician who specialised in multiple births and twins.",
      "Elizabeth Bryan was born in Sowerby Bridge, West Yorkshire."
    ],
    "actualResponse": "When non-humans have multiple births the group is called a litter."
  },
  {
    "convesation": [
      "I think I might have to move to Hershey, Pennsylvania, then I can get discounts on chocolate.",
      "That would be amazing! ",
      "Milton Hershey is my hero. What an amazing confectioner.",
      "A true confectionery genius, what is your favorite kind of chocolate?",
      "It's so hard to choose. Probably Cadbury with the caramello and cadbury eggs. It is after all the second largest confectionery brand in the world.",
      "very true! I love peanut m&ms, especially when they are frozen, it gives the chocolate such a wonderful texture in my opinion.",
      "Yum. Just yum. I love Reese's Peanut Butter Cups. They are made by Hershey's too.",
      "Hershey's just makes the absolute best things in life!"
    ],
    "suggestions": [
      "The history of Hersheypark begins with the founding of the town of Hershey in 1903.",
      "The owner of the Hershey Chocolate Company surveyed a nearby area of land, which was to become a leisure park for the employees of his chocolate company.",
      "Hersheypark (known as Hershey Park until 1970) is a family theme park situated in Hershey, Derry Township, Pennsylvania, United States, about east of Harrisburg, and west of Philadelphia.",
      "Founded in 1906 by Milton S. Hershey, as a leisure park for the employees of the Hershey Chocolate Company, the park is wholly and privately owned by Hershey Entertainment & Resorts Company .",
      "The Hershey Company, known until April 2005 as the Hershey Foods Corporation and commonly called Hershey's, is an American company and one of the largest chocolate manufacturers in the world.",
      "Its headquarters are in Hershey, Pennsylvania, which is also home to Hershey's Chocolate World."
    ],
    "actualResponse": "That is so true. The owner of Hershey's even made a leisure park for the employees of his company. "
  },
  {
    "convesation": [
      "I enjoy scuba diving",
      "Yeah,guess it a type of under water diving by the aid of a breathing apparatus",
      "The first time I went under water with the mask, I felt claustrophobic and was panicky",
      "Yeah, esp.during immersion in water and exposure to high ambient pressure",
      "It is definitely a very different sensation",
      "Its called the Physiology of underwater diving,sensational indeed!",
      "After getting used to it I was fine and able to enjoy myself"
    ],
    "suggestions": [
      "Human factors are the physical or cognitive properties of individuals, or social behavior which is specific to humans, and influence functioning of technological systems as well as human-environment equilibria.",
      "The safety of underwater diving operations can be improved by reducing the frequency of human error and the consequences when it does occur.",
      "The safety of underwater diving depends on four factors: the environment, the equipment, behaviour of the individual diver and performance of the dive team.",
      "The underwater environment can impose severe physical and psychological stress on a diver, and is mostly beyond the diver's control.",
      "Scuba diving is a form of underwater diving where the diver uses a self-contained underwater breathing apparatus (scuba) which is completely independent of surface supply, to breathe underwater.",
      "Scuba divers carry their own source of breathing gas, usually compressed air, allowing them greater independence and freedom of movement than surface-supplied divers, and longer underwater endurance than breath-hold divers."
    ],
    "actualResponse": "Safety first depends on four factors,the environment, the equipment, behaviour of the individual diver and performance of the dive team"
  },
  {
    "convesation": [
      "Hey! I love nail art!",
      "What's so special about it?",
      "It is a creative way to paint, decorate and be creative with your nails! Have you tried it?",
      "No, is it popular?",
      "Yes! Have you seen Youtube videos? They're so creative and they do different kinds for different characters!",
      "I like Youtube. What else is good on there?",
      "You mean aside from wonderful nail art tutorials? There's different vlogs and of course viral videos! ",
      "What is a vlog?"
    ],
    "suggestions": [
      "A video blog or video log, usually shortened to vlog , is a form of blog for which the medium is video, and is a form of web television.",
      "Vlog entries often combine embedded video (or a video link) with supporting text, images, and other metadata.",
      "Bloggingheads.tv (sometimes abbreviated \"bhtv\") is a political, world events, philosophy, and science video blog discussion site in which the participants take part in an active back and forth conversation via webcam which is then broadcast online to viewers.",
      "The site was started by the journalist Robert Wright (\"The Evolution of God\", \"\", ) and the blogger and journalist Mickey Kaus on November 1, 2005.",
      "The Green brothers, John (born August 24, 1977) and Hank (born May 5, 1980), are two American brothers, entrepreneurs, social activists, and YouTube vloggers.",
      "The two extensively work with each other in their lives and careers, having started their collaborative popularity with their \"Brotherhood 2.0\" project in 2007."
    ],
    "actualResponse": "It is a video blog or a video log! Vlog is short for that term! It just a form of video where people blog about their lives!"
  },
  {
    "convesation": [
      "Are you a vegetarian? I am thinking about cutting meat out of my diet, completely.",
      "yeah I'm a vegetarian. I don't eat meat at all, and even animal byproducts",
      "That's pretty great! Are you a vegan, then?",
      "nope, just vegetarian is enough for me. even though humans have hunted animals and eaten them since prehistoric times, I don't!",
      "That's a good attitude. And we live in a time where it is even less important to eat meat.",
      "yeah, and eating meat is unsafe! it'll go bad and rot in just hours and you can get infections from it",
      "I agree. Meat is also a poor choice from an ecological perspective, as well an industry that heavily contributes to global warming!"
    ],
    "suggestions": [
      "Vegetarianism is the practice of abstaining from the consumption of meat (red meat, poultry, seafood, and the flesh of any other animal), and may also include abstention from by-products of animal slaughter.",
      "Vegetarianism may be adopted for various reasons.",
      "Vegetarianism is strongly linked with a number of religions that originated in ancient India (Jainism, Hinduism and Buddhism).",
      "In Jainism, vegetarianism is mandatory for everyone; in Hinduism and Mahayana Buddhism, it is advocated by some influential scriptures and religious authorities.",
      "This article deals with vegetarianism and veganism by country, comparing the prevalence of vegetarianism and veganism in each country when sources are available by the number of vegetarians and vegans, and listing food standards, laws and general cultural attitudes.",
      "Some countries have strong cultural or religious traditions that promote vegetarianism, such as in India, while in other countries secular ethical concerns dominate, including animal rights and environmental protection, along with health concerns."
    ],
    "actualResponse": "I'm also a vegetarian because I'm religious, namely hindu! it's important to me on a health and religious level not to eat meat"
  },
  {
    "convesation": [
      "I love to swim and it keeps me in shape",
      "I like it too. It's a good \"low-impact\" sport compared to running",
      "Yes and I have lung disease its very easy for me to exercise in water, much easier than a gym workout",
      "That would be a much better activity for someone with lung disease than other recreations, sports, or exercises",
      "Yes and its also low impact on my bones and joints. Older people really benefit from swimming",
      "It's low-impact because the human body is only slightly less dense than water, which allows the water to support a person's weight",
      "Oh ok that makes a lot of sense and I noticed I do not get as short of breath swimming versus gym workouts"
    ],
    "suggestions": [
      "The body fat percentage (BFP) of a human or other living being is the total mass of fat divided by total body mass, times 100; body fat includes essential body fat and storage body fat.",
      "Essential body fat is necessary to maintain life and reproductive functions.",
      "Adiposopathy (or sick fat) refers to certain classes of dysfunction of fat cells.",
      "The dysfunctions in question may contribute to many of the adverse metabolic conditions associated with obesity and the associated metabolic syndrome.",
      "Divers wear weighting systems, weight belts or weights to counteract the buoyancy of other diving equipment, such as diving suits and aluminium diving cylinders.",
      "The scuba diver must be weighted sufficiently to be slightly negatively buoyant at the end of the dive when most of the breathing gas has been used, and needs to maintain neutral buoyancy at safety or obligatory decompression stops."
    ],
    "actualResponse": "When you swim, he buoyancy  can depend on how much body fat and how salty the water is"
  },
  {
    "convesation": [
      "do you ever do any cake decorating?",
      "Sometimes but the molded dimensional designs that some decorators do to resemble real life objects or real life people is too much for me. They are beautiful but it seems like such a waste!",
      "Do you mean like it is to pretty to even eat?",
      "Yes! It originated in 17th century Europe, so I can see how it evolved to art, basically.",
      "I can't imagine how they can even do it!  I definetly don't have that skill set!",
      "It takes a lot of dedication. Another cool fact about Europe is that the fall of the Roman Empire happened in AD 476 and this kicked off the Middle Ages.",
      "Wow that is interesting!  Do you enjoy Middle age history?"
    ],
    "suggestions": [
      "In the history of Europe, the Middle Ages (or Medieval Period) lasted from the 5th to the 15th century.",
      "It began with the fall of the Western Roman Empire and merged into the Renaissance and the Age of Discovery.",
      "Medieval cuisine includes foods, eating habits, and cooking methods of various European cultures during the Middle Ages, which lasted from the fifth to the fifteenth century.",
      "During this period, diets and cooking changed less than they did in the early modern period that followed, when those changes helped lay the foundations for modern European cuisine.",
      "The Late Middle Ages or Late Medieval Period was the period of European history lasting from 1250-1500 CE.",
      "The Late Middle Ages followed the High Middle Ages and preceded the onset of the early modern era (and, in much of Europe, the Renaissance)."
    ],
    "actualResponse": "I do, it's fascinating. There's 3 distinct periods of it, early, high and the late middle ages. What about you?"
  },
  {
    "convesation": [
      "I have really bad allergies. ",
      "Oh, I'm sorry to hear that your immune system is hypersensitive to things that usually cause no problem for others. May I ask what you are allergic to?",
      "I am allergic to pollen and some dander. When it's pollen season my allergies go crazy. ",
      "Sorry to hear that. I've been told I'm allergic to penicillin. Allergies to medications can cause serious reactions. ",
      "I didn't know you could be allergic to medicine. What else can people become allergic to?",
      "Insect stings and food, to name a few. ",
      "Oh yea that's right. I heard allergies to bee stings can be very dangerous. Is that true?"
    ],
    "suggestions": [
      "Anaphylaxis is a serious allergic reaction that is rapid in onset and may cause death.",
      "It typically causes more than one of the following: an itchy rash, throat or tongue swelling, shortness of breath, vomiting, lightheadedness, and low blood pressure.",
      "The jack jumper ant (\"Myrmecia pilosula\"), commonly known as the hopper ant, jumper ant or jumping jack, is a species of venomous ant native to Australia.",
      "Most commonly found in Tasmania and southeast mainland Australia, it is a member of the genus \"Myrmecia\", subfamily Myrmeciinae, and was formally described and named by British entomologist Frederick Smith in 1858.",
      "A bee sting is a sting from a bee (honey bee, bumblebee, sweat bee, etc.).",
      "The stings of most of these species can be quite painful, and are therefore keenly avoided by many people."
    ],
    "actualResponse": "For some people I believe a bee sting can cause anaphylaxis, which is a serious allergic reaction that can result in death! "
  },
  {
    "convesation": [
      "I used to love being read fairy tales when I was a child. What's your favorite fairy tale?",
      "The Adventures of Pinocchio is my favourite!  It's so far-fetched and can't possibly be true!  Or can it?",
      "Who knows??? It was written by an Italian, so anything could be true, lol. I think my favorite is Cinderella.",
      "I also like fairy tales with folkloric fantasy characters, elves, and unicorns!  ",
      "Yes! The Brothers Grimm did a great like in those types of characters. Now I want to read them again!",
      "Those books are awesome!  Jacob and Wilhelm Grimm were so talented!  I also like the tv show called Grimm that was based on their stories!",
      "I watch that too - it's fantastic! I wonder if you can read their stories online. Fairy tales are such fun - they take you to the weirdest of places to meet the strangest of folks! "
    ],
    "suggestions": [
      "A fairy tale is a type of short story that typically features folkloric fantasy characters, such as dwarfs, dragons, elves, fairies, giants, gnomes, goblins, griffins, mermaids, talking animals, trolls, unicorns, or witches, and usually magic or enchantments.",
      "Fairy tales may be distinguished from other folk narratives such as legends (which generally involve belief in the veracity of the events described) and explicitly moral tales, including beast fables.",
      "Children's literature or juvenile literature includes stories, books, magazines, and poems that are enjoyed by children.",
      "Modern children's literature is classified in two different ways: genre or the intended age of the reader.",
      "Traditional stories, or stories about traditions, differ from both fiction and nonfiction in that the importance of transmitting the story's worldview is generally understood to transcend an immediate need to establish its categorization as imaginary or factual.",
      "In the academic circles of literature, religion, history, and anthropology, categories of traditional story are important terminology to identify and interpret stories more precisely."
    ],
    "actualResponse": "That's for sure!  Interestingly, most fairy tales have a  European tradition origin and are mostly related to literature for children."
  },
  {
    "convesation": [
      "Grey's Anatomy is a show based on a classic textbook of the same name",
      "I have heard of it but never watched it. Is it about doctors?",
      "Yes it is. It is a medical drama about the profession.",
      "OK. I used to watch ER back when George Clooney was on it. I'm not that into medical shows though.",
      "It was set in Seattle and filed in LA, California.",
      "Who were the main star actors in the show?"
    ],
    "suggestions": [
      "Grey's Anatomy is an American medical drama television series that premiered on March 27, 2005, on American Broadcasting Company (ABC) as a mid-season replacement.",
      "The fictional series focuses on the lives of surgical interns, residents, and attending physicians, as they develop into seasoned doctors while trying to maintain personal lives and relationships.",
      "Meredith Grey, M.D.",
      "is a fictional character from the medical drama television series \"Grey's Anatomy\", which airs on the American Broadcasting Company (ABC) in the United States.",
      "Sadie Harris is a fictional character from the American television medical drama \"Grey's Anatomy\", which airs on the American Broadcasting Company (ABC) in the United States.",
      "The character was created by series producer Shonda Rhimes and portrayed by actress Melissa George."
    ],
    "actualResponse": "The series was originally supposed to be racially diverse. Meredith Grey is the main character."
  },
  {
    "convesation": [
      "Hiking is the preferred term, in Canada and the United States, for a long, vigorous walk, usually on trails ",
      "I like hiking. I almost make sure I'm fully prepared with my camera, a few bottles of water and some snacks. How about you?",
      "Its all about preference! There are terms used to refer to hiking by different countries.",
      "I see, that's very interesting. Do you happen to know any of those other terms?",
      "in the United Kingdom, and the Republic of Ireland, the word \"walking\" is acceptable to describe \"all forms\" of walking, ",
      "Aha, I learned something new this morning! My knowledge bank has expanded.",
      "I'm not done yet! The bank is not exhausted just yet. Moreso,the term bushwalking is endemic to Australia, having been adopted by the Sydney Bush Walkers club in 1927.",
      "Oh, I see, haha! Sorry, that name made me laugh. I don't think I've ever heard of such a thing before."
    ],
    "suggestions": [
      "Hiking is the preferred term, in Canada and the United States, for a long, vigorous walk, usually on trails (footpaths), in the countryside, while the word walking is used for shorter, particularly urban walks.",
      "On the other hand, in the United Kingdom, and the Republic of Ireland, the word \"walking\" is acceptable to describe \"all forms\" of walking, whether it is a walk in the park or backpacking in the Alps.",
      "H. W. (Harold William) Gretton (16 March 1914 – 1983) was a New Zealand poet, lyricist, writer, teacher, journalist, linguist, diarist and Second World War soldier.",
      "In New Zealand, Gretton's tramping songs (popular between the 1950s and 1970s) are still well known today.",
      "Tramping, known elsewhere as backpacking, rambling, hill walking or bushwalking, is a popular activity in New Zealand.",
      "Tramping is defined as a recreational activity involving walking over rough country."
    ],
    "actualResponse": "Also, New Zealand a long, vigorous walk or hike is called tramping."
  },
  {
    "convesation": [
      "I love pizza! Especially fresh pizza. Frozen pizza just doesn't taste the same. ",
      "I agree with you for the most part. I like Home Run Inn frozen pizza but that's the only frozen one I enjoy thus far.",
      "I've never had it. Growing up, my dad used to buy us Ellio's Pizza. They were founded in 1963 in Long Island, NY. ",
      "OK that has to be good, I'm assuming that is fresh NY style pizza? I used to live in Chicago and at that time I had some good Chicago style pizza.",
      "Actually, it was frozen pizza. It was \"9 slices\" of pizza in a box comprising 3 rectangular pizzas, each divisible crosswise into three slices. I will still buy it from time to time just because it reminds me of my dad. I am not a fan of Chicago pizza. ",
      "That sounds like it came with a bunch of pizza. I like bulk pizza like that which can feed a family. It's understandable that you don't like Chicago pizza coming from NY. What is your favorite style of pizza?",
      "Thin crust. It's usually topped with additional vegetables or meats, but I prefer mine with French Fries on top. ",
      "That's interesting, I have never had french fries on my pizza. I like supreme style with stuffed crust preferably."
    ],
    "suggestions": [
      "Pizza Hut is an American restaurant chain and international franchise founded in 1958 by Dan and Frank Carney.",
      "The company is known for its Italian-American cuisine menu including pizza and pasta, as well as side dishes and desserts.",
      "Stuffed crust pizza is pizza with cheese and may include other toppings added into the crust.",
      "The stuffed crust pizza was popularized by Pizza Hut which debuted this style of pizza in 1995.",
      "During the latter half of the 20th century, pizza became a globally accessible dish, mainly due to Italian immigrants that had brought their dishes to new people with resounding success, often in racially and culturally resistive environments.",
      "A survey from 2004 showed that Norwegians eat the most frozen pizza (5.4 kg/person*year), followed by Germans."
    ],
    "actualResponse": "Ah, so I guess you prefer Pizza Hut. They debuted the stuffed crust pizza back on March 26, 1995. "
  },
  {
    "convesation": [
      "I have been meeting with a finance advisory to help me learn about investments. ",
      "Sounds interesting, Investing goes a long way of you know what your doing. ",
      "Yes I know it can also be a risk at times depending on the price but thats why I want to learn to do it the right way. ",
      "Learning the proper ways to invest can lead to good returns. But sometimes you must take risks. ",
      "You're right it is about taking a risk I'm thinking about investing in 2 out of the three categories which is public finance and personal finance. ",
      "Its good to start out slow when investing to test the water so to speak before making the bigger investments. ",
      "That's what my husband said as well he did finance for paying a debt obligations though and after doing that he got a small stock open to test it out I think I will start off investing about 500 dollars minimum.",
      "That sounds like a great plan, His experience with financing int he past will be beneficial to investing. "
    ],
    "suggestions": [
      "A credit rating agency (CRA, also called a ratings service) is a company that assigns credit ratings, which rate a debtor's ability to pay back debt by making timely interest payments and the likelihood of default.",
      "An agency may rate the creditworthiness of issuers of debt obligations, of debt instruments, and in some cases, of the servicers of the underlying debt, but not of individual consumers.",
      "The European debt crisis (often also referred to as the Eurozone crisis or the European sovereign debt crisis) is a multi-year debt crisis that has been taking place in the European Union since the end of 2009.",
      "Several eurozone member states (Greece, Portugal, Ireland, Spain and Cyprus) were unable to repay or refinance their government debt or to bail out over-indebted banks under their national supervision without the assistance of third parties like other Eurozone countries, the European Central Bank (ECB), or the International Monetary Fund (IMF).",
      "Securitization is the financial practice of pooling various types of contractual debt such as residential mortgages, commercial mortgages, auto loans or credit card debt obligations (or other non-debt assets which generate receivables) and selling their related cash flows to third party investors as securities, which may be described as bonds, pass-through securities, or collateralized debt obligations (CDOs).",
      "Investors are repaid from the principal and interest cash flows collected from the underlying debt and redistributed through the capital structure of the new financing."
    ],
    "actualResponse": "Yes it was but he not as dedicated as me now he been into his credit rating and paying interest payments so he still kind of staying on track with finance lol."
  },
  {
    "convesation": [
      "i recently discovered a new love for indian food",
      "I don't think I've ever had Indian food. Can you recommend a good dish?",
      ":) that is what I like to know since I just discovered it.",
      "I know that curry is a popular spice used in Indian cuisine! Some curries are spiced with leaves from the curry tree!",
      "what I do not understand, Is curry a spice or a dish? or both?",
      "I thought it was just a spice but apparently curry is a catch-all term that refers to a number of Indian dishes. I wonder if it's spicy?",
      "it seems some dishes lack meat, is that a traditional way they prepare dishes"
    ],
    "suggestions": [
      "Indian cuisine comprises a wide variety of regional and traditional cuisines native to the Indian subcontinent.",
      "Given the range of diversity in soil type, climate, culture, ethnic groups, and occupations, these cuisines vary substantially from each other and use locally available spices, herbs, vegetables, and fruits.",
      "The culture of India refers collectively to the thousands of distinct and unique cultures of all religions and communities present in India.",
      "India's languages, religions, dance, music, architecture, food, and customs differs from place to place within the country.",
      "Curry (, plural curries) is an umbrella term referring to a number of dishes originating in the cuisine of the Indian subcontinent.",
      "The common feature is the use of complex combinations of spices or herbs, usually including fresh or dried hot chillies."
    ],
    "actualResponse": "Yes, a lot of Indian cuisine includes rice and vegetables. Indian food is ever evolving because of the nation's cultural interactions with other societies."
  },
  {
    "convesation": [
      "I love spaghetti and meatballs, what about you? the tomato sauce and the meatballs are great",
      "That is a favorite meal around here! We like to add some vegetables in as well like peppers and mushrooms",
      "there are tons of ways to make it, there are so many traditions of the dish, abruzzo, sicily, and other places in italy",
      "I wonder if anyone knows the original recipe to the tomato sauce, if it has changed throughout the years",
      "Tomato sauce originated in italy, but it has changed a bunch just with variations",
      "Do italians use hamburger meat for their meat balls or like sausage",
      "My family is very italian and I would say it is about even, but usually we eat sauasage as its own dish, although I am not a ahuge fan of it most of the time",
      "thats cool. we usually dont eat meatballs in ours just hamburger meat ground up, but personally i prefer the meatballs lol"
    ],
    "suggestions": [
      "Spaghetti with meatballs (or spaghetti and meatballs) is an American dish consisting of spaghetti, tomato sauce and meatballs.",
      "It is widely believed that spaghetti with meatballs was an innovation of early 20th-century Italian immigrants in New York City; the National Pasta Association (originally named the National Macaroni Manufacturers Association) is said to be the first organization to publish a recipe for it, in the 1920s.",
      "Pasta () is a staple food of traditional Italian cuisine, with the first reference dating to 1154 in Sicily.",
      "Also commonly used to refer to the variety of pasta dishes, pasta is typically a noodle made from an unleavened dough of a durum wheat flour mixed with water or eggs and formed into sheets or various shapes, then cooked by boiling or baking.",
      "Italian cuisine is food typical from Italy.",
      "It has developed through centuries of social and economic changes, with roots stretching to antiquity."
    ],
    "actualResponse": "italians actually mock that type of meal because they serve meatballs with egg based baked pasta, which is not how we do it, weird how pretentious some people are"
  },
  {
    "convesation": [
      "I love to read novels. Novels are quite long.",
      "I love to read novels as well.  What kind are your favorite?  Mine is historical novels.",
      "Mine too. I also like romantic fiction but I prefer historical fiction.",
      "Romantic fiction can be ok, if it's not too cheesy.  I like good, meaty novels where I can learn something.",
      "Have you ever heard of the Historical Novel Society? They promote historical fiction.",
      "I have not heard of them!  That sounds like a great society, though!"
    ],
    "suggestions": [
      "The Historical Novel Society (HNS) is a nonprofit international literary society devoted to promotion of and advocacy for the genre of historical fiction.",
      "There are varying definitions as to what types of literature fall within the scope of historical fiction.",
      "Historical fiction is a literary genre in which the plot takes place in a setting located in the past.",
      "Historical fiction can be an umbrella term; though commonly used as a synonym for describing the historical novel; the term can be applied to works in other narrative formats, such as those in the performing and visual arts like theatre, opera, cinema and television, as well as video games and graphic novels.",
      "Alternate history or alternative history (Commonwealth English), sometimes abbreviated as AH, is a genre of fiction consisting of stories in which one or more historical events occur differently.",
      "These stories usually contain \"what if\" scenarios at crucial points in history and present outcomes other than those in the historical record."
    ],
    "actualResponse": "HNS considers historical fiction as any novel written fifty years or more after the events that it is depicting."
  },
  {
    "convesation": [
      "I really love swimming, it's such a great low-impact activity that doesn't stress your joints very much.",
      "I love swimming too! Do you prefer going to a pool or a natural body of water?",
      "I prefer the pools, we have an Olympic-size swimming pool near us, which is the largest size they get. It's great for building endurance.",
      "Oh that sounds great. Do you know any exercises for helping build endurance?",
      "Swimming and running are probably the most common, cycling is good too. I like to mix in strength training to build up my skeletal muscles, build strength, and increase my anaerobic endurance as well.",
      "Thanks for the info! I'm really trying to work out more, but I most days I don't have the motivation."
    ],
    "suggestions": [
      "Strength training is a type of physical exercise specializing in the use of resistance to induce muscular contraction which builds the strength, anaerobic endurance, and size of skeletal muscles.",
      "When properly performed, strength training can provide significant functional benefits and improvement in overall health and well-being, including increased bone, muscle, tendon, and ligament strength and toughness, improved joint function, reduced potential for injury, increased bone density, increased metabolism, increased fitness and improved cardiac function.",
      "Weight training is a common type of strength training for developing the strength and size of skeletal muscles.",
      "It utilizes the force of gravity in the form of weighted bars, dumbbells or weight stacks in order to oppose the force generated by muscle through concentric or eccentric contraction.",
      "Well-being is a much-studied topic in psychology, especially positive psychology.",
      "Related concepts are eudaimonia, happiness, flourishing, quality of life, contentment, and meaningful life."
    ],
    "actualResponse": "It can be tough sometimes, I just think of all the benefits strength training provides like increased overall health and well-being and increased metabolism, for instance, when I need some motivation."
  },
  {
    "convesation": [
      "I only just got up - I'm a night owl and I tend to stay up until late at night!",
      "I used to be a night owl too, but not anymore.  At what time do you go to bed?",
      "I usually go to bed at around three in the morning - right before I go to bed is when I feel the most energetic!",
      "Wow, that is indeed late,  good think you don't have to wake up early.",
      "I know! I could never be an early bird that goes to sleep early and then wakes early!  That's not for me!",
      "I know at one time it was awful for me to have to wake up at seven to go to school and later to work, but I now do it willingly to go for my run.",
      "It's funny that in Scandinavia early birds and night owls are called A-people and B-people  LOL",
      "That is funny indeed.  Of course there are still times when I what to sleep late but for me now late is 9am."
    ],
    "suggestions": [
      "Delayed sleep phase disorder (DSPD), more often known as delayed sleep phase syndrome and also as delayed sleep-wake phase disorder, is a chronic dysregulation of a person's circadian rhythm (biological clock), compared to the general population and relative to societal norms.",
      "The disorder affects the timing of sleep, peak period of alertness, the core body temperature rhythm, and hormonal and other daily cycles.",
      "Non-24-hour sleep–wake disorder (non-24), is one of several chronic circadian rhythm sleep disorders (CRSDs).",
      "It is defined as a \"chronic steady pattern comprising [...] daily delays in sleep onset and wake times in an individual living in society.\"",
      "Insomnia, also known as sleeplessness, is a sleep disorder where people have trouble sleeping.",
      "They may have difficulty falling asleep, or staying asleep as long as desired."
    ],
    "actualResponse": "Maybe I have a delayed sleep-phase disorder - that's one explanation for being a night owl"
  },
  {
    "convesation": [
      "ive had to wear glasses since i was 4",
      "I have worn glasses since Inwas 16. I use them because I can’t read far away. They correct my visual impairment.",
      "im near sighted. i can see close up but it gets blurry farther away",
      "Do your glasses protect your eyes from the sun like sunglasses?",
      "my old pair did but i had to get a new pair when those broke. ",
      "I’ve always wanted to try some smart glasses. It’s like having a small computer you wear on your face!",
      "i would love to own a pair but they are expensive"
    ],
    "suggestions": [
      "Best Buy Co., Inc. is an American multinational consumer electronics corporation headquartered in Richfield, Minnesota, a Minneapolis suburb.",
      "Internationally, it also operates in Canada and Mexico.",
      "Partsearch Technologies, was a Manhattan-based company, started in 2001, had compiled an online catalog of more than eight million spare parts for electronics, appliances and other items.",
      "It offers repair technicians and consumers a single place to find obscure parts and commonly lost items such as batteries.",
      "Future Shop was a Canadian electronics store chain.",
      "It was established in 1982 by Hassan Khosrowshahi."
    ],
    "actualResponse": "Yeah I totally agree. I always hope to test them in the mall or Best Buy."
  },
  {
    "convesation": [
      "ive had an xbox for 10 years now, its really cool! do you play the xbox, are you curious about it like I am?",
      "We have an Xbox 360 and an Xbox one but we hardly play them.",
      "Yea I remember when the The Xbox 360 came out, It was a fantastic developed by Microsoft. I play mine all the time. ",
      "The only thing I hate about Xbox is having to pay for Xbox live.",
      "Well it is an online multiplayer gaming and digital media delivery service with free monthly games, So I guess it has to cost some money to run the service.",
      "Yes, But you have to pay for xbox live just to be able to watch Netflix on your system. Playstation doesn't charge for that.",
      "Thats wild and to think that thing sold over 24 million units sold, People really got it for the games though and didnt care at that time about netflix ect. But yeah I agree paying to watch netlfix is so dumb. ",
      "I think XBoxis more popular because the graphics and games are better."
    ],
    "suggestions": [
      "Oddworld Inhabitants Inc. is an American video game developer founded in 1994 by special-effects and computer-animation veterans Sherry McKenna and Lorne Lanning.",
      "The company is primarily known for the incomplete \"Oddworld Quintology\", a series of award-winning video games about the fictional planet of Oddworld and its native creatures.",
      "Xbox One is a line of eighth generation home video game consoles developed by Microsoft.",
      "Announced in May 2013, it is the successor to Xbox 360 and the third console in the Xbox family.",
      "Xbox Live is an online multiplayer gaming and digital media delivery service created and operated by Microsoft.",
      "It was first made available to the Xbox system in November 2002."
    ],
    "actualResponse": "Yea but when the xbox came to the United States in November 2001, No one really cared about graphics all too much, they just wanted fun games, the original Xbox console had similar graphics to PS2 and some better in most cases. "
  },
  {
    "convesation": [
      "My favorite city is New York.",
      "New York City is the best! I love the fast pace! I wish I could go visit for a \"New York minute\" or two!",
      "Oh, so that's why they say that. What is the population of New York City?",
      "8.5 million people if you can believe it! That's 40% of the population of the entire state! I love how diverse the city is, don't you?",
      "Yes, I do, but why is it so diverse?",
      "New York City is actually the premier gateway into the US for legal immigration.  Because of that over 800 languages can be heard throughout the city!",
      "That's insane, no wonder there are so many opportunities for entrepreneurship there.",
      "Absolutely! So much opportunity! New York City is actually known as being the media, cultural and financial capital of the world! It's also huge in the political, sporting and entertainment industries!",
      "That's awesome! What are some popular attractions and landmarks in New York?"
    ],
    "suggestions": [
      "The Empire State Building is a 102-story Art Deco skyscraper in Midtown Manhattan, New York City.",
      "Designed by Shreve, Lamb & Harmon and completed in 1931, the building has a roof height of and stands a total of tall, including its antenna.",
      "One World Trade Center (also known as 1 World Trade Center, 1 WTC or Freedom Tower) is the main building of the rebuilt World Trade Center complex in Lower Manhattan, New York City.",
      "It is the tallest building in the Western Hemisphere, and the sixth-tallest in the world.",
      "The construction of the first World Trade Center complex in New York City was conceived as an urban renewal project, spearheaded by David Rockefeller, to help revitalize Lower Manhattan.",
      "The project was developed by the Port Authority of New York and New Jersey, which hired architect Minoru Yamasaki who came up with the specific idea for twin towers."
    ],
    "actualResponse": "For sure the World Trade Center and Empire State buildings. But many tourists also like to visit Wall Street. It's an eight-block-long street.  I never realized it was that long, did you?"
  },
  {
    "convesation": [
      "I am a true believer of God. Christianity is a religion based on the life and teachings of Jesus. ",
      "I'm personally agnostic myself.",
      "Christianity is the largerst religion in the world with over 2.4 billion followers.",
      "That's basically 1/3 of the world, wow!",
      "Yeah! They make up the majority of the population in 158 countries.",
      "Wow 158 of them? That's so many!"
    ],
    "suggestions": [
      "Christian theology is the theology of Christian belief and practice.",
      "Such study concentrates primarily upon the texts of the Old Testament and of the New Testament, as well as on Christian tradition.",
      "Jesus (), also referred to as Jesus of Nazareth and Jesus Christ, was a Jewish preacher and religious leader.",
      "He is the central figure of Christianity.",
      "Christianity is rooted in Second Temple Judaism, but the two religions diverged in the first centuries of the Christian Era.",
      "Christianity emphasizes correct belief (or \"orthodoxy\"), focusing on the New Covenant as mediated through Jesus Christ, as recorded in the New Testament."
    ],
    "actualResponse": "They believe that Jesus is the Son of God and the savior of humanity."
  },
  {
    "convesation": [
      "My grandma is from Denmark. I would love to know more about the country.",
      "Denmark, officially the Kingdom of Denmark, is a Nordic country and a sovereign state.",
      "What language do they speak there?",
      "They speak danish wich is not that hard to lear. The Kingdom of Denmark also comprises two autonomous constituent countries",
      "What is an autonomous constituent country?",
      "some examples are, The Faroe Islands and Greenland are two autonomous countries",
      "Are the people of Denmark known for anything?",
      "The country has a population of a population of 5.75 million which is not that much really",
      "That doesn't sound that big. Are they into producing anything special?"
    ],
    "suggestions": [
      "Denmark (; , ), officially the Kingdom of Denmark, is a Nordic country and a sovereign state.",
      "The southernmost of the Scandinavian nations, it is south-west of Sweden and south of Norway, and bordered to the south by Germany.",
      "The history of Denmark as a unified kingdom began in the 8th century, but historic documents describe the geographic area and the people living there—the Danes—as early as 500 AD.",
      "These early documents include the writings of Jordanes and Procopius.",
      "Western civilization traces its roots back to Western Europe and the Western Mediterranean.",
      "It is linked to the Roman Empire and with Medieval Western Christendom which emerged from the Middle Ages to experience such transformative episodes as the Renaissance, the Reformation, the Enlightenment, the Industrial Revolution, scientific revolution, and the development of liberal democracy."
    ],
    "actualResponse": "nothing i know of but, The unified kingdom of Denmark emerged in the 10th century as a proficient seafaring nation"
  },
  {
    "convesation": [
      "I am a vegetarian. This type of diet goes all the way back to ancient India and Greece. No wonder those cuisines have such lovely food for us!",
      "What is your favorite Greek dish? I love gyros, but they aren't vegetarian",
      "I like spanakopita, but I have to say that Indian food, with it's wide use of spices, herbs and vegetables is my favorite cuisine of all!",
      "I love Tikka Masla, and it is an Indian Vegatarian dish!",
      "Paneer tikka masala is lovely. It's the vegetarian alternative to chicken and is made from chunks of marinated paneer.",
      "What is paneer?"
    ],
    "suggestions": [
      "Cheese is a food derived from milk that is produced in a wide range of flavors, textures, and forms by coagulation of the milk protein casein.",
      "It comprises proteins and fat from milk, usually the milk of cows, buffalo, goats, or sheep.",
      "Paneer () is a fresh cheese common in South Asia, especially in Indian, Pakistani, Afghan, Nepali, Sri Lankan, and Bangladeshi cuisines.",
      "It is an unaged, acid-set, non-melting farmer cheese made by curdling heated milk with lemon juice, vinegar, or any other food acids.",
      "The Israeli cuisine ( \"ha-mitbach ha-yisra’eli\") comprises local dishes by people native to Israel and dishes brought to Israel by Jews from the Diaspora.",
      "Since before the establishment of the State of Israel in 1948, and particularly since the late 1970s, an Israeli Jewish fusion cuisine has developed."
    ],
    "actualResponse": "It's an unaged cheese made in India. You curdle milk with lemon juice or some such acid. It sets and you can cut it into cubes."
  },
  {
    "convesation": [
      "Extreme Couponing is so interesting to watch, especially on the show on TLC.",
      "What is extreme couponing?",
      "It basically involves using tons of coupons until a big shopping trip ends up costing almost nothing.",
      "Really - I can't imagine doing that - does it take a lot of effort?",
      "Definitely! You have to cut out a lot of coupons but in the end you save a lot of money.",
      "Have you ever done this or watched someone else do it?",
      "The only time I've seen it is on the TLC show called Extreme Couponing.",
      "I've never seen that show - what amazing purchases have you seen?"
    ],
    "suggestions": [
      "Extreme Couponing (renamed Extreme Couponing: All-Stars for third season) is a scripted American reality television series produced by Sharp Entertainment and aired on cable network TLC in the United States and Canada.",
      "Extreme couponing is an activity that combines shopping skills with couponing in an attempt to save as much money as possible while accumulating the most groceries.",
      "A Tables, Ladders and Chairs match, often abbreviated as a TLC, is a type of professional wrestling match that originated within the World Wrestling Federation (now known as the WWE).",
      "The TLC match is a variation of a ladder match, which is modified to co-emphasize two other weapons: tables and chairs.",
      "TLC is an American basic cable and satellite television network that is owned by Discovery Communications.",
      "Initially focused on educational and learning content, by the late 1990s, the network began to primarily focus towards reality series involving lifestyles, family life, and personal stories."
    ],
    "actualResponse": "On Extreme Couponing on TLC I've seen people buy huge hauls of groceries and not have to pay anything!"
  },
  {
    "convesation": [
      "Chocolate while typically a sweet delicacy  usually prepared with cacao seeds toasted and ground",
      "I like some chocolate but not all",
      "I agree, its a process to make chocolate ! After fermentation, the beans are dried cleaned and roasted. Quite and amazing process.",
      "Definitely, it seems a long and tedious process.",
      "Indeed. Once the shell is removed,  its creation is called the cocoa nibs, I use those on top of salads or stand alone in its original rough form",
      "I have never tried them as far as I can recall",
      "You should ! Once the cocoa mass is liquified, its called chocolate liquor. Sounds amazing :)",
      "I wonder if it is alcoholic"
    ],
    "suggestions": [
      "Chocolate is a typically sweet, usually brown food preparation of \"Theobroma cacao\" seeds, roasted and ground.",
      "It is made in the form of a liquid, paste, or in a block, or used as a flavoring ingredient in other foods.",
      "Baking chocolate, also referred to as bitter chocolate, cooking chocolate and unsweetened chocolate, is a type of chocolate that is prepared or manufactured for baking.",
      "It is used as an ingredient in desserts and in baked goods.",
      "Chocolate chips are small chunks of sweetened chocolate, used as an ingredient in a number of desserts (notably chocolate chip cookies and muffins), in trail mix and less commonly in some breakfast foods such as pancakes.",
      "They are often manufactured as \"teardrop\"-shaped volumes with flat circular bases; another variety of chocolate chips have the shape of rectangular or square blocks."
    ],
    "actualResponse": "Baking chocolate is bitter, but is wonderful for diabetics. especially the dark chocolate"
  },
  {
    "convesation": [
      "Have you ever had pizza? It's my favorite food.",
      "Oh yes! I love pizza. I learned that it was traditionnally topped with only tomato sauce and cheese?",
      "That sounds really bland! I can't imagine pizza without all of the other toppings.",
      "Me neither! Hell, they even deep fry pizza now! I've had one and now the original pizzas are also bland.",
      "Where are your favorite places to get pizza?",
      "It's a bit boring but I'm a big fan of Domino's pizza.",
      "Domino's isn't bad when you're looking for a nice greasy pizza. When I feel classy, I get Boston Pizza."
    ],
    "suggestions": [
      "Boston Pizza (also known as BP and, in the United States and Mexico, as Boston's) is a Canadian-based restaurant chain that owns and franchises locations in Canada, the United States and Mexico.",
      "Boston Pizza began in Edmonton, Alberta, on August 12, 1964, when a Greek immigrant, Gus Agioritis, opened \"Boston Pizza and Spaghetti House\".",
      "The history of pizza begins in antiquity, when various ancient cultures produced flatbreads with toppings.",
      "The precursor of pizza was probably the focaccia, a flat bread known to the Romans as \"panis focacius\", to which toppings were then added.",
      "Although many of the largest restaurant chains in Canada are US-based (McDonald's and Yum Brands among others), Canadian-based restaurant chains are growing and have expanded into other markets, especially the US.",
      "A&W Restaurants entered the Canadian market in 1956."
    ],
    "actualResponse": "Oh yes, Boston Pizza is great but a big pricier. Do you usually eat at the restaurant? I prefer having it delivered and eat at home."
  },
  {
    "convesation": [
      "Hello, How are you?",
      "the chevy or vette is a sports car made by chevrolet",
      "Yes.",
      "the vette has made it through seven generations",
      "Wow. That's an interesting fact. I love Chevy cars!",
      "me took, the first vette was made in 1953 as a show car",
      "Interesting. I don't know much about these cars other than they are fast!"
    ],
    "suggestions": [
      "The Chevrolet Corvette, known colloquially as the Vette or Chevy Corvette, is a sports car manufactured by Chevrolet.",
      "The car has been produced through seven generations.",
      "Warwick Corvette is a line of bass guitars manufactured by the German Warwick bass company.",
      "The Corvette is one of the most popular Warwick basses.",
      "The Chevrolet Corvette (C3) was a sports car that was produced by Chevrolet for the 1968 through 1982 model years.",
      "Engines and chassis components were mostly carried over from the previous generation, but the body and interior were new."
    ],
    "actualResponse": "the corvette was  named by myron scott after a warship called corvette"
  },
  {
    "convesation": [
      "I just adopted a cat at the rescue",
      "That is so sweet. People value their cats so much for companionship, and sometimes even for their ability to catch mice on occasion",
      "Yes I think this one will be a good mouser",
      "Do you know what kind of cat it is? There are more than 70 cat breeds recognized",
      "No I think its a mix breed",
      "I think it's so cool that cats can see in near darkness.",
      "I think its cool that they have such independent personalities",
      "Yes, that is one of the fun things about them. The do have poor color vision though, but also have a better sense of smell than people do",
      "My cat seems really intelligent"
    ],
    "suggestions": [
      "The domestic cat (\"Felis silvestris catus\" or \"Felis catus\") is a small, typically furry, carnivorous mammal.",
      "They are often called house cats when kept as indoor pets or simply cats when there is no need to distinguish them from other felids and felines.",
      "Body language is a type of non-verbal communication in which physical behavior, as opposed to words, are used to express or convey information.",
      "Such behavior includes facial expressions, body posture, gestures, eye movement, touch and the use of space.",
      "Cat communication is the transfer of information by one or more cats that has an effect on the current or future behaviour of another animal, including humans.",
      "Cats use a range of communication modalities including vocal, visual, tactile and olfactory."
    ],
    "actualResponse": "How does it communicate with you? By purring or grunting or I've seen where they can use specific body language to communicate."
  },
  {
    "convesation": [
      "I would love to learn how to play the guitar.",
      "Oh yeah? You mean the fretted musical instrument that has six strings?",
      "Yes. I love the sound of it.",
      "Yeah, the sound is projected acoustically using a hollow wooden or plastic box. That is what makes the sound so nice!",
      "I prefer the acoustic guitar sound.",
      "Me too. :) If you know how to play than you know that it is played by strumming or plucking the strings with your fingers, thumb or fingernails. using the right hand. The left hand is for pressing the strings.",
      "I know that part, but I do not know how to play music.",
      "Which style do you like best? there are 3 types of modern acoustic guitar. The classical guitar, the steel string guitar or the jazz guitar?",
      "Probably the classic guitar would be my favorite."
    ],
    "suggestions": [
      "An electric guitar is a guitar that uses one or more pickups to convert the vibration of its strings into electrical signals.",
      "The vibration occurs when a guitarist strums, plucks, fingerpicks, or taps the strings.",
      "The guitar is a fretted musical instrument that usually has six strings.",
      "The sound is projected either acoustically, using a hollow wooden or plastic and wood box (for an acoustic guitar), or through electrical amplifier and a speaker (for an electric guitar).",
      "A semi-acoustic guitar or hollow-body electric is a type of electric guitar that originates from the 1930s.",
      "It has both a sound box and one or more electric pickups."
    ],
    "actualResponse": "Yeah me too! It just has a wonderful vibration that is amplified by the hollow body of the guitar."
  },
  {
    "convesation": [
      "Do you know how to sew?",
      "Not very well! The most I ever lerned was in a semester of home etiquette class",
      "No worries! Sewing started way back in the Paleolithic era! Pretty cool!",
      "Yea! Are there any specific designs that are common?",
      "Well before there was yarn or fabric to weave, (this is weird I know) stone age people sewed fur and skin clothing thread made of animal parts! Eeeek!",
      "I believe it! Do you know when sewing was first 'invented' if you can really call it that"
    ],
    "suggestions": [
      "A sewing machine is a machine used to stitch fabric and other materials together with thread.",
      "Sewing machines were invented during the first Industrial Revolution to decrease the amount of manual sewing work performed in clothing companies.",
      "The economic history of the United States is about characteristics of and important developments in the U.S. economy from colonial times to the present.",
      "The emphasis is on economic performance and how it was affected by new technologies, the change of size in economic sectors and the effects of legislation and government policy.",
      "Sewing is the craft of fastening or attaching objects using stitches made with a needle and thread.",
      "Sewing is one of the oldest of the textile arts, arising in the Paleolithic era."
    ],
    "actualResponse": "Well, the Paleolific era was the furthest back we have evidence of, but the actual sewing machine came about in the 19th Century."
  },
  {
    "convesation": [
      "I just got my first iPhone. Do you know anything about the iPhone history?",
      "I do!  It was June 29, 2007 when the first iPhone was released!",
      "That is when the first one came out? I didnt think it would be that long ago. Who invented it?",
      "Steve Jobs was the one who invented it - and interestingly, the iPhone has a virtual keyboard!",
      "Oh cool I have heard of him. I believe Steve Jobs passed away.",
      "Yes, sadly, he passed away in 2011.  I was quite the American entrepreneur!",
      "Sounds like it. Is iPhone a huge part of the cell phone market?",
      "I meant HE was the American entrepreneur, not me!  the iPhone does sell well, and has GPS navigation  and can record notes!",
      "Awesome. Ive been enjoying mine so far. Its a great piece of technology. I like using the GPS."
    ],
    "suggestions": [
      "A GPS navigation device, GPS receiver, or simply GPS is a device that is capable of receiving information from GPS satellites and then to calculate the device's geographical position.",
      "Using suitable software, the device may display the position on a map, and it may offer directions.",
      "The Global Positioning System (GPS), originally Navstar GPS, is a space-based radionavigation system owned by the United States government and operated by the United States Air Force.",
      "It is a global navigation satellite system that provides geolocation and time information to a GPS receiver anywhere on or near the Earth where there is an unobstructed line of sight to four or more GPS satellites.",
      "Navteq (styled as 'NAVTEQ') was an American Chicago-based provider of geographic information system (GIS) data and a major provider of base electronic navigable maps.",
      "The company was acquired by Nokia in 2007/2008, and fully merged into Nokia in 2011 to form part of the Here business unit."
    ],
    "actualResponse": "GPS is awesome!  I like that it can  display the position on a map and offer directions - I'd literally be lost without it!"
  },
  {
    "convesation": [
      "i love baking cakes, its so much fun.",
      "I never learned how to bake, but my mom sure is great at it, her cakes and cookies are the best!",
      "what's your favorite?  mine is chocolate, but you need to use fresh cocoa",
      "I like chocolate and then plain old yellow cake. I do not like frosting though actually, I find it to be nasty",
      "i love frosting, but only on vanilla cake not chocolate",
      "I will take the frosting off of the cake usually, I am very picky about it. When was the first cake made?",
      "probably bake when bread was first invented, someone just like sweet bread and bam! cake!",
      "Haha, most likely. I think I like cupcakes the most because I can eat them in one bite typically and they have frosting less often"
    ],
    "suggestions": [
      "A cupcake (also British English: fairy cake; Hiberno-English: bun; Australian English: fairy cake or patty cake) is a small cake designed to serve one person, which may be baked in a small thin paper or aluminum cup.",
      "As with larger cakes, icing and other cake decorations such as fruit and candy may be applied.",
      "Sprinkles Cupcakes is a Beverly Hills, California-based cupcake bakery chain established in 2005.",
      "It is considered one of the first cupcake bakeries.",
      "Twelve Cupcakes is a Singapore based chain cupcakeries selling cupcakes.",
      "Owned by Dhunseri Group, the cupcakery was established in 2011 and is one of the largest in Singapore."
    ],
    "actualResponse": "I love cupcakes, cupcakes are the best cakes."
  },
  {
    "convesation": [
      "I used to work at a pizza joint. Did you ever do that too?",
      "No, I never did, but always found it fascinating the way they throw the dough in the air. ",
      "Pizza is one of the most popular foods in the world! Many different places have their own semi-unique way of making it",
      "Do you know where it originated from?",
      "Yup! Pizza was invented in Naples",
      "Nice. I really like thin crust pizza. ",
      "Oh I do too. It gives it more crunch. It's usually sold fresh or frozen",
      "Yes. I don't understand how they can call deep pan pizza, pizza. It's not real pizza. lol"
    ],
    "suggestions": [
      "Midwestern cuisine is a regional cuisine of the American Midwest.",
      "It draws its culinary roots most significantly from the cuisines of Central, Northern and Eastern Europe, and Native North America, and is influenced by regionally and locally grown foodstuffs and cultural diversity.",
      "Pizza is a traditional Italian dish consisting of a yeasted flatbread typically topped with tomato sauce and cheese and baked in an oven.",
      "It can also be topped with additional vegetables, meats, and condiments, and can be made without cheese.",
      "The history of pizza begins in antiquity, when various ancient cultures produced flatbreads with toppings.",
      "The precursor of pizza was probably the focaccia, a flat bread known to the Romans as \"panis focacius\", to which toppings were then added."
    ],
    "actualResponse": "Yea, it's never been that great to me. I don't get it either, but there are many chain restaurants that specialize in pizza doing it"
  },
  {
    "convesation": [
      "I used to smoke two packs a day.",
      "Wow, that's a lot of smokes in a day!",
      "Once, I almost got Carbon monoxide poising from smoking too much",
      "I'm glad you got through this, I can just imagine how much you have passed through ",
      "Yes with all the negative effects smoke has on our health, I am lucky I was able to stop.",
      "I used to smoke as well but then I stopped when my father got lung cancer and he died ",
      "Very true, thats why a lot of countries have smoking bans that prevent people getting second hand smoke",
      "I even read about a second hand smoker who got cancer. So, it's a win when a government takes initiative to reduce smoking in a country"
    ],
    "suggestions": [
      "Passive smoking is the inhalation of smoke, called second-hand smoke (SHS), or environmental tobacco smoke (ETS), by persons other than the intended \"active\" smoker.",
      "It occurs when tobacco smoke permeates any environment, causing its inhalation by people within that environment.",
      "Tobacco use has predominantly negative effects on human health and concern about health effects of tobacco has a long history.",
      "Research has focused primarily on cigarette tobacco smoking.",
      "Smoking bans (or smoke-free laws) are public policies, including criminal laws and occupational safety and health regulations, that prohibit tobacco smoking in workplaces and other public spaces.",
      "Legislation may also define smoking as more generally being the carrying or possessing of any lit tobacco product."
    ],
    "actualResponse": "That is tragic, I heard that as well that tobacco smoke causes disease, disability and death. "
  },
  {
    "convesation": [
      "I use Netflix all the time. Netflix is an entertainment company which is founded by Reed Hastings and Marc Randolph in August 1997 in California.",
      "I love Netflix too, I binge watch shows on there all the time. How many shows are on Netflix anyways? ",
      "I'm not sure, probably thousands! In 2013, Netflix started making original productions as well as online distribution.",
      "Yeah I just adore Netflix's original shows, What are some good ones I should check out? ",
      "It was in 2007 that Netflix started putting out streaming media, but they kept the DVD and Blu-ray rental system.",
      "Right, thats cool. I had no idea they still did the DVD thing, What is Netflix's highest rated show? do you know? "
    ],
    "suggestions": [
      "Netflix is an American entertainment company founded by Reed Hastings and Marc Randolph on August 29, 1997, in Scotts Valley, California.",
      "It specializes in and provides streaming media and video-on-demand online and DVD by mail.",
      "House of Cards is an American political thriller web television series created by Beau Willimon.",
      "It is an adaptation of the 1990 BBC miniseries of the same name, based on the novel by Michael Dobbs.",
      "Netflix is an American on-demand internet streaming media provider.",
      "The company founded by Reed Hastings and Marc Randolph on August 29, 1997, in Scotts Valley, California."
    ],
    "actualResponse": "The first series produced by Netflix was \"House of Cards\" in 2013."
  },
  {
    "convesation": [
      "Hard to believe, but I have a soft spot for heavy metal sometimes! I know critics often dislike it despite a LARGE fan base, but sometimes ya gotta bang your head",
      "I used to thoroughly enjoy heavy metal when i was younger during my teenage years! Who are some of the best heavy metal bands?  ",
      "Well we could go old school and nostalgic with 3 of the biggest + baddest: Led Zepellin, Black Sabbath, and Deep Purple! Did you have a favorite?",
      "I've heard of all of them except deep purple. Black sabbath is the one with ozzy osbourne right? I can't remember the band i used to listen to but i had the whole album on repeat! What else do you know about heavy metal? ",
      "Yes to Black Sabbath and Ozzy. Like lots of genres, it's seen its share of offshoots and evolution -- like the 80s \"glam metal\" movement with groups like Motley Crue and Poison!",
      "Oh wow, i can definitely appreciate the culture of heavy metal! It was Bullet For My Valentine! they were so good back in the day. Do you know when heavy metal started? ",
      "Late 60s and early 70s, largely in the UK, interestingly. For some reason, it seems very American to me.",
      "That's interesting, so it came out by the end of the hippy era? I have a friend in a heavy metal band i do like the music its very different. What else can you tell me about heavy metal? "
    ],
    "suggestions": [
      "Heavy metal (or simply metal) is a genre of rock music that developed in the late 1960s and early 1970s, largely in the United Kingdom.",
      "With roots in blues rock and psychedelic/acid rock, the bands that created heavy metal developed a thick, massive sound, characterized by highly amplified distortion, extended guitar solos, emphatic beats, and overall loudness.",
      "Rock music is a broad genre of popular music that originated as \"rock and roll\" in the United States in the early 1950s, and developed into a range of different styles in the 1960s and later, particularly in the United Kingdom and in the United States.",
      "It has its roots in 1940s and 1950s rock and roll, a style which drew heavily on the African-American genres of blues and rhythm and blues, and from country music.",
      "Blues rock is a fusion genre combining elements of blues and rock.",
      "It is mostly an electric ensemble-style music with instrumentation similar to electric blues and rock: electric guitar, electric bass, and drums, often with Hammond organ."
    ],
    "actualResponse": "Interestingly, its roots are in blues rock and psychedelica -- so right in line with the time it was born. Of course it's got a MUCH bigger, massive sound. AND LOUD!"
  },
  {
    "convesation": [
      "I love salsa dancing for exercise. It works up a sweat!",
      "It's hard to believe that Salsa dancing is so popular in America.  It originated all the way down in the Caribbean.",
      "It's a lot of fun. What else is interesting about it?",
      "The salsa's movements are derived from several other dances' forms, including Puerto Rican bomba and plena, Cuban Son, cha-cha-cha, mambo, and others!",
      "Very cool. So it's a mexture of all those?",
      "Yes, but it actually originated in New York in the mid-1970s!",
      "Really? I'm surprised it originated in the U.S."
    ],
    "suggestions": [
      "Salsa is a popular form of social dance that originated in the Caribbean.",
      "The movements of salsa have origins in Puerto Rican bomba and plena, Cuban Son, cha-cha-cha, mambo and other dance forms.",
      "Salsa music is a popular dance music that initially arose in New York City during the 1960s.",
      "Salsa is the product of various musical genres including the Cuban son montuno, guaracha, cha cha chá, mambo, and to a certain extent bolero, and the Puerto Rican bomba and plena.",
      "The music of Cuba, including its instruments, performance and dance, comprises a large set of unique traditions influenced mostly by west African and European (especially Spanish) music.",
      "Due to the syncretic nature of most of its genres, Cuban music is often considered one of the richest and most influential regional musics of the world."
    ],
    "actualResponse": "I believe that was only one variant, as different regions have their own variations on salsa.  Some of the more known styles are Cuban, Puerto Rican, Cali Colombia, L.A., and New York."
  },
  {
    "convesation": [
      "Jamaica is an awesome island country",
      "And it's also home to Bob Marley.  One of the greatest musicians of all time.",
      "Bob Marley was one of the best singers to exist and also really helped push weed as something that is not a problem",
      "For that I am also very grateful.  Cannabis is a blessing to many people with many otherwise untreatable ailments.",
      "Medical cannabis is such an important tool, its nice that it is becoming something people dont think is bad anymore",
      "From sea to shining sea it's becoming legalized.  Hopefully now there will be meaningful research into it's benefits.",
      "Jamaica even has it legalized due to Marleys influence, what a great island country",
      "Jamaica has some amazing runners.  It's incredible how seemingly out of no where they became a nation with some of the best runners in the world."
    ],
    "suggestions": [
      "This article is about the athletics in Jamaica from the early 20th century to the present.",
      "In 80 years, Jamaica has won 42 Commonwealth Golds, 14 World Championship Golds and 17 Olympic gold medals in athletics alone.",
      "Jamaica sent a delegation to compete at the 2008 Summer Olympics, held in Beijing, People's Republic of China from August 8 to August 24, 2008.",
      "This was, by far, Jamaica's best showing at the Summer Olympics; it was the nation's largest delegation yet, and its athletes nearly doubled its total gold medal count in addition to breaking the nation's record for number of medals earned in a single games.",
      "Usain St Leo Bolt (; born 21 August 1986) is a retired Jamaican sprinter.",
      "He is the first person to hold both the 100 metres and 200 metres world records since fully automatic time became mandatory."
    ],
    "actualResponse": "Yep, Usain bolt is from the country Jamaica and he is probably the best runner to ever live"
  },
  {
    "convesation": [
      "Are you familiar with the early 1970's musicale style disco?",
      "Oh yes I am it was a lot of fun!",
      "Awesome. I remember Disco was hugely popular through the mid 1970s to the early 1980s. It really was a different time.",
      "It was a great time and the music was awesome as well",
      "I remember listening to disco and doing the Bump and the Hustle on the dancefloor.",
      "Yes I did those dances too and remember the disco lights lol",
      "I really like the sounds of disco. The string sections, electric piano, and the electric rhythm guitar were so unique.",
      "Yes and combine the music with a cool place and a disco light and it was a heck of a party"
    ],
    "suggestions": [
      "Disco is a musical style originating in the early 1970s.",
      "It began to emerge from America's urban nightlife scene, where it had been curtailed to house parties and makeshift discotheques from the middle of the decade onwards, after which, it began making regular mainstream appearances, gaining popularity and increasing airplay on radio.",
      "Hip hop or hip-hop is a subculture and art movement developed in The Bronx in New York City during the late 1970s.",
      "The origins of the word are often disputed.",
      "Euro disco (or Eurodisco) is the variety of European forms of electronic dance music that evolved from disco in the later 1970s; incorporating elements of pop, new wave and rock into a disco-like continuous dance atmosphere.",
      "Many Euro disco compositions feature lyrics sung in English, although the singers often share a different mother tongue."
    ],
    "actualResponse": "I wonder what disco was like when it was just house parties. They would make makeshift discotheques."
  },
  {
    "convesation": [
      "I like to play video games. My favorite game to play right now is Minecraft. Do you play video games?",
      "I don't play video games, implying any type of display device that produces 2 or 3 dimensional images.",
      "Ok. Have you ever played one? Maybe Pac-Man or Super Mario? Many people like to play games on their phones these days.",
      "I played Mario Kart a few times with my kids when they were younger on our Wii.",
      "I love Mario Kart. The one that came out on Super Nintendo in the 1990s is still being played today. Amazing how long it has been out.",
      "My husband has an Xbox now but I can't play Mario as it's only at an arcade or the Nintendo game systems",
      "Yes, that is true. The best game for Xbox is Halo. Showtime is going to make a new TV series based off it!",
      "I do enjoy going to Dave and Busters - there aren't many arcades around anymore due to the home game consoles.",
      "We have a Dave and Busters here which my kids love to go to. Yes, when I was a kid I spent a lot of time in arcades. My parents would never let me get a console."
    ],
    "suggestions": [
      "Kinect (codenamed Project Natal during development) is a line of motion sensing input devices that was produced by Microsoft for Xbox 360 and Xbox One video game consoles and Microsoft Windows PCs.",
      "Based around a webcam-style add-on peripheral, it enables users to control and interact with their console/computer without the need for a game controller, through a natural user interface using gestures and spoken commands.",
      "Xbox One is a line of eighth generation home video game consoles developed by Microsoft.",
      "Announced in May 2013, it is the successor to Xbox 360 and the third console in the Xbox family.",
      "Kinect Sports is a sports video game developed by Rare and published by Microsoft Game Studios for the Xbox 360.",
      "The game utilizes the Kinect motion-sensing peripheral and was released in North America, Europe, Australasia and Japan in November 2010 as a launch title for Kinect."
    ],
    "actualResponse": "Now I have used the Kinect sensor for a few games that help with exercise, but it was more for the exercise than anything else."
  },
  {
    "convesation": [
      "My wife suffers from Anxiety disorder, she often feels anxious or some fear.",
      "How does she cope with it?",
      "She usually deals with her inner turmoil and nervous behavior by making tea or sitting alone for a little while reading.",
      "Has she ever tried prescription medication or seen a psychiatrist to get some relief?",
      "She hasn't tried any prescriptions, but she's taken a few over-the-counter drugs to help.  She hasn't been able to see a psychiatrist.",
      "Has she ever tried any homeopathic tricks such as lavender or essential oils?"
    ],
    "suggestions": [
      "Homeopathy is a system of alternative medicine created in 1796 by Samuel Hahnemann, based on his doctrine of \"like cures like\" (\"similia similibus curentur\"), a claim that a substance that causes the symptoms of a disease in healthy people would cure similar symptoms in sick people.",
      "Homeopathy is a pseudoscience – a belief that is incorrectly presented as scientific.",
      "Homeopathy is fairly common in some countries while being uncommon in others.",
      "In some countries, there are no specific legal regulations concerning the use of homeopathy, while in others, licenses or degrees in conventional medicine from accredited universities are required.",
      "Pseudoscience consists of statements, beliefs, or practices that are claimed to be scientific and factual, in the absence of evidence gathered and constrained by appropriate scientific methods.",
      "Pseudoscience is often characterized by contradictory, exaggerated or unfalsifiable claims; reliance on confirmation bias rather than rigorous attempts at refutation; lack of openness to evaluation by other experts; and absence of systematic practices when developing theories."
    ],
    "actualResponse": "She doesn't like homeopathy, she thinks it's a pseudoscience."
  },
  {
    "convesation": [
      "I have bad allergies and it is affected by dust.  I am forever vacuuming!  Are you affected by dust?",
      "Not too much usually - those particles come from sources like soil, pollution, etc.. so I can understand the irritation.",
      "It is really gross if you think about it.  What is the best way to get rid of the dust in my home?",
      "Vacuuming frequently and dusting - but some homes have dust mites also and they can create a lot of dust.",
      "What are dust mites?  Are they like bed bugs or something?",
      "They are basically microscopic arachnids that feed on dead skin cells but don't live on humans.",
      "Yuck!  Are they hazardous to my health?",
      "Well, they and their feces can also produce other allergens but they are heavy and so are not suspended in the air for long.",
      "Will in home pest control sprays be affective in killing them?"
    ],
    "suggestions": [
      "Dust are fine particles of matter.",
      "It generally consists of particles in the atmosphere that come from various sources such as soil, dust lifted by weather (an aeolian process), volcanic eruptions, and pollution.",
      "Mites are small arthropods belonging to the class Arachnida and the subclass Acari (also known as Acarina).",
      "The term \"mite\" refers to the members of several groups in Acari but it is not a clade, and excludes the ticks, order Ixodida.",
      "House dust mites (HDM, or simply dust mites) are a large number of mites found in association with dust in dwellings.",
      "The main species are identified as:  The dust mites are cosmopolitan pyroglyphids."
    ],
    "actualResponse": "Possibly but it may be difficult - they are a nesting species and like dark, warm, and humid places.  They say if your pillow is old, it could actually be 50% dust mites"
  },
  {
    "convesation": [
      "I love watching game shows! They involve answering questions and solving puzzles for money. Do you like them?",
      "Oh yeah I really like Jeopardy and stuff like that, I guess those are trivia shows not game shows though.",
      "The very first TV game show was called Spelling Bee, it was broadcast back in 1938!",
      "Wow all the way back in the black and white TV days! ",
      "Game shows really took off in the 1950's though. That is when they became a popular fixture.",
      "Do you have any examples of some game shows from the 1950s?",
      "Twenty One and The $64,000 question were both very popular.",
      "I'm not familiar with either, can you describe The $64,000 question a bit for me?"
    ],
    "suggestions": [
      "The $64,000 Question is an American game show broadcast from 1955 to 1958, which became embroiled in the 1950s quiz show scandals.",
      "The $64,000 Challenge (1956–1958) was its spin-off show.",
      "Edith Oliver (August 9, 1913—February 23, 1998) was an American theater and film critic who contributed to \"The New Yorker\" magazine from 1947 to 1993.",
      "Before that, she wrote several radio quiz shows, including \"Take It or Leave It: the $64 Question\", which she also produced.",
      "Mastermind is a British game show, well known for its challenging questions, intimidating setting, and air of seriousness.",
      "Devised by Bill Wright, the basic format of \"Mastermind\" has never changed—four and in later contests five or six contestants face two rounds, one on a specialised subject of the contestant's choice, the other a general knowledge round."
    ],
    "actualResponse": "It was just a show were contestants were asked questions devised by the series writer Edith Oliver."
  },
  {
    "convesation": [
      "I have a tattoo.  Do you?  There is a difference between an arm tattoo and a full sleeve.",
      "I do have a tattoo which I regret tremendously. None on my arm though. Do you?",
      "Yes, and luckily it's not in a place that I see everyday.  Not like a sleeve.",
      "I always wonder about people that get sleeves. What are you gonna do when you're like 80 and have a sleeve!?",
      "Right?  Especially neck and face tattoos.  They could try a quarter sleeve instead.",
      "Face and neck tattoos, um, no.  Quarter sleeves I like in men. My husband is working on his."
    ],
    "suggestions": [
      "A sleeve tattoo (or tattoo sleeve) is a large tattoo, or a collection of smaller tattoos, that has a unified theme, that covers most or all of a person's arm, usually from shoulder to wrist.",
      "There is a difference between an arm covered in tattoos and a sleeve tattoo.",
      "A tattoo is a form of body modification where a design is made by inserting ink, dyes and pigments, either indelible or temporary, into the dermis layer of the skin to change the pigment.",
      "Tattoos fall into three broad categories: purely decorative (with no specific meaning); symbolic (with a specific meaning pertinent to the wearer); pictorial (a depiction of a specific person or item).",
      "Tattooing has been practiced across the globe since at least Neolithic times, as evidenced by mummified preserved skin, ancient art, and the archaeological record.",
      "Both ancient art and archaeological finds of possible tattoo tools suggest tattooing was practiced by the Upper Paleolithic period in Europe."
    ],
    "actualResponse": "I can't imagine getting a tattoo that covers the entire upper or lower area of my arm."
  },
  {
    "convesation": [
      "Hi, I am in a motorcycle club! We annoy other drivers on the road!",
      "I like to drive bike. Most of the clubs either organized around a brand or make or type of riding",
      "Bike driving can also be dangerous. it is wise to wear a helmet right?",
      "Yes buddy, Helmet is most important for both biccle and motocycle. It avoidinjuries in head from accidents",
      "Yes it can cause head injury without helmet. It is also safe to drive at slow speeds.",
      "Yes  and also for motorcycle riders helmet is so important",
      "They also wear proper gear like knee pads and leather",
      "And also safety concerns have some equipment design as well as opertor skill",
      "You're right, bikers should also be careful when driving on the highway especially."
    ],
    "suggestions": [
      "A traffic collision, also called a motor vehicle collision (MVC) among other terms, occurs when a vehicle collides with another vehicle, pedestrian, animal, road debris, or other stationary obstruction, such as a tree, pole or building.",
      "Traffic collisions often result in injury, death, and property damage.",
      "Motorcycle safety concerns many aspects of vehicle and equipment design as well as operator skill and training that are unique to motorcycle riding.",
      "According to the U.S. National Highway Traffic Safety Administration (NHTSA), in 2006, 13.10 cars out of 100,000 ended up in fatal crashes.",
      "Automobile safety is the study and practice of design, construction, equipment and regulation to minimize the occurrence and consequences of traffic collisions.",
      "Road traffic safety more broadly includes roadway design."
    ],
    "actualResponse": "Good. Per vehicle fatal crash is 34 times greater than a passengar car"
  },
  {
    "convesation": [
      "i am a carnivore aka a meet eater",
      "What is your favorite meat?",
      "well being that animals depend on flish for nutrient requiremets are obligate carnivores i would go with beef",
      "I think a nice steak tastes the best.",
      "yes and stakes are usually grilled, pan-fried, or broiled.",
      "Do they have good nutrients?",
      "some of the meat that you cook in saucec, such as steak and kidneye pie, or minced meat formed into a stake shape carry good nutrients ",
      "Kidney pie sounds weird!"
    ],
    "suggestions": [
      "An Australian or New Zealand meat pie is a hand-sized meat pie containing diced or minced meat and gravy, sometimes with onion, mushrooms, or cheese and often consumed as a takeaway food snack.",
      "The meat pie is considered iconic in Australia and New Zealand.",
      "A meat pie is a pie with a filling of meat and often other savory ingredients.",
      "They are popular in the United Kingdom, Australia, Ghana, Nigeria, Europe, New Zealand, Canada, Zimbabwe and South Africa.",
      "The Natchitoches meat pie is a regional dish from northern Louisiana, United States.",
      "It is one of the official state foods of Louisiana."
    ],
    "actualResponse": "some like the meat pie which is iconic in australia and new zealand"
  },
  {
    "convesation": [
      "I love spoiling myself every now and then and getting a Manicure for myself",
      "Manicures are a great way to relax and feel pampered in a nail salon! ",
      "I agree, I just feel so relaxed afterwards and less stressed!",
      "Sometimes I feel gratitude after, too. Like I can appreciate things more. ",
      "Yes I agree. I can appreciate the simple things in life like the sounds of birds",
      "Have you ever thought about making a gratitude journal or diary? ",
      "No actually, the thought has never crossed my mind. Perhaps I should?",
      "I haven't ever, either, but I've heard it can help individuals wanting to focus their attention on all the good in their lives. Might be good in these tough times. ",
      "Its important to stay positive so I suppose a gratitude diary would help someone be more positive.  "
    ],
    "suggestions": [
      "Well-being is a much-studied topic in psychology, especially positive psychology.",
      "Related concepts are eudaimonia, happiness, flourishing, quality of life, contentment, and meaningful life.",
      "The World Happiness Report is a measure of happiness published by the United Nations Sustainable Development Solutions Network.",
      "The World Happiness Report is edited by John F. Helliwell, Richard Layard and Jeffrey Sachs.",
      "The economics of happiness or happiness economics is the quantitative and theoretical study of happiness, positive and negative affect, well-being, quality of life, life satisfaction and related concepts, typically combining economics with other fields such as psychology, health and sociology.",
      "It typically treats such happiness-related measures, rather than wealth, income or profit, as something to be maximized."
    ],
    "actualResponse": "Well-being and happiness are important. "
  },
  {
    "convesation": [
      "I used to really love reading as a child. I haven't really practiced much as an adult. I think my reading development and refinement would be better had I continued to read as much as when I was a kid",
      "I started reading before I started school.  It was something I REALLY wanted to do as all the adults around me did.  I read a lot",
      "It's funny to think that in other countries, where we do not know that language, that we would be considered illiterate!",
      "I am pretty certain we would be. Iceland has a HUGE reading program. They give each other books as a preferred gift.",
      "Wow! That is great! I bet their literacy rate greatly exceeds other countries that do not place such high importance on reading and writing!",
      "I agree.  My favorite thing to do is curl up with my Kindle.  I use the library to get my Kindle books free.  It's great"
    ],
    "suggestions": [
      "The Kindle Store is an online e-book e-commerce store operated by Amazon as part of its retail website and can be accessed from any Amazon Kindle, Fire tablet or Kindle mobile app.",
      "At the launch of the Kindle in November 2007, the store had more than 88,000 digital titles available.",
      "The Amazon Kindle is a series of e-readers designed and marketed by Amazon.",
      "Amazon Kindle devices enable users to browse, buy, download, and read e-books, newspapers, magazines and other digital media via wireless networking to the Kindle Store.",
      "Ngā Taonga Sound & Vision is the operating name for The New Zealand Archive of Film, Television and Sound Ngā Taonga Whitiāhua Me Ngā Taonga Kōrero.",
      "The archive was launched on 31 July 2014, following the completion of a three-year process whereby the New Zealand Film Archive absorbed the collections and operations of the RNZ Sound Archives Ngā Taonga Kōrero in 2012 and the Television New Zealand Archive in 2014."
    ],
    "actualResponse": "I don't own a Kindle, but with over 88,000 titles available, I am sure it's a great investment! It's like a library at your fingertips!"
  },
  {
    "convesation": [
      "My next job will be in the judicial court system. Had any experience there?",
      "Not really to be honest, but I do know about it. It's one of the three co-equal branches of the US federal government.",
      "Yes, very filled with red tape. Do you know who appoints them (and me) to the post?",
      "Not really, but the federal courts have three levels so it could be any of them.",
      "Well, the role is to hear and rule on constitutionality of lawss including disputes among parties and states",
      "That's right! The Supreme Court is basically the last resort court since it is the highest in power and only used when necessary.",
      "And even then the cases they take a very limited in number!"
    ],
    "suggestions": [
      "Criminal procedure in South Africa refers to the adjudication process of that country's criminal law.",
      "It forms part of procedural or adjectival law, and describes the means by which its substantive counterpart, South African criminal law, is applied.",
      "The federal judiciary of the United States is one of the three co-equal branches of the federal government of the United States organized under the United States Constitution and laws of the federal government.",
      "Article III of the Constitution requires the establishment of a Supreme Court and permits the Congress to create other federal courts, and place limitations on their jurisdiction.",
      "A supreme court is the highest court within the hierarchy of courts in many legal jurisdictions.",
      "Other descriptions for such courts include court of last resort, apex court, and highest (or final) court of appeal."
    ],
    "actualResponse": "I've definitely noticed that! Have you noticed that there is no basic right of appeal that extends automatically to the Supreme Court?"
  },
  {
    "convesation": [
      "I love coffee so much.  I always drink it with cream and sugar, how about you?",
      "Yes I love coffee and the fact that  it is  prepared from roasted coffee beans",
      "I have heard that you can roast your own beans at home, have you ever tried that?",
      "It would suprise you to know that the type Coffea  is native to tropical Africa",
      "I have never heard of Coffea.  Is that a type of Coffee?",
      "Coffea is a category of coffee. Would you have imagined that  it was exported from Africa to countries around the world",
      "That is amazing!  What does the coffee taste like?",
      "Today as we speak it is plants are now cultivated in over 70 countries including Southeast Asia, India, and Africa",
      "It really is a worldwide business.  I wonder how much coffee is drunk every year."
    ],
    "suggestions": [
      "Coffee is a brewed drink prepared from roasted coffee beans, which are the seeds of berries from the \"Coffea\" plant.",
      "The genus \"Coffea\" is native to tropical Africa (specifically having its origin in Ethiopia and Sudan) and Madagascar, the Comoros, Mauritius, and Réunion in the Indian Ocean.",
      "Indonesia was the fourth largest producer of coffee in the world in 2014.",
      "Coffee in Indonesia began with its colonial history, and has played an important part in the growth of the country.",
      "Coffee production in India is dominated in the hill tracts of South Indian states, with the state of Karnataka accounting 71% followed by Kerala 21% and Tamil Nadu 5% of production of 8,200 tonnes.",
      "Indian coffee is said to be the finest coffee grown in the shade rather than direct sunlight anywhere in the world."
    ],
    "actualResponse": "Two of the most common and popular categories are Arabic and Robusta.Arabica is  less sophisticated but stronger and hardier robusta"
  },
  {
    "convesation": [
      "I love golden retrievers. I think they are such loving and loyal dogs.",
      "They are just beautiful.  They are so easy to train to basic or advanced obedience standards.  they are also always so happy to see you!",
      "Yes. I think they are just about the best dog breed. They also love to play.",
      "They really do. They are long coated with a dense inner coat this means they can play outdoors all day and it also repels water so they can go swimming.",
      "I think it's neat how their special coat helps them to stay cool in the summer and warm in the winter.",
      "True.  They are so popular these days.  They are the third most popular family dog breed in the US because of their friendly nature.",
      "That's not a shock. It seems like there was a spike in popularity when the movie \"Air Bud\" came out."
    ],
    "suggestions": [
      "A service dog is a type of assistance dog specifically trained to help people who have disabilities, such as visual impairment, hearing impairments, mental illnesses (such as post traumatic stress disorder), seizure disorder, mobility impairment, and diabetes.",
      "Desirable character traits in service animals typically include good temperament or psychological make-up (including biddability and trainability) and good health (including physical structure and stamina).",
      "Dogs for Good is a UK-based charity training and providing accredited assistance dogs to people with physical disabilities and children with autism.",
      "Until October 2015 it was called Dogs for the Disabled.",
      "A mobility assistance dog is a service dog trained to assist a physically disabled person who has mobility issues, which may include being wheelchair-dependent.",
      "Among other tasks such as \"providing balance and stability\" and \"pulling wheelchairs or carrying and picking up things for persons with mobility impairments\", a mobility assistance dog can be trained to open and close doors, and operate light switches, and can \"have a major positive impact on the lives of recipients\"."
    ],
    "actualResponse": "You may well be right there.  Another great thing is that they are good for disability assistance dogs for the blind or deaf, due to their willingness to be trained and their good nature."
  },
  {
    "convesation": [
      "So I have a phobia of the dark. I've had it since I was a kid. Apparently it's pretty common, at least that's what my parents told me!",
      "From what I know, it is one of the more common ones. I imagine it's triggered by something, like a scary movie. Do you know anything about yours?",
      "I've always been more scared of imagined dangers that could be there, and not as much as the darkness itself. ",
      "My cousin got his fear after watching 'It' with the clown. I imagine it's similar with you where you got scared at some point and never grew out of it",
      "For me it wasn't so much a movie, but just a general fear. I heard it's pretty natural for kids to some degree. It can be a phase... but I'm still scared, so I guess not haha",
      "Well I'm not an expert so I suppose I don't have the exact answer lol"
    ],
    "suggestions": [
      "Psychoanalysis is a set of theories and therapeutic techniques related to the study of the unconscious mind, which together form a method of treatment for mental-health disorders.",
      "The discipline was established in the early 1890s by Austrian neurologist Sigmund Freud and stemmed partly from the clinical work of Josef Breuer and others.",
      "Sigmund Freud ( ; ; born Sigismund Schlomo Freud; 6 May 1856 – 23 September 1939) was an Austrian neurologist and the founder of psychoanalysis, a clinical method for treating psychopathology through dialogue between a patient and a psychoanalyst.",
      "Freud was born to Galician Jewish parents in the Moravian town of Freiberg, in the Austrian Empire.",
      "Separation anxiety disorder (SAD), is an anxiety disorder in which an individual experiences excessive anxiety regarding separation from home or from people to whom the individual has a strong emotional attachment (e.g., a parent, caregiver, significant other or siblings).",
      "It is most common in infants and small children, typically between the ages of 6–7 months to 3 years, although it may pathologically manifest itself in older children, adolescents and adults."
    ],
    "actualResponse": "Yeah I don't know either. The researchers Sigmund Freud said it was a manifestation of separation anxiety. I don't recall separating from anyone though... "
  },
  {
    "convesation": [
      "if you want to improve your health, I suggest starting with a healthy diet. ",
      "What type of diet do you think is best for weight loss?",
      "I think plant based is a good one. It will help with a reduction of body mass and give good sources of b12",
      "That is good to know. Do you think there are any bad side effects from abstaining from meat?",
      "It is important to know the variations of vegetarianism and you can pick to eat eggs and dairy or not, so you can bypass side effects. ",
      "That makes sense. I know there are many cultures in the world that are strictly vegetarian and seem to be very healthy."
    ],
    "suggestions": [
      "Vegetarianism is the practice of abstaining from the consumption of meat (red meat, poultry, seafood, and the flesh of any other animal), and may also include abstention from by-products of animal slaughter.",
      "Vegetarianism may be adopted for various reasons.",
      "Vegetarianism has its roots in the civilizations of ancient India and ancient Greece.",
      "Vegetarianism is the theory and practice of voluntary non-consumption of the flesh of any animal (including sea animals), with or without also eschewing other animal derivatives (such as dairy products or eggs).",
      "This article deals with vegetarianism and veganism by country, comparing the prevalence of vegetarianism and veganism in each country when sources are available by the number of vegetarians and vegans, and listing food standards, laws and general cultural attitudes.",
      "Some countries have strong cultural or religious traditions that promote vegetarianism, such as in India, while in other countries secular ethical concerns dominate, including animal rights and environmental protection, along with health concerns."
    ],
    "actualResponse": "This is true, and it can be adopted for many various reason, vegetarianism that is."
  },
  {
    "convesation": [
      "I love Walt Disney World officially known as World Disney World Resort.",
      "Disney is pretty cool. I live near Orlando and it brings in so many people.",
      "It is a great holiday destination since the first Walt Disney World opened in October 1, 1971.",
      "What is your favorite Disney character?",
      "I would have to say Bugs Bunny. Whats yours? ",
      "I like Mickey Mouse a lot. He is an icon.",
      "Mickey was created by Disney and Ub Iwerks in 1928.",
      "Do you like Donald Duck at all?"
    ],
    "suggestions": [
      "Donald Duck is a cartoon character created in 1934 at Walt Disney Productions.",
      "Donald is an anthropomorphic white duck with a yellow-orange bill, legs, and feet.",
      "The Mickey Mouse universe is a fictional shared universe which is the setting for stories involving Disney cartoon characters Mickey and Minnie Mouse, Pluto, Goofy, Donald Duck and many other characters.",
      "The universe originated from the \"Mickey Mouse\" animated short films produced by Disney starting in 1928, but its first consistent version was created by Floyd Gottfredson in the \"Mickey Mouse\" newspaper comic strip.",
      "This list of Donald Duck universe characters focuses on Disney cartoon characters who typically appear with Donald Duck and Scrooge McDuck, but are not related to them.",
      "For relatives of Donald and Scrooge, see Duck family (Disney) or Clan McDuck."
    ],
    "actualResponse": "I do. I grew up watching all the Disney characters and like them all as they are a part of my childhood. I do like how Donald wears a sailor shirt and cap."
  },
  {
    "convesation": [
      "My favorite food is pizza! It's a great yeasted flatbread. How about you?",
      "I love pizza. I like deep dish with lots of meat toppings.",
      "Me too! I love the Chicago Deep Dish. It's amazingly stuffed with toppings. Have you tried brick oven pizza?",
      "No I have not but it sounds like it would taste very good. One thing I can't stand is anchovies!",
      "I see! Well there is such a variety of vegetables, meats, and condiments on pizza! How about pineapple? haha",
      "No I don't like sweet toppings on pizza. Give me vegetables and meats instead!",
      "Good call! I'm just glad the modern version of pizza exists! It was created in Naples.",
      "Thank goodness for the Italians or we would be missing out on this wonderful dish!"
    ],
    "suggestions": [
      "Pizza is a traditional Italian dish consisting of a yeasted flatbread typically topped with tomato sauce and cheese and baked in an oven.",
      "It can also be topped with additional vegetables, meats, and condiments, and can be made without cheese.",
      "During the latter half of the 20th century, pizza became a globally accessible dish, mainly due to Italian immigrants that had brought their dishes to new people with resounding success, often in racially and culturally resistive environments.",
      "A survey from 2004 showed that Norwegians eat the most frozen pizza (5.4 kg/person*year), followed by Germans.",
      "The history of pizza begins in antiquity, when various ancient cultures produced flatbreads with toppings.",
      "The precursor of pizza was probably the focaccia, a flat bread known to the Romans as \"panis focacius\", to which toppings were then added."
    ],
    "actualResponse": "I agree! Thank you Italy. In 2009 pizza was recognized as a Speciality Guaranteed Dish!"
  },
  {
    "convesation": [
      "I am allergic to shellfish. Especially molluscs.",
      "That sounds pretty bad. ",
      "Yes it is. Shellfish are not even fish, they are just water-dwelling animals.",
      "Not sure if I like shellfish or not.  Do they have specific names/types I would recognize?",
      "You might be familiar with clams, mussels, oysters, or scallops. Or maybe shrimp, lobster or crabs. I'm allergic to them all!",
      "Oh yes.  I actually do eat those and like them."
    ],
    "suggestions": [
      "Shellfish is a culinary and fisheries term for exoskeleton-bearing aquatic invertebrates used as food, including various species of molluscs, crustaceans, and echinoderms.",
      "Although most kinds of shellfish are harvested from saltwater environments, some kinds are found in freshwater.",
      "Forage fish, also called prey fish or bait fish, are small pelagic fish which are preyed on by larger predators for food.",
      "Predators include other larger fish, seabirds and marine mammals.",
      "The Shellfish Association of Great Britain (SAGB) is a historic association that was founded as the Oyster Merchants’ and Planters’ Association in 1903, it was renamed the SAGB in 1969.",
      "They cover a wide range of topics within the shellfish industry, from trading to advice on nutritional standards and also the sustainability of the industry."
    ],
    "actualResponse": "That's good that you can enjoy them. While you eat the shellfish, the shellfish eat a diet of phytoplankton and zooplankton. Yum!"
  },
  {
    "convesation": [
      "Hello dear, have ever draw anything?",
      "You mean the visual art in which a person uses drawing instruments to mark paper? I have always wanted to be able to draw, but never had the talent.",
      "so what other talents do you have?",
      "I would say I'm pretty good at talking. Drawing is one of the simplest and most efficient means of communicating I find that fascinating.",
      "if you find it fascinating why don't you give it a try",
      "In addition to the artistic forms, drawing is used in a lot more commercial industries. I mean that I find the concept of commucation through pictorals fascinating.",
      "can you tell me more about artistic form?"
    ],
    "suggestions": [
      "An architectural drawing or architect's drawing is a technical drawing of a building (or building project) that falls within the definition of architecture.",
      "Architectural drawings are used by architects and others for a number of purposes: to develop a design idea into a coherent proposal, to communicate ideas and concepts, to convince clients of the merits of a design, to enable a building contractor to construct it, as a record of the completed work, and to make a record of a building that already exists.",
      "Adobe FreeHand (formerly Macromedia Freehand and Aldus Freehand) was a computer application for creating two-dimensional vector graphics oriented primarily to professional illustration, desktop publishing and content creation for the Web.",
      "FreeHand was similar in scope, intended market, and functionality to Adobe Illustrator, CorelDraw and Xara Designer Pro.",
      "Technical drawing, drafting or drawing, is the act and discipline of composing drawings that visually communicate how something functions or is constructed.",
      "Technical drawing is essential for communicating ideas in industry and engineering."
    ],
    "actualResponse": "Sure they usually start as a sketch, which is a quick freehand drawing, not intended to be considered a finished work."
  },
  {
    "convesation": [
      "Watch much cue sports? They're also known as billiard sports.",
      "Not on TV but my friend plays a lot and has competitions with friends ",
      "Wow that's really cool! Universally these sports were just called billiards throughout history.",
      "I don't know a lot about them but they are fun to play when I have a chance.",
      "They're a lot of fun yeah, especially using the cue stick to hit the ball.",
      "My friend grew up in clubs and game rooms and has that stuff all through his house.",
      "That's cool, did they play English billiards? That's what most people play.",
      "I don't know much about it but I'm pretty good for someone who hasn't played much."
    ],
    "suggestions": [
      "Cue sports (sometimes written cuesports), also known as billiard sports,  are a wide variety of games of skill generally played with a cue stick, which is used to strike billiard balls and thereby cause them to move around a cloth-covered billiards table bounded by elastic bumpers known as .",
      "Historically, the umbrella term was billiards.",
      "Carom billiards, sometimes called carambole billiards or simply carambole (and in some cases used as a synonym for the game of straight rail from which many carom games derive), is the overarching title of a family of billiards games generally played on cloth-covered, pocketless tables, which often feature heated slate beds.",
      "In its simplest form, the object of the game is to score or \"counts\" by \"\" one's own off both the opponent's cue ball and the on a single shot.",
      "Billiards at Half-Past Nine () is a 1959 novel by the German author Heinrich Böll.",
      "The entirety of the narrative takes place on the day of September 6, 1958 but the story stretches back through the use of flashbacks and the retelling of memories of the characters."
    ],
    "actualResponse": "Well Americans and Canadians don't really play any particular one, at least when you just refer to it as billiards."
  },
  {
    "convesation": [
      "Hi. We just started alternating shift work where I work. I think I like it.",
      "I quite like it too. It's basically a practice designed to make use of all 24 hours of each day.",
      "I didn't think of it like that. I like the variety so you don't get bored with one way of working.",
      "That's definitely one reason. It's called this because it divides the day into shifts and different groups of workers work these shifts. ",
      "It is kind of hard to get used to staying up all night but I get used to it after a while",
      "Agreed, the whole 24 hour thing can get you some really bad shifts.",
      "You either love or you hate it, I've found",
      "Most people who seem to hate it are those who have families or are married or in a relationship, since shift work can strain these relationships.",
      "Yes, because if you have to sleep during the day, it can be hard on the one who doesn't have to."
    ],
    "suggestions": [
      "Shift work is an employment practice designed to make use of, or provide service across, all 24 hours of the clock each day of the week (often abbreviated as \"24/7\").",
      "The practice typically sees the day divided into shifts, set periods of time during which different groups of workers perform their duties.",
      "A mental disorder, also called a mental illness or psychiatric disorder, is a behavioral or mental pattern that causes significant distress or impairment of personal functioning.",
      "Such features may be persistent, relapsing and remitting, or occur as a single episode.",
      "Shift work sleep disorder (SWSD) is a circadian rhythm sleep disorder characterized by insomnia and excessive sleepiness affecting people whose work hours overlap with the typical sleep period.",
      "There are numerous shift work schedules, and they may be permanent, intermittent, or rotating; consequently, the manifestations of SWSD are quite variable."
    ],
    "actualResponse": "Shift work also causes risk to develop many disorders, so it really has a risk with it/"
  },
  {
    "convesation": [
      "Inlining skating and skating is so fun I love it",
      "i have a pair of roller blades but never used them",
      "Rollar blades are fun as well inline skates are a type of roller skates with usually 2 to 5 wheels in a row",
      "so they are different, I thought roller blades and inline skates were the same",
      "It's actually pretty interesting inline skates were developed as a substitute for ice skates",
      "i can see that, no ice, no ice skating",
      "It wasn't till the 1990s that a company trademarked \"Rollerblade\" and the modern rollerblade was created.",
      "okay, the name rollerblade is just the tradename for inline skates, I got it know"
    ],
    "suggestions": [
      "Inline skates are a type of roller skate used for inline skating.",
      "Unlike quad skates, which have two front and two rear wheels, inline skates typically have two to five wheels arranged in a single line.",
      "Roller in-line hockey is a team sport played on a wood, asphalt, cement or sport tile surface, in which players use a hockey stick to shoot a hard plastic hockey puck into their opponent's goal to score points.",
      "It is considered a contact sport but body checking is prohibited.",
      "Roller skating is the traveling on surfaces with roller skates.",
      "It is a form of recreational activity as well as a sport, and can also be a form of transportation."
    ],
    "actualResponse": "Yep inline skates were actually designed way back in 1849 in france, so they are actually pretty old."
  },
  {
    "convesation": [
      "Iced tea is one of my favorite summer drinks!",
      "I love iced tea! my favorite is Lipton, They are a British brand of tea in case you didnt know, They are owned by the company Unilever.",
      "I didn't know that.  We also buy Lipton tea most often.",
      "Yes Lipton is an all time favorite, In fact  The company got its name after its founder Thomas Lipton",
      "When did he found the company?",
      "It was founded way back in May 10th of 1848, Actually Lipton was born in a tenement in Crown Street in Glasgow.",
      "When did the company go international?",
      "I'm not really sure when they went international but Lipton tea beverages are sold by Pepsi Lipton International today, The company is jointly owned by Unilever and PepsiCo evenly.",
      "I had no idea they were tied to PepsiCo."
    ],
    "suggestions": [
      "PepsiCo, Inc. is an American multinational food, snack, and beverage corporation headquartered in Purchase, New York.",
      "PepsiCo has interests in the manufacturing, marketing, and distribution of grain-based snack foods, beverages, and other products.",
      "Pepsi is a carbonated soft drink produced and manufactured by PepsiCo.",
      "Originally created and developed in 1893 by Caleb Bradham and introduced as Brad's Drink, it was renamed as Pepsi-Cola on August 28, 1898, and then as Pepsi in 1961.",
      "KFC (Kentucky Fried Chicken) was founded by Colonel Harland Sanders, an entrepreneur who began selling fried chicken from his roadside restaurant in Corbin, Kentucky, during the Great Depression.",
      "Sanders identified the potential of restaurant franchising, and the first \"Kentucky Fried Chicken\" franchise opened in Salt Lake City, Utah in 1952."
    ],
    "actualResponse": "Yes I find that fascinating myself, IT goes to show you just how much power that PepsiCo has and how much they own when it comes to beverages. "
  },
  {
    "convesation": [
      "I want to learn to surf do you surf?",
      "I do! Surfing is a surface water sport in which the wave rider, referred to as a surfer, rides on the forward or deep face of a moving wave",
      "Does it take any special equipment to surf?",
      "just a board! Waves suitable for surfing are primarily found in the ocean.",
      "Do most people learn on their own or take lessons?",
      "both it just depends. surfers can also utilize artificial waves such as those from boat wakes!",
      "I did not know that, what else can you tell me about surfing? You seem to know a lot about it",
      "I have heard The native peoples of the Pacific, for instance, surfed waves on alaia, paipo, and other such craft.",
      "Yikes! That sounds dangerous"
    ],
    "suggestions": [
      "Surfing is a surface water sport in which the wave rider, referred to as a surfer, rides on the forward or deep face of a moving wave, which is usually carrying the surfer towards the shore.",
      "Waves suitable for surfing are primarily found in the ocean, but can also be found in lakes or in rivers in the form of a standing wave or tidal bore.",
      "A surfboard is an elongated platform used in the sport of surfing.",
      "Surfboards are relatively light, but are strong enough to support an individual standing on them while riding an ocean surface wave breaking wave.",
      "A surfboard fin or skeg is a hydrofoil mounted at the tail of a surfboard or similar board to improve directional stability and control through foot-steering.",
      "Fins can provide lateral lift opposed to the water and stabilize the board's trajectory, allowing the surfer to control direction by varying their side-to-side weight distribution."
    ],
    "actualResponse": "it can be. i have read that The modern-day definition of surfing, however, most often refers to a surfer riding a wave standing up on a surfboard"
  },
  {
    "convesation": [
      "Do you have any tattoos? I personally am never getting one, it just seems like a terrible decision to me",
      "No my dad is covered so as I got older I choose not to insert ink, dyes and pigments, either indelible or temporary, into the dermis layer of the skin",
      "That is good, although my opinion is not the end all be all, I just do not get it, I change my wallpaper every week on my phone, I dislike something so permanent",
      " Tattoos fall into three broad categories, decorative, symbolic and pictorial. I like the ideal of Symbolic which sounds nice until you realize it will remind you of that person that passed or even your entire life. Maybe you should get a foot tattoo?",
      "Yeah I do like symbolic ones, I just feel there are better ways to remember people than a bad decision like that, which could make you get passed up for jobs",
      "Yea, I work a white collar job and we will not even hire anyone with tattoos. It's only been the last 100 years the fashion tattoos have been in fashion. Who's to say what people will think of them in another 100. ",
      "Yeah our culture changes so much, and I sort of get the whole business thing, because it is sort of a bad choice, and it shows a potential, not definite, lack of decision making",
      "I've heard tattooing is very old but the word \"tattoo\", or \"tattow\" did not come around until the 18th century. I wonder what they called them before that.",
      "I am not sure, it must have been an odd cultural thing I suppose!"
    ],
    "suggestions": [
      "A tattoo is a form of body modification where a design is made by inserting ink, dyes and pigments, either indelible or temporary, into the dermis layer of the skin to change the pigment.",
      "Tattoos fall into three broad categories: purely decorative (with no specific meaning); symbolic (with a specific meaning pertinent to the wearer); pictorial (a depiction of a specific person or item).",
      "Tattoo removal has been performed with various tools since the start of tattooing.",
      "While tattoos were once considered permanent, it is now possible to remove them with treatments, fully or partially.",
      "Tattooing has been practiced across the globe since at least Neolithic times, as evidenced by mummified preserved skin, ancient art, and the archaeological record.",
      "Both ancient art and archaeological finds of possible tattoo tools suggest tattooing was practiced by the Upper Paleolithic period in Europe."
    ],
    "actualResponse": "Prior to the word being invented Tattoo's were just referred to as painting, scarring, or staining but had no official name. Crazy "
  },
  {
    "convesation": [
      "What do you think about dieting or conscious control of a diet?",
      "I think it is very important, makes you a lot healthier",
      "Diets are a great way to maintain your body weight and improve your health, I try to keep a healthy diet at all times, but it is hard.",
      "It really is hard, eating 1000 calories over is so much easier than 1000 less",
      "Isn't that the truth!! have you ever tried any low carbohydrate,very low calorie or low-fat diets for weight loss?",
      "Ive tried a few but simply cutting calories worked best for me",
      "That is smart, that is what I usually do, I think it's crazy there are people dieting to gain weight!",
      "Well its good to bulk to gain maximum gains possible when working out"
    ],
    "suggestions": [
      "Body image is a person's perception of the aesthetics or sexual attractiveness of their own body.",
      "The phrase \"body image\" was first coined by the Austrian neurologist and psychoanalyst Paul Schilder in his book \"The Image and Appearance of the Human Body\" (1935).",
      "Media and gender refers to the relationship between media and gender, and how representations of the different genders created for and by mass media.",
      "Media can range from newspapers, magazines, comic strips, novels, CDs and music videos.",
      "Physical attractiveness is the degree to which a person's physical features are considered aesthetically pleasing or beautiful.",
      "The term often implies sexual attractiveness or desirability, but can also be distinct from either."
    ],
    "actualResponse": "Yes, I can understand that, have you ever known anyone with body image disorders, people who have a different perception of their attractiveness of their own body?"
  },
  {
    "convesation": [
      "I love my car it's a Volkswagen Passat!",
      "Great! Passats are very popular around the world, including North America, South Korea, China, and in the Middle East!",
      "I've had it for 7 years.  I'm afraid that may have some issues popping up soon since it's getting old.",
      "That's a good run for a car. Luckily, they have been around since 1973, so many mechanics are familiar with them.",
      "Would you happen to know where they are built?",
      "Many of them have been built since 2011 in Chattanooga, Tennessee",
      "That's great! I'm glad they make them in the USA. Do they make them with diesel engines?",
      "I'm not sure! I do know that many cars in the USA use gasoline, instead of diesel.",
      "Yeah, mine uses gasoline.  How many generations of Passats are there?"
    ],
    "suggestions": [
      "The Volkswagen Passat () is a large family car produced by the German automaker Volkswagen since 1973, through eight design generations.",
      "It is positioned between the Volkswagen Golf (Jetta) and the Volkswagen Phaeton in the current Volkswagen line-up and its derivatives have been badged variously as the Dasher, Santana, Quantum, Magotan, Corsar and Carat.",
      "The 2012 Volkswagen Passat (formerly known as the Volkswagen New Midsize Sedan, or NMS while under development) is a mid-sized sedan which replaces the previous-generation Passat B6 in the North American market.",
      "The model is also shipped overseas to South Korea.",
      "The Volkswagen Passat (B6 & B7) is a front-engine D-segment large family car manufactured and marketed by Volkswagen from 2005-2010 (B6) and from 2010-2015 (B7, facelift).",
      "Respectively the six and seventh generation Passat, and internally designated \"B6\" and \"B7\", they were marketed in sedan and wagon body styles in front-wheel as well as all-wheel drive configurations, with a range of petrol and diesel engines."
    ],
    "actualResponse": "Since 1973, the Passat has gone through eight design changes."
  },
  {
    "convesation": [
      "Do you watch any television shows? I really like watching Grey's Anatomy on ABC. A classic medical drama.",
      "Most homes have more than 1 TV,",
      "That's true. I have 3 in my home, that's not counting computers, tablets, and phones to watch TV as well!",
      "Video game research has a history starting in the 1950's",
      "Wow, that is dating back a long ways from the 1980s with Atari and Nintendo, even Sega!",
      "Nintendo headquarters is in Kyoto, Japan",
      "That's cool. Is Japan the birthplace of classic characters like Super Mario and Luigi you think?"
    ],
    "suggestions": [
      "Nintendo Co., Ltd. is a Japanese multinational consumer electronics and video game company headquartered in Kyoto.",
      "Nintendo is one of the world's largest video game companies by market capitalization, creating some of the best-known and top-selling video game franchises, such as \"Mario\", \"The Legend of Zelda\", and \"Pokémon\".",
      "The history of Nintendo traces back to 1889, when it was founded to produce handmade hanafuda cards.",
      "is a Japanese multinational consumer electronics company headquartered in Kyoto, Japan.",
      "Leave Luck to Heaven is the first full-length studio album by American DJ Matthew Dear, released under his birth name.",
      "Released in late 2003, the album’s fusion of pop and minimal techno propelled Dear to international success."
    ],
    "actualResponse": "Many don't know that Nintendo is said to mean \"leave luck to heaven\""
  },
  {
    "convesation": [
      "a lwyer is a person who practiceslaw. such names can be paralegal, advocate, barister, attorney, counselor, solicitor, or chartered legal executive. have you ever met with a lawyer before?",
      "Yes, they once kept me from getting locked up.",
      "the role of a lawyer can actually vary across legal jurisdictons, so if i apply the term more generally i hope you dont mind!",
      "Sure, have you had to seek legal help before?",
      "i have but for a family member not for me. also in most countries particularly civil law countries, theres  a tradition of giving many legal tasks to a variety of civil law notaries, clerks, and scriveners.",
      "Do you know the history of law? How long have people been practicing it? ",
      "i do not but i can tell you working as a lawyer involves the practicalapplication of abstrat legal theories and knowledge to solver specific individual problems or advnce the interst of those who hire lawyers. im not sure howlong law has officially been practiced though",
      "It must be a very stressful job"
    ],
    "suggestions": [
      "A paralegal is an individual, qualified by education, training or work experience, who is employed or retained by a lawyer, law office, corporation, governmental agency, or other entity and who performs specifically delegated substantive legal work for which a lawyer is responsible.",
      "However, this definition varies depending on the jurisdiction; in Ontario, Canada, paralegals are independent legal practitioners, licensed by The Law Society of Upper Canada to provide legal services to members of the public.",
      "A legal document assistant (LDA, also commonly known as \"document technician,\" \"legal document preparer,\" \"legal technician,\" \"online legal document provider\" and \"legal document clerk\") in the United States is a non-lawyer authorized to assist with the preparation of legal instruments.",
      "Unlike a paralegal, legal document assistants do not work under the supervision of an attorney.",
      "Certified Paralegal (CP) or Certified Legal Assistant (CLA) is the title of paralegals in the United States who have passed the Certified Paralegal Exam and have met additional education and experience requirements for certification as a CP or CLA.",
      "In the United States \"paralegal\" and \"legal assistant\" are frequently used interchangeably."
    ],
    "actualResponse": "yes it is,also fun fact in ontario canada licensed paralegals may manage their own legal firm!"
  },
  {
    "convesation": [
      "French fried potatoes are a terrific side dish in North America. ",
      "I love french fries especially with steak. We call them chips over here. What do you like yours with?",
      "Well, they're severed hot and crisp here in USA. I love to slather them with ketchup, and sometimes fry sauce which is kinda like thousand island",
      "I love mine hot and crispy too. I like a lot of salt but not so much ketchup. Do you have yours with a burger? ",
      "Pan fried, broiled or barbequed, hamburgers are all Americans are allowed to eat. That's why I have shooting pains in my left arm a lot of time, but it's okay, really.",
      "Nice. I enjoy a decent barbecue especially with a cold beer and my crispy chips on the side of some juicy grilled meats."
    ],
    "suggestions": [
      "Tequila () is a regional distilled beverage and type of alcoholic drink made from the blue agave plant, primarily in the area surrounding the city of Tequila, northwest of Guadalajara, and in the highlands (\"Los Altos\") of the central western Mexican state of Jalisco.",
      "Aside from differences in region of origin, tequila is a type of mezcal (and the regions of production of the two drinks are overlapping).",
      "Interferon beta-1a (also interferon beta 1-alpha) is a cytokine in the interferon family used to treat multiple sclerosis (MS).",
      "It is produced by mammalian cells, while interferon beta-1b is produced in modified E. coli.",
      "A barbecue grill is a device that cooks food by applying heat from below.",
      "There are several varieties of grills, with most falling into one of two categories: gas-fueled or charcoal."
    ],
    "actualResponse": "Yes, right. It adds a deistinctive smoky flavor to the meat and vegitable shishkabobs, thingy."
  },
  {
    "convesation": [
      "Hi. I love swimming. I float well, probably because I have a good amount of body fat.",
      "I'm pretty good at floating too. My parents had a pool while I was growing up. Where did you learn to swim?",
      "I lived a couple of miles from the beach. I also took swimming lessons at summer camp.",
      "That's cool. What is your favorite type of swimming stroke?",
      "I mostly like to dog paddle, but I like watching the butterfly. It's so fast!",
      "No Kidding! Watching Olympic swimmers like Michael Phelps do it is incredible.",
      "He was amazing! No wonder he has the most Olympic medals of all time.",
      "And he's been doing it for so long. He first qualified for the Olympics when he was 15 back in 2000."
    ],
    "suggestions": [
      "In sports, a winning streak is a consecutive sequence of won games, or won competitions.",
      "It can be applied to teams in team sports, and individuals in individual sports.",
      "Michael Fred Phelps II (born June 30, 1985) is an American retired competitive swimmer and the most successful and most decorated Olympian of all time, with a total of 28 medals.",
      "Phelps also holds the all-time records for Olympic gold medals (23), Olympic gold medals in individual events (13), and Olympic medals in individual events (16).",
      "Jamaica sent a delegation to compete at the 2008 Summer Olympics, held in Beijing, People's Republic of China from August 8 to August 24, 2008.",
      "This was, by far, Jamaica's best showing at the Summer Olympics; it was the nation's largest delegation yet, and its athletes nearly doubled its total gold medal count in addition to breaking the nation's record for number of medals earned in a single games."
    ],
    "actualResponse": "So he was 23 when he got 8 gold medals in Beijing in 2008."
  },
  {
    "convesation": [
      "Do you like plays? Romeo and Juliet is a tragedy written by William Shakespeare",
      "I do like plays, but I've only seen a few, and I've never seen Romeo and Juliet! What it about?",
      "its a classic love story,  It was among Shakespeare's most popular plays during his lifetime and along with \"Hamlet\"",
      "I think there was a movie about Romeo and Juliet, maybe I'll watch it. Can you recommend any other plays?",
      "Tempest is good. Today, the title characters are regarded as archetypal lovers",
      "Oooh! I love a good love story! When were these plays written?"
    ],
    "suggestions": [
      "Romeo and Juliet is a tragedy written by William Shakespeare early in his career about two young star-crossed lovers whose deaths ultimately reconcile their feuding families.",
      "It was among Shakespeare's most popular plays during his lifetime and along with \"Hamlet\", is one of his most frequently performed plays.",
      "Titus Maccius Plautus (c. 254 – 184 BC), commonly known as Plautus, was a Roman playwright of the Old Latin period.",
      "His comedies are the earliest Latin literary works to have survived in their entirety.",
      "Macbeth (; full title The Tragedy of Macbeth) is a tragedy by William Shakespeare; it is thought to have been first performed in 1606.",
      "It dramatises the damaging physical and psychological effects of political ambition on those who seek power for its own sake."
    ],
    "actualResponse": "in th 1500s! Shakespeare borrowed heavily from both but expanded the plot by developing a number of supporting characters, "
  },
  {
    "convesation": [
      "Do you know much about Osteopathic medicinal uses in the USA?",
      "Osteopathic doctors licensed from the US are also able to practice in 65 other countries, including Canada",
      "I did not know that. What does osteopathic even mean? Bones?",
      "Osteopathy deals with muscle tissues and bones, including readjustments",
      "That sounds interesting. Can they also be surgeons?",
      "A doctor of osteopathy can both practice medicine and surgery.",
      "The wonderful world of medicine runs deep. I have a physiology book I need to read"
    ],
    "suggestions": [
      "A medical school is a tertiary educational institution —or part of such an institution— that teaches medicine, and awards a professional degree for physicians and surgeons.",
      "Such medical degrees include the Bachelor of Medicine, Bachelor of Surgery (MBBS, MBChB, BMBS), Doctor of Medicine (MD), or Doctor of Osteopathic Medicine (DO).",
      "A physician assistant (US) or physician associate (UK) is a healthcare professional who practices medicine as a part of a healthcare team with collaborating physicians and other providers.",
      "In the United States, PAs are nationally certified and state licensed to practice medicine.",
      "A clinical officer (CO) is a gazetted officer who provides medical care and treatment.",
      "A clinical officer is qualified and authorized to perform general or specialized medical duties such as diagnosis and treatment of disease and injury, ordering and interpreting medical tests, performing routine medical and surgical procedures, referring patients to other practitioners and managing health facilities, projects and systems."
    ],
    "actualResponse": "Medical schools offer many degrees, even physician assistant programs"
  }
]