[
  {
    "conversation": [
      "I would like to know more about bob ross"
    ],
    "suggestions": [
      "Robert Norman Ross (October 29, 1942 – July 4, 1995) was an American painter, art instructor, and television host.",
      "He was the creator and host of \"The Joy of Painting\", an instructional television program that aired from 1983 to 1994 on PBS in the United States, and also aired in Canada, Latin America, and Europe.",
      "The 2010 \"Tonight Show\" conflict was a media and public relations conflict involving American television network NBC and two of its then-late-night talk show hosts, Conan O'Brien and Jay Leno.",
      "Leno, the host of long-running franchise \"The Tonight Show\" since 1992, and O'Brien, host of \"Late Night\" since 1993, were strong ratings leaders for the network for much of the decade.",
      "\"Eat Bulaga!\"",
      "is the longest-running noontime variety show in the Philippines."
    ],
    "actualResponse": "Ross was an American painter and television host",
    "index": 0,
    "contextLen": 1
  },
  {
    "conversation": [
      "My husband likes video games - I've heard there is one called Quake - do you know much about it?"
    ],
    "suggestions": [
      "id Software LLC (; see Company name) is an American video game developer headquartered in Dallas, Texas.",
      "The company was founded on February 1, 1991, by four members of the computer company Softdisk, programmers John Carmack and John Romero, game designer Tom Hall, and artist Adrian Carmack (no relation to John Carmack).",
      "Doom (typeset as DOOM in official documents) is a 1993 science fiction horror-themed first-person shooter (FPS) video game by id Software.",
      "It is considered one of the most significant and influential titles in video game history, for having helped to pioneer the now-ubiquitous first-person shooter.",
      "First-person shooter (FPS) is a video game genre centered around gun and other weapon-based combat in a first-person perspective; that is, the player experiences the action through the eyes of the protagonist.",
      "The genre shares common traits with other shooter games, which in turn makes it fall under the heading action game."
    ],
    "actualResponse": "Yes, O' my god. Love it! It's a first-person shooter developed by id software. ",
    "index": 1,
    "contextLen": 1
  },
  {
    "conversation": [
      "I'd like to work in finance some day, do you have any good information about different branches of finance so I can maybe narrow it down?"
    ],
    "suggestions": [
      "Venture capital (VC) is a type of private equity, a form of financing that is provided by firms or funds to small, early-stage, emerging firms that are deemed to have high growth potential, or which have demonstrated high growth (in terms of number of employees, annual revenue, or both).",
      "Venture capital firms or funds invest in these early-stage companies in exchange for equity, or an ownership stake, in the companies they invest in.",
      "Finance is a field that deals with the study of investments.",
      "It includes the dynamics of assets and liabilities over time under conditions of different degrees of uncertainty and risk.",
      "The history of private equity and venture capital and the development of these asset classes has occurred through a series of boom and bust cycles since the middle of the 20th century.",
      "Within the broader private equity industry, two distinct sub-industries, leveraged buyouts and venture capital experienced growth along parallel, although interrelated tracks."
    ],
    "actualResponse": "Well, just to clarify finance deals with the  study of investments. That's what you're looking to know about?",
    "index": 2,
    "contextLen": 1
  },
  {
    "conversation": [
      "Hello! I heard you knew a lot about asthma. I have asthma and I'd like to know more about it."
    ],
    "suggestions": [
      "Asthma is a common long-term inflammatory disease of the airways of the lungs.",
      "It is characterized by variable and recurring symptoms, reversible airflow obstruction, and bronchospasm.",
      "Chronic obstructive pulmonary disease (COPD) is a type of obstructive lung disease characterized by long-term breathing problems and poor airflow.",
      "The main symptoms include shortness of breath and cough with sputum production.",
      "The lungs are the primary organs of the respiratory system in humans and many other animals including a few fish and some snails.",
      "In mammals and most other vertebrates, two lungs are located near the backbone on either side of the heart."
    ],
    "actualResponse": "I am sorry you have the long-term inflammatory disease of the airways of the lungs.",
    "index": 3,
    "contextLen": 1
  },
  {
    "conversation": [
      "I once seen the band Rush in concert. it was awesome! Do you listen to them?"
    ],
    "suggestions": [
      "Rush was a Canadian rock band composed of Geddy Lee (bass, vocals, keyboards), Alex Lifeson (guitars) and Neil Peart (drums, percussion, lyrics).",
      "Forming in 1968, the band went through several configurations until arriving at its longest and most popular line-up when Peart replaced original drummer John Rutsey in July 1974, two weeks before the group's first United States tour.",
      "Alexandar Zivojinovich, (born 27 August 1953), better known by his stage name Alex Lifeson, is a Canadian musician, best known as the guitarist of the Canadian rock band Rush.",
      "In 1968, Lifeson co-founded the band that would become Rush, with drummer John Rutsey and bassist and singer Jeff Jones.",
      "Neil Ellwood Peart, (; born September 12, 1952), is a Canadian-American musician and author, best known as the drummer and primary lyricist for the rock band Rush.",
      "Peart has received numerous awards for his musical performances, including an induction into the \"Modern Drummer\" Hall of Fame in 1983, making him the youngest person ever so honoured."
    ],
    "actualResponse": "That's really cool, I don't listen to them but I know a bit about them. They're a Canadian rock band. They have Geddy lee on it, Alex Lifeson and Neil Peart.",
    "index": 4,
    "contextLen": 1
  },
  {
    "conversation": [
      "I like to make bagels."
    ],
    "suggestions": [
      "A bagel ( '; ), also spelled beigel, is a bread product originating in the Jewish communities of Poland.",
      "It is traditionally shaped by hand into the form of a ring from yeasted wheat dough, roughly hand-sized, that is first boiled for a short time in water and then baked.",
      "The Israeli cuisine ( \"ha-mitbach ha-yisra’eli\") comprises local dishes by people native to Israel and dishes brought to Israel by Jews from the Diaspora.",
      "Since before the establishment of the State of Israel in 1948, and particularly since the late 1970s, an Israeli Jewish fusion cuisine has developed.",
      "The cuisine of the United States reflects its history.",
      "The European colonization of the Americas yielded the introduction of a number of ingredients and cooking styles to the latter."
    ],
    "actualResponse": "I enjoy eating them. They're usually topped with seeds baked on the outer crust. What kind of bagels do you like?",
    "index": 5,
    "contextLen": 1
  },
  {
    "conversation": [
      "i love eating on starbucks have you been there?"
    ],
    "suggestions": [
      "Starbucks Corporation is an American coffee company and coffeehouse chain.",
      "Starbucks was founded in Seattle, Washington in 1971.",
      "Seattle is regarded as a world center for coffee roasting and coffee supply chain management.",
      "Related to this, many Seattle-area people are coffee enthusiasts and they maintain a coffee culture in Seattle's many coffeehouses.",
      "Pike Place Market is a public market overlooking the Elliott Bay waterfront in Seattle, Washington, United States.",
      "The Market opened August 17, 1907, and is one of the oldest continuously operated public farmers' markets in the United States."
    ],
    "actualResponse": "I have been, I love Starbucks! I even went to the original location in Seattle, which was founded in 1971. ",
    "index": 6,
    "contextLen": 1
  },
  {
    "conversation": [
      "I have always wanted a pet skunk. I'm not sure if that's a good idea though."
    ],
    "suggestions": [
      "An odor or odour or fragrance is caused by one or more volatilized chemical compounds, generally at a very low concentration, that humans or other animals perceive by the sense of olfaction.",
      "Odors are also commonly called scents, which can refer to both pleasant and unpleasant odors.",
      "Skunks are mammals in the family Mephitidae.",
      "The animals are known for their ability to spray a liquid with a strong unpleasant smell.",
      "Phantosmia (phantom smell), also called an olfactory hallucination, is smelling an odor that is not actually there.",
      "It can occur in one nostril or both."
    ],
    "actualResponse": "It certainly seems risky as the animals are known for their ability to spray a liquid with a strong, unpleasant smell.",
    "index": 7,
    "contextLen": 1
  },
  {
    "conversation": [
      "hello, are you a vegetarian?"
    ],
    "suggestions": [
      "Vegetarianism is the practice of abstaining from the consumption of meat (red meat, poultry, seafood, and the flesh of any other animal), and may also include abstention from by-products of animal slaughter.",
      "Vegetarianism may be adopted for various reasons.",
      "Some people abstain from consuming various foods and beverages in conformity with various religious, cultural, legal or other societal prohibitions.",
      "Many of these prohibitions constitute taboos.",
      "Meat is animal flesh that is eaten as food.",
      "Humans have hunted and killed animals for meat since prehistoric times."
    ],
    "actualResponse": "It just so happens that I am. I abstain from eating meat.",
    "index": 8,
    "contextLen": 1
  },
  {
    "conversation": [
      "My son loves Comic books, but I know literally nothing about them! Are you a comic book fan?"
    ],
    "suggestions": [
      "A comic book or comicbook, also called comic magazine or simply comic, is a publication that consists of comic art in the form of sequential juxtaposed panels that represent individual scenes.",
      "Panels are often accompanied by brief descriptive prose and written narrative, usually dialog contained in word balloons emblematic of the comics art form.",
      "Dutch comics are comics made in the Netherlands.",
      "In Dutch the most common designation for the whole art form is \"strip\" (though the old-fashioned expression \"beeldverhaal\" – \"picture story\" – remains utilized on occasion, particularly in formal texts and treatises on the subject matter), while the word \"comic\" is used for the (usually) soft cover American style comic book format, typically containing translated US superhero material.",
      "The history of comics has followed different paths in different cultures.",
      "Scholars have posited a pre-history as far back as the Lascaux cave paintings."
    ],
    "actualResponse": "I know a bit about them. Comic books are a publication that has sequential panels that represent individual scenes.",
    "index": 9,
    "contextLen": 1
  },
  {
    "conversation": [
      "As much as I love cooking and have a TON of fun doing it, I don't think I'd cut it on a shop like Top Chef."
    ],
    "suggestions": [
      "Top Chef is an American reality competition television series which premiered on March 8, 2006, on Bravo.",
      "The show features chefs competing against each other in various culinary challenges.",
      "Iron Chef America is an American cooking show based on Fuji Television's \"Iron Chef\", and is the second American adaptation of the series, following the failed \"Iron Chef USA\".",
      "The show is produced by Food Network, which also carried a dubbed version of the original \"Iron Chef\".",
      "The first season of the American reality competition show \"Top Chef Masters\" was broadcast on Bravo.",
      "It is a spin-off of Bravo's hit show Top Chef."
    ],
    "actualResponse": "Yes I love that show, I really love how it has lots of chefs competing against each other in various culinary challenges. It makes it more interesting.",
    "index": 10,
    "contextLen": 1
  },
  {
    "conversation": [
      "Skateboarding is a hobby of mine, I am not good at it, but I like it"
    ],
    "suggestions": [
      "Skateboarding is an action sport which involves riding and performing tricks using a skateboard.",
      "Skateboarding can also be considered a recreational activity, an art form, a job, or a method of transportation.",
      "Robert Stanley Dyrdek (born June 28, 1974) is an entrepreneur, former American professional skateboarder, actor, producer, and reality TV star.",
      "He is best known for his roles in the reality shows \"Rob & Big\", \"Rob Dyrdek's Fantasy Factory\" and \"Ridiculousness\".",
      "John Rodney Mullen (born August 17, 1966) is an American professional skateboarder, entrepreneur, inventor, and public speaker who practices freestyle and street skateboarding.",
      "He is widely considered the most influential street skater in the history of the sport, being credited for inventing numerous tricks, including the kickflip, heelflip, impossible, and 360-flip."
    ],
    "actualResponse": "I used to skateboard, but I really didn't have a lot of tricks up my sleeve. Most of the time I was just babysitting my younger brother at skate parks.",
    "index": 11,
    "contextLen": 1
  },
  {
    "conversation": [
      "One of my favorite foods is Macaroni and cheese, do you like Mac n Cheese?"
    ],
    "suggestions": [
      "Macaroni and cheese—also called mac and cheese in American, Canadian, and macaroni pie in Caribbean English; and macaroni cheese in the United Kingdom—is a dish of English origin, consisting of cooked macaroni pasta and a cheese sauce, most commonly cheddar.",
      "It can also incorporate other ingredients, such as breadcrumbs, meat and vegetables.",
      "The product known as Kraft Dinner (KD) in Canada, Kraft Macaroni & Cheese Dinner or Kraft Mac and Cheese in the United States and Australia, and Macaroni Cheese or Cheesey Pasta in the United Kingdom, is a nonperishable, packaged dry macaroni and cheese product.",
      "It was first introduced under the Kraft Dinner name in both Canada and U.S. in 1937.",
      "The following is a list of episodes for the reality television series \"The Great Food Truck Race\" on Food Network.",
      "There are seven truck teams competing in the race for a grand prize of $50,000."
    ],
    "actualResponse": "Macaroni and cheese is my number one comfort food! No lie, I eat it at least 5 times a week!",
    "index": 12,
    "contextLen": 1
  },
  {
    "conversation": [
      "I was thinking about becoming a yoga instructor but I don't know much about it. Do you?"
    ],
    "suggestions": [
      "Yoga (; Sanskrit, योगः Listen) is a group of physical, mental, and spiritual practices or disciplines which originated in ancient India.",
      "There is a broad variety of yoga schools, practices, and goals in Hinduism, Buddhism, and Jainism.",
      "Vihangam Yoga is an ancient meditation technique practiced by Indian seers and sages.",
      "In the current time, it is established by Sadguru Sadafaldeo Ji Maharaj.",
      "Baba Hari Dass (Devanagari: बाबा हरि दास); born 26 March 1923 in Almora near Nainital, Uttar Pradesh, now Uttarakhand, India, is a yoga master, a silent monk, and a commentator of Indian scriptural tradition of Dharma and Moksha.",
      "He was classically trained in Ashtanga Yoga – Raja Yoga of Patanjali (the Yoga of Eight Limbs), as well as Kriya Yoga, Ayurveda, Samkhya, Tantra Yoga, Vedanta, and Sanskrit."
    ],
    "actualResponse": "I do. The word yoga means \"listen\" in Sanskrit. It's a group of practices of both a physical and spiritual bent.",
    "index": 13,
    "contextLen": 1
  },
  {
    "conversation": [
      "Hey! My favorite holiday is halloween because i like dressing up!"
    ],
    "suggestions": [
      "Halloween or Hallowe'en (a contraction of All Hallows' Evening), also known as Allhalloween, All Hallows' Eve, or All Saints' Eve, is a celebration observed in a number of countries on 31 October, the eve of the Western Christian feast of All Hallows' Day.",
      "It begins the three-day observance of Allhallowtide, the time in the liturgical year dedicated to remembering the dead, including saints (hallows), martyrs, and all the faithful departed.",
      "Halloween, a contraction of All Hallows' Eve, is a celebration observed on 31 October, the day before the feast of All Hallows'.",
      "The celebrations and observances of this day occur primarily in regions of the Western world, although some traditions vary significantly between geographical areas.",
      "Halloween Horror Nights (formerly known as Fright Nights) is an annual special event that occurs at Universal Studios Florida, Universal Studios Hollywood, Universal Studios Singapore, and Universal Studios Japan.",
      "Universal Studios remains operational during the day and transitions to Halloween Horror Nights at night."
    ],
    "actualResponse": "Me too! I wish I was young enough to still trick-or-treat, but I also like apple bobbing, playing pranks and visiting haunted houses. All great Halloween traditions!",
    "index": 14,
    "contextLen": 1
  },
  {
    "conversation": [
      "Do you know anything about being lactose intolerant?"
    ],
    "suggestions": [
      "Lactose intolerance is a condition in which people have symptoms due to the decreased ability to digest lactose, a sugar found in milk products.",
      "Those affected vary in the amount of lactose they can tolerate before symptoms develop.",
      "Milk is a white liquid produced by the mammary glands of mammals.",
      "It is the primary source of nutrition for infant mammals (including humans who breastfeed) before they are able to digest other types of food.",
      "Lactagen was a nutritional supplement produced by Ritter Pharmaceuticals that claimed to reduce the symptoms of lactose intolerance.",
      "In 2011, Ritter Pharmaceuticals ceased sales of Lactagen, and other dietary supplements, in order to pursue FDA approval for a treatment for lactose intolerance."
    ],
    "actualResponse": "I think I may have lactose intolerance. I'm having a hard time digesting milk.",
    "index": 15,
    "contextLen": 1
  },
  {
    "conversation": [
      "I was trying to remember the Walt Disney Pictures films I use to watch."
    ],
    "suggestions": [
      "The Evil Queen, also known as the Wicked Queen or just the Queen, and sometimes instead identified by her given name as Queen Grimhilde, is a fictional character who appears in Walt Disney Pictures' first animated feature film \"Snow White and the Seven Dwarfs\" (1937) and a villain character in the extended Disney's \"Snow White\" franchise.",
      "She is based on the Evil Queen character from the European fairy tale \"Snow White\".",
      "Snow White and the Seven Dwarfs is a 1937 American animated musical fantasy film produced by Walt Disney Productions and originally released by RKO Radio Pictures.",
      "Based on the German fairy tale by the Brothers Grimm, it is the first full-length cel animated feature film and the earliest Disney animated feature film.",
      "Disney Princess, also called the Princess Line, is a media franchise owned by The Walt Disney Company.",
      "Created by Disney Consumer Products chairman Andy Mooney in the early 2000s, the franchise features a line-up of fictional female protagonists who have appeared in various Disney franchises."
    ],
    "actualResponse": "There are many Disney movies like Cinderella and Frozen, Actually The studio has produced over 56 films, from \"Snow White and the Seven Dwarfs, My personal favorite is Moana which came out in 2016",
    "index": 16,
    "contextLen": 1
  },
  {
    "conversation": [
      "My favorite food is burritos. They are delicious."
    ],
    "suggestions": [
      "A burrito (, ) is a dish in Mexican and Tex-Mex cuisine that consists of a large wheat tortilla with various fillings.",
      "It is wrapped into a closed-ended cylinder, in contrast to a taco, where the tortilla is simply folded around the fillings.",
      "Tex-Mex cuisine is very popular in Houston.",
      "Many Mexican cuisine restaurants in Houston have aspects that originate from Texas culture.",
      "Tex-Mex (from Texan and Mexican) is a fusion of Mexican and American cuisines, deriving from the culinary creations of Tejanos.",
      "It has spread from border states such as Texas and others in the Southwestern United States to the rest of the country as well as Canada."
    ],
    "actualResponse": "Interetingly burrito is a dish in Mexican and Tex-Mex cuisine ",
    "index": 17,
    "contextLen": 1
  },
  {
    "conversation": [
      "Hi, I am currently a player in the NBA."
    ],
    "suggestions": [
      "The National Basketball Association (NBA) is a men's professional basketball league in North America; composed of 30 teams (29 in the United States and 1 in Canada).",
      "It is widely considered to be the premier men's professional basketball league in the world.",
      "Sports in the United States are an important part of the country's culture.",
      "Based on revenue, the four major professional sports leagues in the United States are Major League Baseball (MLB), the National Basketball Association (NBA), the National Football League (NFL), and the National Hockey League (NHL).",
      "Women's basketball is one of the few women's sports that developed in tandem with its men's counterpart.",
      "It became popular, spreading from the east coast of the United States to the west coast, in large part via women's colleges."
    ],
    "actualResponse": "Wow. The NBA is considered to be the premier men's professional basketball league in the entire world!",
    "index": 18,
    "contextLen": 1
  },
  {
    "conversation": [
      "Do you like to go hiking?"
    ],
    "suggestions": [
      "Mount Adams, known by some Native American tribes as Pahto or Klickitat, is a potentially active stratovolcano in the Cascade Range.",
      "Although Adams has not erupted in more than 1,000 years, it is not considered extinct.",
      "A trail is usually a path, track or unpaved lane or road.",
      "In the United Kingdom and the Republic of Ireland path or footpath is the preferred term for a walking trail.",
      "The California Trail was an emigrant trail of about across the western half of the North American continent from Missouri River towns to what is now the state of California.",
      "After it was established, the first half of the California Trail followed the same corridor of networked river valley trails as the Oregon Trail and the Mormon Trail, namely the valleys of the Platte, North Platte and Sweetwater rivers to Wyoming."
    ],
    "actualResponse": "Hiking up large mountains or trails is not something i like to do",
    "index": 19,
    "contextLen": 1
  },
  {
    "conversation": [
      "I used to go To Las Vegas more often when I lived in Los Angeles, have you ever been?"
    ],
    "suggestions": [
      "The Las Vegas Valley is a major metropolitan area in the southern part of the U.S. state of Nevada.",
      "The state's largest urban agglomeration, it is the heart of the Las Vegas–Paradise-Henderson, NV MSA.",
      "Caesars Palace is a AAA Four Diamond luxury hotel and casino in Paradise, Nevada, United States.",
      "The hotel is situated on the west side of the Las Vegas Strip between Bellagio and The Mirage.",
      "Planet Hollywood Las Vegas (formerly Aladdin) is a hotel and casino located on the Las Vegas Strip in Paradise, Nevada.",
      "It is owned and operated by Caesars Entertainment Corporation."
    ],
    "actualResponse": "I have never been, but always wanted to go. Vegas is renowned for their resorts, gambling, shopping, and fine dining. It sounds so fun!",
    "index": 20,
    "contextLen": 1
  },
  {
    "conversation": [
      "When I was younger I wanted to go to law school."
    ],
    "suggestions": [
      "\"Suits\" is an American legal drama created by Aaron Korsh and premiered on USA Network in June 2011.",
      "The series revolves around Harvey Specter (Gabriel Macht), a senior partner at a top law firm in Manhattan, and his recently hired associate attorney Mike Ross (Patrick J. Adams) as they hide the fact that Mike does not have a law degree.",
      "Archibald \"Archie\" Cox Jr. (May 17, 1912 – May 29, 2004) was an American lawyer and law professor who served as U.S.",
      "Solicitor General under President John F. Kennedy and later as a special prosecutor during the Watergate scandal.",
      "In the United States, a law school is an institution where students obtain a professional education in law after first obtaining an undergraduate degree.",
      "Law schools in the U.S. confer the Juris Doctor degree (J.D."
    ],
    "actualResponse": "Law school can be long and hard. Why didn't you follow through with your dream to become a lawyer?",
    "index": 21,
    "contextLen": 1
  },
  {
    "conversation": [
      "I just started working at an Amazon warehouse. I like it so far!"
    ],
    "suggestions": [
      "Amazon.com, Inc., doing business as Amazon (), is an American electronic commerce and cloud computing company based in Seattle, Washington that was founded by Jeff Bezos on July 5, 1994.",
      "The tech giant is the largest Internet retailer in the world as measured by revenue and market capitalization, and second largest after Alibaba Group in terms of total sales.",
      "Amazon tax collection policy has changed over the years.",
      "In the U.S., state and local sales taxes are levied by state and local governments, not at the federal level.",
      "This is a list of products and services offered by American corporation Amazon.",
      "Amazon product lines include several media (books, DVDs, music CDs, videotapes, and software), apparel, baby products, consumer electronics, beauty products, gourmet food, groceries, health and personal-care items, industrial & scientific supplies, kitchen items, jewelry and watches, lawn and garden items, musical instruments, sporting goods, tools, automotive items and toys & games."
    ],
    "actualResponse": "It is crazy how the company has grown. Amazon started as an online bookstore and slowly started selling other things. ",
    "index": 22,
    "contextLen": 1
  },
  {
    "conversation": [
      "My brother just broke his arm, I wonder how much time he will have a cast. "
    ],
    "suggestions": [
      "A bone fracture (sometimes abbreviated FRX or Fx, F, or #) is a medical condition in which there is a damage in the continuity of the bone.",
      "A bone fracture may be the result of high force impact or stress, or a minimal trauma injury as a result of certain medical conditions that weaken the bones, such as osteoporosis, bone cancer, or osteogenesis imperfecta, where the fracture is then properly termed a pathologic fracture.",
      "A child bone fracture is a medical condition in which a bone of a child (a person younger than the age of 18) is cracked or broken.",
      "About 15% of all injuries in children are fracture injuries.",
      "Orthopedic surgery is the branch of surgery concerned with conditions involving the musculoskeletal system.",
      "Orthopedic surgeons use both surgical and nonsurgical means to treat musculoskeletal injuries, sports injuries, degenerative diseases, infections, bone tumours, and congenital limb deformities."
    ],
    "actualResponse": "A bone fracture is a medical issue when there is damage to the bone continuity. ",
    "index": 23,
    "contextLen": 1
  },
  {
    "conversation": [
      "I love pizza."
    ],
    "suggestions": [
      "Italian cuisine is food typical from Italy.",
      "It has developed through centuries of social and economic changes, with roots stretching to antiquity.",
      "During the latter half of the 20th century, pizza became a globally accessible dish, mainly due to Italian immigrants that had brought their dishes to new people with resounding success, often in racially and culturally resistive environments.",
      "A survey from 2004 showed that Norwegians eat the most frozen pizza (5.4 kg/person*year), followed by Germans.",
      "The cuisine of the United States reflects its history.",
      "The European colonization of the Americas yielded the introduction of a number of ingredients and cooking styles to the latter."
    ],
    "actualResponse": "Me too. Pizza is one of the most traditional Italian dishes.",
    "index": 24,
    "contextLen": 1
  },
  {
    "conversation": [
      "Have you ever watched Friends?"
    ],
    "suggestions": [
      "Friends (stylized as F•R•I•E•N•D•S) is an American television sitcom, created by David Crane and Marta Kauffman, which aired on NBC from September 22, 1994, to May 6, 2004, lasting ten seasons.",
      "With an ensemble cast starring Jennifer Aniston, Courteney Cox, Lisa Kudrow, Matt LeBlanc, Matthew Perry and David Schwimmer, the show revolves around six 20–30-something friends living in Manhattan.",
      "Monica E. Geller is a fictional character, one of the six main characters who appeared in the American sitcom \"Friends\".",
      "Created by David Crane and Marta Kauffman, and portrayed by actress Courteney Cox, Monica appears in each of the show's 236 episodes, from its premiere on September 24, 1994 to its finale on May 6, 2004.",
      "Various characters appeared in the sitcom \"Friends\", which aired for ten seasons on NBC from 1994 to 2004.",
      "It featured six main cast members: Rachel Green (Jennifer Aniston), Phoebe Buffay (Lisa Kudrow), Joey Tribbiani (Matt LeBlanc), Chandler Bing (Matthew Perry), Ross Geller (David Schwimmer) and Monica Geller (Courteney Cox)."
    ],
    "actualResponse": "Friends is an awesome comedy. I used to watch it like every week. Joey is the best character. It's an American television sitcom created by David Crane back in 1994.",
    "index": 25,
    "contextLen": 1
  },
  {
    "conversation": [
      "I love Tea it is so good"
    ],
    "suggestions": [
      "Tea is an aromatic beverage commonly prepared by pouring hot or boiling water over cured leaves of the \"Camellia sinensis\", an evergreen shrub (bush) native to Asia.",
      "After water, it is the most widely consumed drink in the world.",
      "The history of tea is long and complex, spreading across multiple cultures over the span of thousands of years.",
      "Tea likely originated in southwest China during the Shang dynasty as a medicinal drink.",
      "Camellia sinensis is a species of evergreen shrub or small tree whose leaves and leaf buds are used to produce tea.",
      "It is of the genus \"Camellia\" () of flowering plants in the family Theaceae."
    ],
    "actualResponse": "Yes Tea is wonderful. Regular tea is made from the leaves of the Camellia sinesis plant , which is an evergreen from Asia.",
    "index": 26,
    "contextLen": 1
  },
  {
    "conversation": [
      "One of my favorite musician is Ed Sheeran!"
    ],
    "suggestions": [
      "Edward Christopher Sheeran, (born 17 February 1991) is an English singer, songwriter, guitarist, and record producer.",
      "Sheeran was born in Halifax, West Yorkshire, and raised in Framlingham, Suffolk.",
      "x (pronounced \"multiply\") is the second studio album by English singer-songwriter, Ed Sheeran.",
      "It was released on 20 June 2014 in Australia and New Zealand, and worldwide on 23 June through Asylum Records and Atlantic Records.",
      "+ (pronounced \"plus\") is the debut studio album by English singer-songwriter Ed Sheeran.",
      "It was released on 9 September 2011 by Asylum Records and Atlantic Records."
    ],
    "actualResponse": "Do you like Ed Sheeran? He's from England. ",
    "index": 27,
    "contextLen": 1
  },
  {
    "conversation": [
      "My favorite soda is Dr Pepper. Can you tell me about it?"
    ],
    "suggestions": [
      "Dr Pepper is a carbonated soft drink marketed as having a unique flavor.",
      "The drink was created in the 1880s by pharmacist Charles Alderton in Waco, Texas and first served around 1885.",
      "A soft drink (see terminology for other names) is a drink that typically contains carbonated water (although lemonade, among others, is usually not carbonated), a sweetener, and a natural or artificial flavoring.",
      "The sweetener may be sugar, high-fructose corn syrup, fruit juice, sugar substitutes (in the case of diet drinks), or some combination of these.",
      "Dublin Dr Pepper was the popular name for a style of Dr Pepper soft drink made by the Dublin Dr Pepper Bottling Company in Dublin, Texas.",
      "Dublin Dr Pepper followed the original recipe, using cane sugar as the sweetener as opposed to newer high fructose corn syrup (HFCS)."
    ],
    "actualResponse": "same hands down. Dr Pepper is a carbonated soft drink",
    "index": 28,
    "contextLen": 1
  },
  {
    "conversation": [
      "I enjoy scuba diving"
    ],
    "suggestions": [
      "Scuba diving is a form of underwater diving where the diver uses a self-contained underwater breathing apparatus (scuba) which is completely independent of surface supply, to breathe underwater.",
      "Scuba divers carry their own source of breathing gas, usually compressed air, allowing them greater independence and freedom of movement than surface-supplied divers, and longer underwater endurance than breath-hold divers.",
      "A scuba set is any breathing apparatus that is carried entirely by an underwater diver and provides the diver with breathing gas at the ambient pressure.",
      "(Scuba is an anacronym for self-contained underwater breathing apparatus.)",
      "The history of underwater diving starts with freediving as a widespread means of hunting and gathering, both for food and other valuable resources such as pearls and coral, By classical Greek and Roman times commercial applications such as sponge diving and marine salvage were established, Military diving also has a long history, going back at least as far as the Peloponnesian War, with recreational and sporting applications being a recent development.",
      "Technological development in ambient pressure diving started with stone weights (skandalopetra) for fast descent."
    ],
    "actualResponse": "Yeah,guess it a type of under water diving by the aid of a breathing apparatus",
    "index": 29,
    "contextLen": 1
  },
  {
    "conversation": [
      "Hi, do you enjoy watching Game of Thrones? Its my favorite show of all time."
    ],
    "suggestions": [
      "\"Game of Thrones\" is an American fantasy drama television series created for HBO by David Benioff and D. B. Weiss.",
      "It is an adaptation of \"A Song of Ice and Fire\", George R. R. Martin's series of fantasy novels.",
      "Game of Thrones is an American fantasy drama television series created by David Benioff and D. B. Weiss.",
      "It is an adaptation of \"A Song of Ice and Fire\", George R. R. Martin's series of fantasy novels, the first of which is \"A Game of Thrones\".",
      "George R. R. Martin's \"A Song of Ice and Fire\" novels feature a sizable cast of characters.",
      "The series follows three interwoven plotlines: a dynastic war for control of Westeros by several families; the rising threat of the superhuman Others beyond Westeros's northern border; and the ambition of Daenerys Targaryen, the exiled heir of the previous ruling dynasty."
    ],
    "actualResponse": "Game of thrones is great I love it",
    "index": 30,
    "contextLen": 1
  },
  {
    "conversation": [
      "I have really bad allergies. "
    ],
    "suggestions": [
      "Allergies, also known as allergic diseases, are a number of conditions caused by hypersensitivity of the immune system to something in the environment that usually causes little or no problem in most people.",
      "These diseases include hay fever, food allergies, atopic dermatitis, allergic asthma, and anaphylaxis.",
      "The immune system is a host defense system comprising many biological structures and processes within an organism that protects against disease.",
      "To function properly, an immune system must detect a wide variety of agents, known as pathogens, from viruses to parasitic worms, and distinguish them from the organism's own healthy tissue.",
      "A food allergy is an abnormal immune response to food.",
      "The signs and symptoms may range from mild to severe."
    ],
    "actualResponse": "Oh, I'm sorry to hear that your immune system is hypersensitive to things that usually cause no problem for others. May I ask what you are allergic to?",
    "index": 31,
    "contextLen": 1
  },
  {
    "conversation": [
      "i really like doing yoga every morning beafore i eat my breakfast"
    ],
    "suggestions": [
      "In Sanskrit texts, Rāja yoga () refers to the goal of yoga (which is usually samadhi) and not a method of attaining it.",
      "The term also became a modern retronym, when in the 19th-century Swami Vivekananda equated raja yoga with the Yoga Sutras of Patanjali.",
      "Hatha yoga is a branch of yoga that emphasizes physical exercises to master the body along with mind as well as exercises to withdraw it from external objects.",
      "The word \"haṭha\" means \"force\" in Sanskrit, and may have this association because the early Indians believed that its practice was challenging and \"forced its results to happen\" on the yogi.",
      "Yoga (; Sanskrit, योगः Listen) is a group of physical, mental, and spiritual practices or disciplines which originated in ancient India.",
      "There is a broad variety of yoga schools, practices, and goals in Hinduism, Buddhism, and Jainism."
    ],
    "actualResponse": "Me too my favorite types of yoga are Hatha yoga and Rāja yoga. They can really help you stretch. ",
    "index": 32,
    "contextLen": 1
  },
  {
    "conversation": [
      "I smoke quite often from a pipe. Do you?"
    ],
    "suggestions": [
      "Smoking is a practice in which a substance is burned and the resulting smoke breathed in to be tasted and absorbed into the bloodstream.",
      "Most commonly the substance is the dried leaves of the tobacco plant which have been rolled into a small square of rice paper to create a small, round cylinder called a \"cigarette\".",
      "A tobacco pipe, often called simply a pipe, is a device specifically made to smoke tobacco.",
      "It comprises a chamber (the bowl) for the tobacco from which a thin hollow stem (shank) emerges, ending in a mouthpiece (the bit).",
      "Tobacco smoking is the practice of smoking tobacco and inhaling tobacco smoke (consisting of particle and gaseous phases).",
      "(A more broad definition may include simply taking tobacco smoke into the mouth, and then releasing it, as is done by some with tobacco pipes and cigars.)"
    ],
    "actualResponse": "I used to, its the use of a pipe for smoking a substance by burning it",
    "index": 33,
    "contextLen": 1
  },
  {
    "conversation": [
      "i recently discovered a new love for indian food"
    ],
    "suggestions": [
      "Indian cuisine comprises a wide variety of regional and traditional cuisines native to the Indian subcontinent.",
      "Given the range of diversity in soil type, climate, culture, ethnic groups, and occupations, these cuisines vary substantially from each other and use locally available spices, herbs, vegetables, and fruits.",
      "Curry (, plural curries) is an umbrella term referring to a number of dishes originating in the cuisine of the Indian subcontinent.",
      "The common feature is the use of complex combinations of spices or herbs, usually including fresh or dried hot chillies.",
      "English cuisine encompasses the cooking styles, traditions and recipes associated with England.",
      "It has distinctive attributes of its own, but also shares much with wider British cuisine, partly through the importation of ingredients and ideas from North America, China, and India during the time of the British Empire and as a result of post-war immigration."
    ],
    "actualResponse": "I don't think I've ever had Indian food. Can you recommend a good dish?",
    "index": 34,
    "contextLen": 1
  },
  {
    "conversation": [
      "I love watching basketball, what about you?"
    ],
    "suggestions": [
      "James Naismith (November 6, 1861 – November 28, 1939) was a Canadian-American physical educator, physician, chaplain, sports coach and innovator.",
      "He invented the game of basketball at age 30 in 1891.",
      "Basketball is a limited-contact sport played on a rectangular court.",
      "While most often played as a team sport with five players on each side, three-on-three, two-on-two, and one-on-one competitions are also common.",
      "The Kansas Jayhawks men's basketball program is the intercollegiate men's basketball program of the University of Kansas.",
      "The program is classified in the NCAA's Division I and the team competes in the Big 12 Conference."
    ],
    "actualResponse": "Yes me too.  It was actually invented back in 1891 would you believe by a Dr James Naismith.",
    "index": 35,
    "contextLen": 1
  },
  {
    "conversation": [
      "Do you know a lot about hockey?"
    ],
    "suggestions": [
      "Ice hockey is a contact team sport played on ice, usually in a rink, in which two teams of skaters use their sticks to shoot a vulcanized rubber puck into their opponent's net to score points.",
      "The sport is known to be fast-paced and physical, with teams usually consisting of six players each: one goaltender, and five players who skate up and down the ice trying to take the puck and score a goal against the opposing team.",
      "Roller in-line hockey is a team sport played on a wood, asphalt, cement or sport tile surface, in which players use a hockey stick to shoot a hard plastic hockey puck into their opponent's goal to score points.",
      "It is considered a contact sport but body checking is prohibited.",
      "The Miracle on Manchester is the nickname given to a National Hockey League (NHL) playoff game between the Los Angeles Kings and Edmonton Oilers that took place on April 10, 1982 in the league's 65th season.",
      "The game, the third in a best-of-five postseason series, was played at The Forum, the Kings' home arena at the time, which was situated on Manchester Boulevard (hence the nickname) in the Los Angeles suburb of Inglewood."
    ],
    "actualResponse": "I really don't.  I know the basics.  The winner is the team that scores more goals by shooting the puck into the other team's net.",
    "index": 36,
    "contextLen": 1
  },
  {
    "conversation": [
      "Hi! I am a soccer player, do you like soccer?"
    ],
    "suggestions": [
      "Soccer in the United States is governed by the United States Soccer Federation.",
      "The organization governs most levels of soccer in the country, including the national teams, professional leagues, and the amateur game with the exception of colleges and high schools.",
      "Hendrik Johannes \"Johan\" Cruijff (, anglicised to Cruyff; 25 April 1947 – 24 March 2016) was a Dutch professional football player and coach.",
      "As a player, he won the Ballon d'Or three times, in 1971, 1973, and 1974.",
      "Mary Abigail Wambach (born June 2, 1980) is an American retired soccer player, coach, two-time Olympic gold medalist and FIFA Women's World Cup champion.",
      "A six-time winner of the U.S. Soccer Athlete of the Year award, Wambach was a regular on the U.S. women's national soccer team from 2003 to 2015, earning her first cap in 2001."
    ],
    "actualResponse": "Interesting, I am not a soccer player, but I cannot help but be a fan along with 250 million soccer players around the world with the World Cup going on. ",
    "index": 37,
    "contextLen": 1
  },
  {
    "conversation": [
      "Who is your favorite Flinstones character?"
    ],
    "suggestions": [
      "The Flintstones is an American animated sitcom produced by Hanna-Barbera for ABC.",
      "The series takes place in a romanticized Stone Age setting, depicts the lives of the titular characters and their next-door neighbors and best friends.",
      "Dino () is a fictional character featured in the Hanna-Barbera animated television series \"The Flintstones\", and its TV spinoffs and feature films.",
      "He is a pet dinosaur of the series' main characters, Fred and Wilma Flintstone.",
      "The Simpsons is an American animated sitcom created by Matt Groening for the Fox Broadcasting Company.",
      "The series is a satirical depiction of working-class life, epitomized by the Simpson family, which consists of Homer, Marge, Bart, Lisa, and Maggie."
    ],
    "actualResponse": "I think it is DIno! The Flintstones is an American animated sitcom ",
    "index": 38,
    "contextLen": 1
  },
  {
    "conversation": [
      "I only ever shop at Walmart.  I don't think a human ever needs to go anywhere else for anything.  Don't you agree?"
    ],
    "suggestions": [
      "Walmart has been criticized by groups and individuals, including labor unions and small-town advocates protesting against Walmart policies and business practices and their effects.",
      "Criticisms include charges of racial and gender discrimination, foreign product sourcing, treatment of product suppliers, environmental practices, the use of public subsidies, and the company's security policies.",
      "Wal-Mart Stores, Inc., doing business as Walmart, is an American multinational retail corporation that operates a chain of hypermarkets, discount department stores, and grocery stores.",
      "Headquartered in Bentonville, Arkansas, the company was founded by Sam Walton in 1962 and incorporated on October 31, 1969.",
      "United States labor law sets the rights and duties for employees, labor unions, and employers in the United States.",
      "Labor law's basic aim is to remedy the \"inequality of bargaining power\" between employees and employers, especially employers \"organized in the corporate or other forms of ownership association\"."
    ],
    "actualResponse": "Walmart has been criticized by labor unions",
    "index": 39,
    "contextLen": 1
  },
  {
    "conversation": [
      "My favorite city is New York."
    ],
    "suggestions": [
      "The City of New York, often called New York City or simply New York, is the most populous city in the United States.",
      "With an estimated 2016 population of 8,537,673 distributed over a land area of about , New York City is also the most densely populated major city in the United States.",
      "The New York metropolitan area, also referred to as the Tri-State Area, includes New York City as the most populous city in the United States, Long Island, and the Mid and Lower Hudson Valley in the state of New York; the five largest cities in New Jersey: Newark, Jersey City, Paterson, Elizabeth, and Edison, and their vicinities; six of the seven largest cities in Connecticut: Bridgeport, New Haven, Stamford, Waterbury, Norwalk, and Danbury, and their vicinities; and five counties in northeastern Pennsylvania.",
      "As per the 2015 United States Census Bureau estimates, the New York metropolitan area remains, by a significant margin, the most populous in the United States, as defined by both the Metropolitan Statistical Area (20.2 million residents) and the Combined Statistical Area (23.7 million residents); it is also one of the most populous urban agglomerations in the world, and the single largest in North America.",
      "Manhattan () is the most densely populated borough of New York City, its economic and administrative center, and its historical birthplace.",
      "Locally it is often referred to simply as \"The City\"."
    ],
    "actualResponse": "New York City is the best! I love the fast pace! I wish I could go visit for a \"New York minute\" or two!",
    "index": 40,
    "contextLen": 1
  },
  {
    "conversation": [
      "Thinking about certain things to mature in in college. I live in the midwest and agriculture is a possible major. Still not sure if it's right for me, though."
    ],
    "suggestions": [
      "Agriculture is the cultivation and breeding of animals, plants and fungi for food, fiber, biofuel, medicinal plants and other products used to sustain and enhance life.",
      "Agriculture was the key development in the rise of sedentary human civilization, whereby farming of domesticated species created food surpluses that nurtured the development of civilization.",
      "Genetically modified food controversies are disputes over the use of foods and other goods derived from genetically modified crops instead of conventional crops, and other uses of genetic engineering in food production.",
      "The disputes involve consumers, farmers, biotechnology companies, governmental regulators, non-governmental organizations, and scientists.",
      "The history of agriculture records the domestication of plants and animals and the development and dissemination of techniques for raising them productively.",
      "Agriculture began independently in different parts of the globe, and included a diverse range of taxa."
    ],
    "actualResponse": "Agriculture is the cultivation and breeding of plants and animals for food and other uses. Important field.",
    "index": 41,
    "contextLen": 1
  },
  {
    "conversation": [
      "My grandma is from Denmark. I would love to know more about the country."
    ],
    "suggestions": [
      "Denmark (; , ), officially the Kingdom of Denmark, is a Nordic country and a sovereign state.",
      "The southernmost of the Scandinavian nations, it is south-west of Sweden and south of Norway, and bordered to the south by Germany.",
      "The Nordic Passport Union allows citizens of the Nordic countriesIceland, Denmark, Norway, Sweden, and Finlandto travel and reside in another Nordic country (excluding Greenland and Svalbard) without any travel documentation (e.g.",
      "a passport or national identity card) or a residence permit.",
      "The Nordic countries or the Nordic are a geographical and cultural region in Northern Europe and the North Atlantic, where they are most commonly known as \"Norden\" (literally \"the North\").",
      "They consist of Denmark, Finland, Iceland, Norway and Sweden, including Greenland and Faroe Islands—which are both constituent countries within the Kingdom of Denmark—and the Åland Islands."
    ],
    "actualResponse": "Denmark, officially the Kingdom of Denmark, is a Nordic country and a sovereign state.",
    "index": 42,
    "contextLen": 1
  },
  {
    "conversation": [
      "I love to go swimming because its fun and its a good workout."
    ],
    "suggestions": [
      "Swimming is the self-propulsion of a person through fresh or salt water, usually for recreation, sport, exercise, or survival.",
      "Locomotion is achieved through coordinated movement of the limbs, the body, or both.",
      "Swimming lessons is the process of learning to swim.",
      "In most countries there is a definition of a number of swimming levels that is reached in the process of the curriculum.",
      "SwimAbility Canada (previously known as Making Waves Canada from 2009-2016) is a Canadian not-for-profit organization that improves the lives of children with disabilities through private, low-cost and adapted swimming/water safety instruction.",
      "It is the largest student-run not-for-profit organization in Canada."
    ],
    "actualResponse": "Me too. It's consistently among top sporting recreation and in some countries swimming lessons are mandatory as part of a child's education.",
    "index": 43,
    "contextLen": 1
  },
  {
    "conversation": [
      "I love Italian food - it's my favorite cuisine to cook and to eat. How about you?"
    ],
    "suggestions": [
      "Pasta () is a staple food of traditional Italian cuisine, with the first reference dating to 1154 in Sicily.",
      "Also commonly used to refer to the variety of pasta dishes, pasta is typically a noodle made from an unleavened dough of a durum wheat flour mixed with water or eggs and formed into sheets or various shapes, then cooked by boiling or baking.",
      "Italian cuisine is food typical from Italy.",
      "It has developed through centuries of social and economic changes, with roots stretching to antiquity.",
      "Neapolitan cuisine has ancient historical roots that date back to the Greco-Roman period, which was enriched over the centuries by the influence of the different cultures that controlled Naples and its kingdoms, such as that of Aragon and France.",
      "Since Naples was the capital of the Kingdom of Naples, its cuisine took much from the culinary traditions of all the Campania region, reaching a balance between dishes based on rural ingredients (pasta, vegetables, cheese) and seafood dishes (fish, crustaceans, mollusks)."
    ],
    "actualResponse": "I love it too! I enjoy making pasta and homemade dough to make pizza.",
    "index": 44,
    "contextLen": 1
  },
  {
    "conversation": [
      "I would love to learn how to play the guitar."
    ],
    "suggestions": [
      "The guitar is a fretted musical instrument that usually has six strings.",
      "The sound is projected either acoustically, using a hollow wooden or plastic and wood box (for an acoustic guitar), or through electrical amplifier and a speaker (for an electric guitar).",
      "The bass guitar (also known as electric bass, or bass) is a stringed instrument played primarily with the fingers or thumb, by plucking, slapping, popping, strumming, tapping, thumping, or picking with a plectrum, often known as a pick.",
      "The bass guitar is similar in appearance and construction to an electric guitar, but with a longer neck and scale length, and four to six strings or courses.",
      "The double bass, or simply the bass (and numerous other names), is the largest and lowest-pitched bowed string instrument in the modern symphony orchestra.",
      "It is a transposing instrument and is typically notated one octave higher than tuned to avoid excessive ledger lines below the staff."
    ],
    "actualResponse": "Oh yeah? You mean the fretted musical instrument that has six strings?",
    "index": 45,
    "contextLen": 1
  },
  {
    "conversation": [
      "Arsenal F.C. is my favorite football club, are you watching the World Cup?"
    ],
    "suggestions": [
      "Association football a sport in England, where the first modern set of rules for the code were established in 1863, which were a major influence on the development of the modern Laws of the Game.",
      "With over 40,000 association football clubs, England has more clubs involved in the code than any other country as well as the world's first club (Sheffield F.C.",
      "Arsenal Football Club is a professional football club based in Highbury, London, England, that plays in the Premier League, the top flight of English football.",
      "The club has won 13 League titles, a record 13 FA Cups, two League Cups, the League Centenary Trophy, 15 FA Community Shields, one UEFA Cup Winners' Cup and one Inter-Cities Fairs Cup.",
      "The History of English football is a long and detailed one.",
      "England was the first country where the game was developed and codified."
    ],
    "actualResponse": "Yes definitely! Arsenal are awesome because they're the first club from South of England to join the Football League.",
    "index": 46,
    "contextLen": 1
  },
  {
    "conversation": [
      "I just got my first iPhone. Do you know anything about the iPhone history?"
    ],
    "suggestions": [
      "iPhone ( ) is a line of smartphones designed and marketed by Apple Inc.",
      "They run Apple's iOS mobile operating system.",
      "The history of iPhone began with a request from Apple Inc. CEO Steve Jobs to the company's engineers, asking them to investigate the use of touchscreen devices and tablet computers (which later came to fruition with the iPad).",
      "Many have noted the device's similarities to Apple's previous touch-screen portable device, the Newton MessagePad.",
      "The iPhone 5 is a smartphone designed and marketed by Apple Inc.",
      "It is the sixth generation of the iPhone, succeeding the iPhone 4S and preceding the iPhone 5S and iPhone 5C."
    ],
    "actualResponse": "I do!  It was June 29, 2007 when the first iPhone was released!",
    "index": 47,
    "contextLen": 1
  },
  {
    "conversation": [
      "I am a cat lover, how can't someone love something so cute."
    ],
    "suggestions": [
      "The domestic cat (\"Felis silvestris catus\" or \"Felis catus\") is a small, typically furry, carnivorous mammal.",
      "They are often called house cats when kept as indoor pets or simply cats when there is no need to distinguish them from other felids and felines.",
      "The Chausie () is a domestic breed of cat that was developed by breeding a few individuals from the nondomestic species jungle cat (\"Felis chaus\") to a far greater number of domestic cats (\"Felis catus\").",
      "The Chausie was first recognized as a domestic breed by The International Cat Association (TICA).",
      "Many different species of mammal can be classified as cats (felids) in the United States.",
      "These include domestic cat (both house cats and feral), of the species \"Felis catus\"; medium-sized wild cats from the genus \"Lynx\"; and big cats from the genera \"Puma\" and \"Panthera\"."
    ],
    "actualResponse": "I love cats! Their official name is Felis catus and they are generally carnivorous.",
    "index": 48,
    "contextLen": 1
  },
  {
    "conversation": [
      "I'd love to vacation in Florida some day, do you know much about Florida?"
    ],
    "suggestions": [
      "Tallahassee is the capital of the U.S. state of Florida.",
      "It is the county seat and only incorporated municipality in Leon County.",
      "The History of Tallahassee, like the History of Leon County, begins with the Native American population and its interaction with British and Spanish colonists as well as colonial Americans and fugitive slaves, as the Florida Territory moved toward statehood.",
      "Growing numbers of cotton plantations increased the settlement's population greatly.",
      "Springtime Tallahassee is an annual event held on the first Saturday in April in Tallahassee, Florida, United States celebrating Tallahassee's history and culture.",
      "Springtime Tallahassee began in 1967 as a concept to keep Tallahassee as the state capital."
    ],
    "actualResponse": "I know a bit - I've been there a few times.  The capital is Tallahassee.",
    "index": 49,
    "contextLen": 1
  }
]