[
  {
    "convesation": [
      "I like Dylans bars do you?",
      "Yes Dylans Candy Bar is my favorite boutique candy store",
      "They have everything! i just love it",
      "Yes Ralph Laurens daughter Dylan  Lauren owns them",
      "How long have they been around?"
    ],
    "suggestions": [
      "Dylan's Candy Bar is a chain of boutique candy shops and candy supplier currently located in New York City; East Hampton, New York; Los Angeles, Chicago and Miami Beach, as well as in wholesale venues around the globe.",
      "It is owned by Dylan Lauren, daughter of fashion designer Ralph Lauren.",
      "Ralph Lauren (; born Ralph Lifshitz; October 14, 1939) is an American fashion designer, philanthropist, and business executive, best known for the Ralph Lauren Corporation, a global multibillion-dollar enterprise.",
      "He has also become well known for his collection of rare automobiles, some of which have been displayed in museum exhibits.",
      "Dylan Lauren (born May 9, 1974) is an American entrepreneur.",
      "She is the daughter of American fashion designer Ralph Lauren, and the owner of New York City's Dylan's Candy Bar, which claims to be the \"largest candy store in the world\"."
    ],
    "actualResponse": "Since 2011 and Dylan Lauren was on the cover of Forbes magazine"
  },
  {
    "convesation": [
      "I love American football dont you?",
      "I do too! It's a great team sport played on a rectangular field between two goalposts.",
      "I think my favorite team is the cowboys",
      "Don't hold this against me, but I like the Patriots. They seem to always be the team with the most points at the end of the game.",
      "They are still a good team even though they had that controversy"
    ],
    "suggestions": [
      "The Super Bowl is the annual championship game of the National Football League (NFL).",
      "The game is the culmination to a regular season that begins in the late summer of the previous calendar year.",
      "Super Bowl XLVI was an American football game between the National Football Conference (NFC) champion New York Giants and the American Football Conference (AFC) champion New England Patriots to decide the National Football League (NFL) champion for the 2011 season.",
      "The Giants defeated the Patriots by the score of 21–17.",
      "John Albert Elway Jr. (born June 28, 1960) is a former American football quarterback and current executive vice president of football operations and general manager of the Denver Broncos of the National Football League (NFL).",
      "Elway played college football at Stanford and his entire 16-year professional career with the Denver Broncos."
    ],
    "actualResponse": "Yes, they have. Tom Brady is my favorite player. He is one of only two players to have won 5 Super Bowls."
  },
  {
    "convesation": [
      "I just recently started listening to Guns N' Roses.",
      "Oh they are classic!! They are an American band from LA that formed in 1985.",
      "All the great bands come from LA. Is the band still together today?",
      "Axl Rose, Slash, Izzy, Duff and Steven Adler still perform today!",
      "Which one of them is the lead vocalist?"
    ],
    "suggestions": [
      "Guns N' Roses, often abbreviated as GNR, is an American hard rock band from Los Angeles, California, formed in 1985.",
      "The lineup, when first signed to Geffen Records in 1986, consisted of vocalist Axl Rose, lead guitarist Slash, rhythm guitarist Izzy Stradlin, bassist Duff McKagan, and drummer Steven Adler.",
      "This article includes an overview of the major events and trends in popular music in the 2000s.",
      "The 2000s saw the creation or emergence of a few styles, such as indie-related genres such as Emo, Alternative R&B, and a multitude of new electronic subgenres, most notably Dubstep, Bass music and Moombahton, as well as genres that fused influences from past decades, mostly the 80s, into creating new styles such as Nu-disco and Hypnagogic pop.",
      "Michael Joseph Jackson (August 29, 1958 – June 25, 2009) was an American singer, songwriter, and dancer.",
      "Dubbed the \"King of Pop\", he was one of the most popular entertainers in the world, and was the best-selling music artist during the year of his death."
    ],
    "actualResponse": "Well Axl of course! lol His band released 6 albums selling more than 100 million records worldwide making them the 41st best selling artists of all time!"
  },
  {
    "convesation": [
      "I just ordered all the Harry Potter books and look forward to reading them",
      "I have never read any books by the British author J.K. Rowling, it does sound like an interesting series though",
      "Harry Potter is a series of fantasy novels written by British author J. K. Rowling",
      "It must be very popular to have sold more than 500 million copies around the world. It has been translated to 73 languages!",
      "The novels chronicle the life of a young wizard, Harry Potter, and his friends"
    ],
    "suggestions": [
      "The following is a list of magical objects used in the \"Harry Potter\" series.",
      "In \"Harry Potter and the Order of the Phoenix\", Hermione Granger creates fake, enchanted Galleons that are used for communication between members of Dumbledore's Army.",
      "Harry Potter is a series of fantasy novels written by British author J. K. Rowling.",
      "The novels chronicle the life of a young wizard, Harry Potter, and his friends Hermione Granger and Ron Weasley, all of whom are students at Hogwarts School of Witchcraft and Wizardry.",
      "The fictional universe of British author J. K. Rowling's \"Harry Potter\" series of fantasy novels comprises two distinct societies: the Wizarding World and the Muggle world.",
      "In the novels, the Muggle world is the world inhabited by the non-magical majority, with which the Wizarding world exists coextensively, albeit mostly remaining hidden from the non-magical humans."
    ],
    "actualResponse": "I see, his friends Hermoine Granger and Ron Weasley and they must go that Hogwarts School"
  },
  {
    "convesation": [
      "Elvis Presley is one of my favorite artists of all time",
      "I loved Elvis!  It was so sad when he died! He really WAS the \"King of Rock and Roll\"!",
      "He really was i was really sad as well, could you tell me when was he born?",
      "He was born on January 8, 1935 in Tupelo Mississippi!  I was born on January 8 as well!  We shared the same birthday!",
      "The odds of that happening are incredibly low it is awesome you where born the same day, what else can you tell me about him"
    ],
    "suggestions": [
      "\"Heartbreak Hotel\" is a song recorded by American singer Elvis Presley.",
      "It was released as a single on January 27, 1956, Presley's first on his new record label RCA Victor.",
      "Elvis Aaron Presley (January 8, 1935 – August 16, 1977) was an American singer, musician, and actor.",
      "Regarded as one of the most significant cultural icons of the 20th century, he is often referred to as the \"King of Rock and Roll\" or simply \"the King\".",
      "Rockabilly is one of the earliest styles of rock and roll music, dating back to the early 1950s in the United States, especially the South.",
      "As a genre it blends the sound of Western musical styles such as country with that of rhythm and blues, leading to what is considered \"classic\" rock and roll."
    ],
    "actualResponse": "It was in January 1956 when Elvis released his first single!  It was called Heartbreak Hotel, and it was awesome!  It became the number one hit in the U.S.!"
  },
  {
    "convesation": [
      "im a big nickelback fan. whats your opinion on the band?",
      "I actually love Nickelback! They sold over 50 million albums in early 2000s I think!",
      "it wouldnt surprise me. when they started getting radio play, the band blew up big.",
      "They became quite popular! They've had a few drummer changes in the early 2000s, but I still love them and their sound, now.",
      "what was their drummer placed? i had never heard that."
    ],
    "suggestions": [
      "Nickelback is a Canadian rock band formed in 1995 in Hanna, Alberta, Canada.",
      "The band is composed of guitarist and lead vocalist Chad Kroeger, guitarist, keyboardist and backing vocalist Ryan Peake, bassist Mike Kroeger, and drummer Daniel Adair.",
      "All the Right Reasons is the fifth studio album by Canadian rock band Nickelback, released on October 4, 2005.",
      "It is the band's first album with former 3 Doors Down drummer Daniel Adair, who replaced Ryan Vikedal in January 2005.",
      "Nickelback is a Canadian hard rock band from Hanna, Alberta.",
      "The band was founded in 1995 by vocalist and guitarist Chad Kroeger, guitarist and vocalist Ryan Peake, bassist Mike Kroeger and drummer Brandon Kroeger."
    ],
    "actualResponse": "They went through drummer changes from 1995 to 2005. I think the drummer now is Adair, and he replaced Ryan Vikedal."
  },
  {
    "convesation": [
      "Everyone has seen Harry Potter except me. Have you ever read the books or watched the movies?",
      "Yes I am a big fan of it actually. I love reading about chronicles of the life of a young wizard",
      "Was he born a wizard?",
      " As far as the main story arc concerns, he was and he went to wizard school to improve himself.",
      "Who wrote these stories?"
    ],
    "suggestions": [
      "Harry Potter is a series of fantasy novels written by British author J. K. Rowling.",
      "The novels chronicle the life of a young wizard, Harry Potter, and his friends Hermione Granger and Ron Weasley, all of whom are students at Hogwarts School of Witchcraft and Wizardry.",
      "Writer J. K. Rowling cites several writers as influences in her creation of her bestselling \"Harry Potter\" series.",
      "Writers, journalists and critics have noted that the books also have a number of analogues; a wide range of literature, both classical and modern, which Rowling has not openly cited as influences.",
      "Harry Potter is a British-American film series based on the \"Harry Potter\" novels by author J. K. Rowling.",
      "The series is distributed by Warner Bros. and consists of eight fantasy films, beginning with \"Harry Potter and the Philosopher's Stone\" (2001) and culminating with \"Harry Potter and the Deathly Hallows – Part 2\" (2011)."
    ],
    "actualResponse": "These novels were written by British author J. K. Rowling."
  },
  {
    "convesation": [
      "Have you ever used Instagram? I've looked at it but have never done anything with it.",
      "Yes its great its a internet based photo sharing app lots of fun",
      "Hmm, must check it out. Any idea who developed it?",
      "Kevin sytsrom and Mike Krieger in 2010",
      "So it's not that old then. Do you have to open an account with it, or can you just post?"
    ],
    "suggestions": [
      "Instagram is a mobile, desktop, and Internet-based photo-sharing application and service that allows users to share pictures and videos either publicly, or privately to pre-approved followers.",
      "It was created by Kevin Systrom and Mike Krieger, and launched in October 2010 as a free mobile app exclusively for the iOS operating system.",
      "Flickr (pronounced \"flicker\") is an image- and video-hosting website and web services suite that was created by Ludicorp in 2004 and acquired by Yahoo on 20 March 2005.",
      "In addition to being a popular website for users to share and embed personal photographs, and effectively an online community, the service is widely used by photo researchers and by bloggers to host images that they embed in blogs and social media.",
      "Facebook is a social network service website launched on February 4, 2004.",
      "This is a list of software and technology features that can be found on the Facebook website and are available to users of the social media site."
    ],
    "actualResponse": "You have to register as a user to upload photos"
  },
  {
    "convesation": [
      "I help design video games for a living. More on the concept side, less on the actual building! Do you play?",
      "Off and on, it seems as if gaming has become a part of popular culture.  What types of games do you design?",
      "Educational, primarily for grade school age children. And yes, they are officially *enmeshed* in our culture for better or worse. I try to work for the better!",
      "What platforms do you design games for -- PCs, video game consoles, etc.?",
      "Primarily for iPads and tablets, since so many schools now distribute them to kids. I feel fortunate our boys are in a school district that distributes iPads for school use."
    ],
    "suggestions": [
      "iOS is a mobile operating system, developed by Apple Inc. for iPhone, iPad, and iPod Touch.",
      "Updates for iOS are released through the iTunes software, and, since iOS 5, via over-the-air software updates.",
      "iOS (formerly iPhone OS) is a mobile operating system created and developed by Apple Inc. exclusively for its hardware.",
      "It is the operating system that presently powers many of the company's mobile devices, including the iPhone, iPad, and iPod Touch.",
      "The iPad 2 is a tablet designed, developed and marketed by Apple Inc.",
      "Compared to the first iPad, as the second model in the iPad line it gained a faster dual core A5 processor, a lighter build structure, and was the first iPad to feature VGA front-facing and 720p rear-facing cameras designed for FaceTime video calling."
    ],
    "actualResponse": "Seems like there has been much growth for iOS devices like the iPad."
  },
  {
    "convesation": [
      "I want to learn how to design video games, trying to read and learn about it",
      "It would be so interesting to help build a game for entertainment or educational purposes",
      "Yes I agree. I wonder if education is required or just experience ?",
      "I bet both could work out, if you are really good you probably don't need education",
      "It would seem to me that computer and design skills and maybe graphic arts sikills would help"
    ],
    "suggestions": [
      "Game Design is the art of applying design and aesthetics to create a game for entertainment or for educational, exercise, or experimental purposes.",
      "Increasingly, elements and principles of game design are also applied to other interactions, particularly virtual ones (see gamification).",
      "A game is a structured form of play, usually undertaken for enjoyment and sometimes used as an educational tool.",
      "Games are distinct from work, which is usually carried out for remuneration, and from art, which is more often an expression of aesthetic or ideological elements.",
      "Hearthstone, originally known as Hearthstone: Heroes of Warcraft, is a free-to-play online collectible card video game developed and published by Blizzard Entertainment.",
      "Having been released worldwide on March 11, 2014, \"Hearthstone\" builds upon the already existing lore of the \"Warcraft\" series by using the same elements, characters, and relics."
    ],
    "actualResponse": "I bet it would help a great deal, but game design can also just be creating goals, rules and challenges to define a board game, card game, etc"
  },
  {
    "convesation": [
      "Hi, do you have any advice on how to stay motived?",
      "For me Motivation is a word that is part of the popular culture as few other psychological concepts are, so you have to find your own ways to motivate yourself",
      "Hmm, okay I see what you mean. What do you do to stay motivated when you have to do a rather mundane task? ",
      "Motivation as a desire to perform an action that you rather not, so you need to find the reason why, and hopefully change your mind :D",
      "Ahh I see, so if I find a suitable reason why I should do a task I will find motivation easier. That sounds good to me. :)"
    ],
    "suggestions": [
      "Dopamine (DA, a contraction of 3,4-dihydroxyphenethylamine) is an organic chemical of the catecholamine and phenethylamine families that plays several important roles in the brain and body.",
      "It is an amine synthesized by removing a carboxyl group from a molecule of its precursor chemical L-DOPA, which is synthesized in the brain and kidneys.",
      "Motivation is the reason for people's actions, desires, and needs.",
      "Motivation is also one's direction to behavior, or what causes a person to want to repeat a behavior.",
      "The reward system is a group of neural structures responsible for incentive salience (i.e., motivation and \"wanting\", desire, or craving for a reward), associative learning (primarily positive reinforcement and classical conditioning), and positive emotions, particularly ones which involve pleasure as a core component (e.g., joy, euphoria and ecstasy).",
      "Reward is the attractive and motivational property of a stimulus that induces appetitive behavior – also known as approach behavior – and consummatory behavior."
    ],
    "actualResponse": "The \"wanting behavior\" associated with a rewarding stimulus can be increased by microinjections of dopamine, so you need to be happy to be motivated also :D"
  },
  {
    "convesation": [
      "Do you use social media?",
      "I use Facebook and Instagram to share pictures and videos to my followers! Do you use Instagram? ",
      "I use Instagram but mostly to follow people that I like. I rarely share anything though",
      "I'm the same way. I do like the filters that I can add to my photos in Instagram though! It's fun to play around with them.",
      "I've never used that feature on Instagram though I've used the similar feature on snapchat"
    ],
    "suggestions": [
      "Instagram is a mobile, desktop, and Internet-based photo-sharing application and service that allows users to share pictures and videos either publicly, or privately to pre-approved followers.",
      "It was created by Kevin Systrom and Mike Krieger, and launched in October 2010 as a free mobile app exclusively for the iOS operating system.",
      "Social media marketing is the use of social media platforms and websites to promote a product or service.",
      "Although the terms e-marketing and digital marketing are still dominant in academia, social media marketing is becoming more popular for both practitioners and researchers.",
      "Celebrity branding or celebrity endorsement is a form of advertising campaign or marketing strategy used by brands, companies, or a non-profit organization which involves celebrities or a well-known person using their social status or their fame to help promote a product, service or even raise awareness on environmental or social matters.",
      "Marketers use celebrity endorsers in hopes that the positive images of the celebrity endorser of the brand will also be passed on to the products or the brand image associated with the celebrities."
    ],
    "actualResponse": "I never realized that Instagram is owned by Facebook, did you?"
  },
  {
    "convesation": [
      "I want to buy a pass and visit all the national parks in the US.",
      "That could be fun!  The United States has 59 protected areas known as national parks that are operated by the National Park Service",
      "I didnt realize they were so many. Do you know which park is the most visited?",
      "Well they had A bill creating the first national park, Yellowstone, was signed into law by President Ulysses S. Grant in 1872. So that is probably the most loved",
      "Have you visited any of the parks? Ive only been to the Grand Canyon."
    ],
    "suggestions": [
      "The National Park Service (NPS) is an agency of the United States federal government that manages all national parks, many national monuments, and other conservation and historical properties with various title designations.",
      "It was created on August 25, 1916, by Congress through the National Park Service Organic Act and is an agency of the United States Department of the Interior.",
      "Since 1872 the United States National Park System has grown from a single, public reservation called Yellowstone National Park to embrace over 450 natural, historical, recreational, and cultural areas throughout the United States, its territories, and island possessions.",
      "These areas include a diverse varieties of areas —National Parks, National Monuments, National Memorials, National Military Parks, National Historic Sites, National Parkways, National Recreation Areas, National Seashores, National Scenic Riverways, National Scenic Trails, and others.",
      "The United States has 59 protected areas known as national parks that are operated by the National Park Service, an agency of the Department of the Interior.",
      "National parks must be established by an act of the United States Congress."
    ],
    "actualResponse": "I have been to big bend in texas. i learned in school The Organic Act of 1916 created the National Park Service \"to conserve the scenery and the natural and historic objects and wildlife therein"
  },
  {
    "convesation": [
      "I love drinking protein powder.",
      "I only take herbal supplements to increase my strength and stamina.",
      "I have never taken herbal supplements. What kind do you take?",
      "Anything that is plant based that I can substitute into my diet.",
      "I do like a plant based diet."
    ],
    "suggestions": [
      "A plant-based diet is a diet based on foods derived from plants, including vegetables, whole grains, nuts, seeds, legumes and fruits, but with few or no animal products.",
      "The use of the phrase has changed over time, and examples can be found of the phrase \"plant-based diet\" being used to refer to vegan diets, which contain no food from animal sources, to vegetarian diets which include eggs and dairy but no meat, and to diets with varying amounts of animal-based foods, such as semi-vegetarian diets which contain small amounts of meat.",
      "Vegetarianism is the practice of abstaining from the consumption of meat (red meat, poultry, seafood, and the flesh of any other animal), and may also include abstention from by-products of animal slaughter.",
      "Vegetarianism may be adopted for various reasons.",
      "In demographics, the world population is the total number of humans currently living.",
      "The world population was estimated to have reached 7.6 billion as of December 2017 ."
    ],
    "actualResponse": "Yes, it is very popular because three are more than 4 billion people who follow a plant based diet."
  },
  {
    "convesation": [
      "I know absolutely nothing about archery, but would be interested in your views on it.",
      "It is really very fun. It can be considered a sport or a skill where a bow is used to propel arrows.",
      "Hmm. Do you go to classes? It sound like such fun - I've seen it in movies but not really thought much about it.",
      "I do not. It used to be mainly for hunting and fighting, but not anymore.",
      "Perhaps I should give it a go, not for hunting but for sport. My husband does bow hunt, if that's a similar sort of thing. He seems to be quite good at it."
    ],
    "suggestions": [
      "Sports in the United States are an important part of the country's culture.",
      "Based on revenue, the four major professional sports leagues in the United States are Major League Baseball (MLB), the National Basketball Association (NBA), the National Football League (NFL), and the National Hockey League (NHL).",
      "Archery is the sport, practice or skill of using a bow to propel arrows.",
      "The word comes from the Latin \"arcus\".",
      "The bow and arrow are known to have been invented by the end of the Upper Paleolithic, and for at least 10,000 years archery was an important military and hunting skill, and features prominently in the mythologies of many cultures.",
      "Archers, whether on foot, in chariots and on horseback were a major part of most militaries until about 1500 when they began to be replaced by firearms, first in Europe, and then progressively elsewhere."
    ],
    "actualResponse": "It is an increasingly popular competitive sport and recreational activity."
  },
  {
    "convesation": [
      "I'm planning a trip to Ireland! I've never been there, so I don't know what to expect!",
      "Ireland is actually an island.  Very cool.  Many people don't know that. ",
      "No, actually I didn't know that either! Are there any cities I should plan on visiting?",
      "Ireland is the third largest island in Europe.  There are tons of cities to visit. What do you like to see?",
      "Hm, well I like big cities! Usually the bigger cities have lots of good restaurants and shopping."
    ],
    "suggestions": [
      "Northern Ireland ( ; Ulster-Scots: \"\") is a part of the United Kingdom in the north-east of the island of Ireland, variously described as a country, province or region.",
      "Northern Ireland shares a border to the south and west with the Republic of Ireland.",
      "Belfast (; ) is the capital and largest city of Northern Ireland, and the second largest on the island of Ireland.",
      "On the River Lagan, it had a population of 333,871 in 2015.",
      "United Ireland is the proposition that the whole of Ireland should be a single sovereign state.",
      "At present, the island is divided politically; the sovereign state of Ireland has jurisdiction over the majority of Ireland, while Northern Ireland is part of the United Kingdom."
    ],
    "actualResponse": "Differently drop into Northern Ireland than.  You'll love it."
  },
  {
    "convesation": [
      "Hey! I enjoy Elvis music, do you like his music?",
      "Yes, I love to listen his music. He was not just a singer, he was an actor too.",
      "Oh, I didn't know that! Do you know any movies he acted in?",
      "Have you heard of Jailhouse Rock 1957? Elvis's career as a singer  began there in 1954.",
      "Yes! I didnt Know he was in that movie."
    ],
    "suggestions": [
      "Jailhouse Rock is a 1957 American musical drama film directed by Richard Thorpe and starring Elvis Presley, Judy Tyler, and Mickey Shaughnessy.",
      "Distributed by Metro-Goldwyn-Mayer (MGM) and dramatized by Guy Trosper from a story written by Nedrick Young, the film is about a young man sentenced to prison for manslaughter who is mentored in music by his prison cellmate who realizes his musical abilities.",
      "Elvis Aaron Presley (January 8, 1935 – August 16, 1977) was an American singer, musician, and actor.",
      "Regarded as one of the most significant cultural icons of the 20th century, he is often referred to as the \"King of Rock and Roll\" or simply \"the King\".",
      "\"Jailhouse Rock\" is a song written by Jerry Leiber and Mike Stoller that first became a hit for Elvis Presley.",
      "RCA Victor released the song on a 45 rpm single on September 24, 1957, the song had a film release of Presley's motion picture under the same name, \"Jailhouse Rock\"."
    ],
    "actualResponse": "Yes, but he also have a song Jailhouse Rock, it was a very big hit for Elvis."
  },
  {
    "convesation": [
      "Hi! I'm looking for a bodybuilding supplement to add to my diet. Some guys at the gym recommended that I try one. Do you know anything about these supplements? ",
      "There are many different Bodybuilding supplements. Before there were supplements the ancient greeks would just consume massive amounts of meats.",
      "Oh, for the protein?! I guess that's what I should look for in the supplement then, lots of protein!",
      "One of the first persons to use Bodybuilding supplement was Eugen Sandow. in the 1910s. He advocated dietary control for muscle growth.",
      "Wow, I had no idea these supplements have been around for over 100 years! What's the best way to take the supplement?"
    ],
    "suggestions": [
      "Dietary supplements can provide nutrients and extracts from food sources individually or in combination in order to increase the quantity of their consumption.",
      "The class of nutrient compounds includes vitamins, minerals, fiber, fatty acids, or amino acids.",
      "The Dietary Supplement Health and Education Act of 1994 (\"DSHEA\"), is a 1994 statute of United States Federal legislation which defines and regulates dietary supplements.",
      "Under the act, supplements are effectively regulated by the FDA for Good Manufacturing Practices under 21 CFR Part 111.",
      "Athletes in ancient Greece were advised to consume large quantities of meat and wine.",
      "A number of herbal concoctions and tonics have been used by strong men and athletes since ancient times across cultures to try to increase their strength and stamina."
    ],
    "actualResponse": "It depends on goals. In 1994, Dietary Supplement Health and Education Act went into effect in the USA to monitor Bodybuilding supplement"
  },
  {
    "convesation": [
      "Hello, I enjoy The Walking Dead. Do you?",
      "Hello! I love the walking dead. Did you also read the comics?",
      "I have not, but my husband has. I have only watched the show.",
      "Oh I see. Who's your favorite character on the show? Mine is the lead, Rick Grimes.",
      "I love Rick too! I think my most favorite though is Daryl."
    ],
    "suggestions": [
      "Michonne ( ) is a fictional character from the comic book series \"The Walking Dead\".",
      "The character also appears in media adaptations of the series, most notably the television series of the same name, in which she is portrayed by Danai Gurira.",
      "The following is a list of characters from \"The Walking Dead\" television series based on the eponymous comic book series.",
      "Although some characters appear in both the television and comic serieses, the continuity of the television series is not shared with the original comic book series.",
      "Glenn Rhee is a fictional character from the comic book series \"The Walking Dead\" and is portrayed by Steven Yeun in the AMC television series of the same name.",
      "He is voiced by Nick Herman in the video game of the same name, by Telltale Games."
    ],
    "actualResponse": "Daryl is indeed awesome. I also like Michone, it creeped me out when I learned that she was carrying her zombified boyfriend around though!"
  },
  {
    "convesation": [
      "I love a good hot dog! I especially love one that is loaded with chili and cheese. Do you enjoy hot dogs?",
      "I do, and I love it with mustard, and sauerkraut!",
      "I am not a big fan of sauerkraut but I'm totally with you on the mustard! I would like to thank the individual who came up with idea! lol",
      "And the variation! Different meats, condiments, and so many ways of preparing it!",
      "Yes! I love mine off the grill! That's my favorite!"
    ],
    "suggestions": [
      "A hamburger, beefburger or burger is a sandwich consisting of one or more cooked patties of ground meat, usually beef, placed inside a sliced bread roll or bun.",
      "The patty may be pan fried, barbecued, or flame broiled.",
      "Barbecue varies by the type of meat, sauce, rub, or other flavorings used, the point in barbecuing at which they are added, the role smoke plays, the equipment and fuel used, cooking temperature, and cooking time.",
      "The meat may be ground, for hamburgers, or processed into sausage or kebabs.",
      "The cuisine of the United States reflects its history.",
      "The European colonization of the Americas yielded the introduction of a number of ingredients and cooking styles to the latter."
    ],
    "actualResponse": "I think everything pretty much right out of a barbecue. Like  my burgers!"
  },
  {
    "convesation": [
      "I like to shop online, probably a bit too much.",
      "Lol me too! What's your favorite online store?",
      "I love to shop on amazon. So you shop online a lot too? Where do you shop? ",
      "Amazon as well. I also shop a lot online at Old Navy and Gap. They have great sales.",
      "Do they really? I mainly use only amazon."
    ],
    "suggestions": [
      "The Amazon Kindle is a series of e-readers designed and marketed by Amazon.",
      "Amazon Kindle devices enable users to browse, buy, download, and read e-books, newspapers, magazines and other digital media via wireless networking to the Kindle Store.",
      "This is a list of products and services offered by American corporation Amazon.",
      "Amazon product lines include several media (books, DVDs, music CDs, videotapes, and software), apparel, baby products, consumer electronics, beauty products, gourmet food, groceries, health and personal-care items, industrial & scientific supplies, kitchen items, jewelry and watches, lawn and garden items, musical instruments, sporting goods, tools, automotive items and toys & games.",
      "Amazon.com, Inc., doing business as Amazon (), is an American electronic commerce and cloud computing company based in Seattle, Washington that was founded by Jeff Bezos on July 5, 1994.",
      "The tech giant is the largest Internet retailer in the world as measured by revenue and market capitalization, and second largest after Alibaba Group in terms of total sales."
    ],
    "actualResponse": "Do you use Amazon Kindle, the series of e-readers designed and marketed by Amazon."
  },
  {
    "convesation": [
      "When I was younger, I got stung by a bee on my hand and it swelled up.",
      " there are 7 families of bees with 20.000 known speices",
      "Oh wow, do you know what species is the most dangerous? ",
      "No I don't know and not all bees sting. There are honeybees. bumblebees that live in colonies",
      "I see a lot of honeybees that fly around here. We try to do everything possible to help them thrive. "
    ],
    "suggestions": [
      "A honey bee (or honeybee) is any member of the genus Apis, primarily distinguished by the production and storage of honey and the construction of perennial, colonial nests from wax.",
      "In the early 21st century, only seven species of honey bee are recognized, with a total of 44 subspecies, though historically six to eleven species are recognized.",
      "A worker bee is any female (eusocial) bee that lacks the full reproductive capacity of the colony's queen bee; under most circumstances, this is correlated to an increase in certain non-reproductive activities relative to a queen, as well.",
      "Worker bees occur in many bee species other than honey bees, but this is by far the most familiar colloquial use of the term.",
      "Bees are flying insects closely related to wasps and ants, known for their role in pollination and, in the case of the best-known bee species, the European honey bee, for producing honey and beeswax.",
      "Bees are a monophyletic lineage within the superfamily Apoidea and are presently considered a clade, called Anthophila."
    ],
    "actualResponse": "Yes bees feed on nectar and pollen its their energy source"
  },
  {
    "convesation": [
      "im planning a Skiing trip next winter",
      "Do you participate in competitive skiing?",
      "no, i just do it for fun. anything i should know  in advanced for my Skiing trip?",
      "Just make sure to bring two ski poles.",
      "ok ahahah i will make sure not to forget them"
    ],
    "suggestions": [
      "Cross-country skiing is a form of skiing where skiers rely on their own locomotion to move across snow-covered terrain, rather than using ski lifts or other forms of assistance.",
      "Cross-country skiing is widely practiced as a sport and recreational activity; however, some still use it as a means of transportation.",
      "Skiing, or traveling over snow on skis, has a history of at least eight millennia.",
      "The earliest archaeological examples of skis were found in Russia and date to 6000 BCE.",
      "Skiing can be a means of transport, a recreational activity or a competitive winter sport in which the participant uses skis to glide on snow.",
      "Many types of competitive skiing events are recognized by the International Olympic Committee (IOC), and the International Ski Federation (FIS)."
    ],
    "actualResponse": "Back then it was easier for early skiers to remember to bring them because they only used one long pole."
  },
  {
    "convesation": [
      "I think Budweiser taste terrible. Have you ever had it?",
      "Yes, and I love it!  It's a filtered beer, and it comes in either draft or packaged forms",
      "Yeah? From my understanding they are called \"Bud\" over in Europe because they have been in a trademark dispute with another beer company. ",
      "Yes, that's true because the trademark name of Budweiser is own by the Czech beer maker, Budweiser Budvar",
      "Ah I thought so. I'm not a big fan of theirs because I feel like the beer is really weak and watered down."
    ],
    "suggestions": [
      "Beer in Canada was introduced by European settlers in the seventeenth century.",
      "The first commercial brewery was La Brasseries due Roy [sic] started by New France Intendant Jean Talon, in Québec City in 1668.",
      "Anheuser-Busch, a wholly owned subsidiary of Anheuser-Busch InBev SA/NV, is the largest brewing company in the United States, with a market share of 45 percent in 2016.",
      "The company operates 12 breweries in the United States and nearly 20 in other countries, which increased recently since Anheuser-Busch InBev SA/NV acquired SABMiller.",
      "Beer in the United States is manufactured by more than 3,000 breweries, which range in size from industry giants to brew pubs and microbreweries.",
      "The United States produced 196 million barrels () of beer in 2012, and consumes roughly of beer per capita annually."
    ],
    "actualResponse": "Compared to Canadian beer, I guess it is!  It is a pale lager though, and is produced by Anheuser-Busch"
  },
  {
    "convesation": [
      "did you know about drum kit",
      "A drum kit is also called a drum set, which contains percussion instruments.",
      "hmm......yes may be it can be also used for multi purposes",
      "Some drum kits included electronic instruments in the 2000s.",
      "yes ofcourse it has been used as electronic too"
    ],
    "suggestions": [
      "A drum kit — also called a drum set, trap set, or simply drums — is a collection of drums and other percussion instruments, typically cymbals, which are set up on stands to be played by a single player, with drumsticks held in both hands, and the feet operating pedals that control the hi-hat cymbal and the beater for the bass drum.",
      "A drum kit consists of a mix of drums (categorized classically as membranophones, Hornbostel-Sachs high-level classification 2) and idiophones - most significantly cymbals, but can also include the woodblock and cowbell (classified as Hornbostel-Sachs high-level classification 1).",
      "An electronic drum, also known as electric drums, digital drums, or electronic percussion, is a modern electronic musical instrument, a special type of synthesizer or sampler, primarily designed to serve as an alternative to an acoustic drum kit or other percussion instruments.",
      "An electronic drum consists of an electronic or digital sound module which produces the synthesized or sampled percussion sounds and one or more electric sensors to trigger the sounds.",
      "An electronic drum module is an electronic or digital music device in an electronic drum kit that serves as the central processing unit and sound module.",
      "The drum module creates or produces the drum kit sounds or other sounds selected by the drummer."
    ],
    "actualResponse": "There are also hybrid kits and entirely electronic drum kits."
  },
  {
    "convesation": [
      "i love dr pepper",
      "Oh same, it's my favorite Dr Pepper is a carbonated soft drink ",
      "oh yea? its such a good soda",
      "Oh yeah, I also like 7-Up,5 a brand of lemon-lime flavor",
      "oh yea thats great too"
    ],
    "suggestions": [
      "Dr Pepper is a carbonated soft drink marketed as having a unique flavor.",
      "The drink was created in the 1880s by pharmacist Charles Alderton in Waco, Texas and first served around 1885.",
      "Dublin Dr Pepper was the popular name for a style of Dr Pepper soft drink made by the Dublin Dr Pepper Bottling Company in Dublin, Texas.",
      "Dublin Dr Pepper followed the original recipe, using cane sugar as the sweetener as opposed to newer high fructose corn syrup (HFCS).",
      "Dr Pepper Ballpark (formerly Dr Pepper/Seven Up Ballpark) is the home ballpark of the Frisco RoughRiders Class AA minor league baseball club.",
      "Located in Frisco, Texas in the United States, the stadium has a capacity of 10,316."
    ],
    "actualResponse": "But, Dr Pepper was created in 1880s by a pharmacist. Isn't that wild?"
  },
  {
    "convesation": [
      "Have you ever made bagels, it's quite fun!",
      "I've made bread before, but never bagels! Could you tell me more about the process?",
      "Well, it's similar but bagels are generally boiled instead of baked.",
      "Ah, and I've also heard that they're topped with seeds. Which seeds do you like to use?",
      "Sesame seeds are my favorite topping."
    ],
    "suggestions": [
      "Poppy seed is an oilseed obtained from the poppy (\"Papaver somniferum\").",
      "The tiny kidney-shaped seeds have been harvested from dried seed pods by various civilizations for thousands of years.",
      "Papaver somniferum, commonly known as the opium poppy, or breadseed poppy, is a species of flowering plant in the family Papaveraceae.",
      "It is the species of plant from which opium and poppy seeds are derived and is a valuable ornamental plant, grown in gardens.",
      "Opium (poppy tears, with the scientific name: \"Lachryma papaveris\") is the dried latex obtained from the opium poppy (scientific name: \"Papaver somniferum\").",
      "Opium latex contains approximately 12 percent of the analgesic alkaloid morphine, which is processed chemically to produce heroin and other synthetic opioids for medicinal use and for illegal drug trade."
    ],
    "actualResponse": "Have you heard of poppy seeds? They're also a pretty great and widely used topping."
  },
  {
    "convesation": [
      "There a re a lot of farmers in my state.",
      "As in agriculturer? DO they raise animals or plants for food?",
      "yes there are many with cow farms around here.",
      "Are there mechanisms in place to prevent animal cruelty in how they are slaughtered?",
      "Not sure as im not much into the farming life myself."
    ],
    "suggestions": [
      "Cruelty to animals, also called animal abuse, animal neglect or animal cruelty, is the infliction by omission (animal neglect) or by commission by humans of suffering or harm upon any non-human animal, regardless of whether the act is against the law.",
      "More narrowly, it can be the causing of harm or suffering for specific achievement, such as killing animals for food or for their fur; opinions differ about the extent of cruelty associated with a given method of slaughter.",
      "Animal hoarding is keeping a higher-than-usual number of animals as domestic pets without ability to properly house or care for them, while at the same time denying this inability.",
      "Compulsive hoarding can be characterized as a symptom of mental disorder rather than deliberate cruelty towards animals.",
      "Animal rights is the idea in which some, or all, non-human animals are entitled to the possession of their own lives and that their most basic interests—such as the need to avoid suffering—should be afforded the same consideration as similar interests of human beings.",
      "Advocates oppose the assignment of moral value and fundamental protections on the basis of species membership alone—an idea known since 1970 as speciesism, when the term was coined by Richard D. Ryder—arguing that it is a prejudice as irrational as any other."
    ],
    "actualResponse": "Surely you must be bothered by animal cruelty though, abuse and neglect  or anything that causes suffering or harm to animals, not just farming?"
  },
  {
    "convesation": [
      "hello I like toyota cars and own one",
      "Toyota's are good cars. They are the market leader now in hybrid electric car sales. ",
      "the hybrid electric Toyotas are interesting, maybe I would buy one ",
      "Yes, Toyota and Lexus hybrid cars were able to achieve a 10 million mark back in January 2017, so they are becoming more popular.",
      "that many hybrids,  you know I do not think I ever seen a Lexus hybrid, only Toyota"
    ],
    "suggestions": [
      "Toyota is the world's market leader in sales of hybrid electric vehicles, and one of the largest companies to encourage the mass-market adoption of hybrid vehicles across the globe.",
      "Cumulative global sales of Toyota and Lexus hybrid passenger car models achieved the 10 million milestone in January 2017.",
      "The Toyota Camry (; Japanese: トヨタ・カムリ \"Toyota Kamuri\") is an automobile sold internationally by the Japanese manufacturer Toyota since 1982, spanning multiple generations.",
      "Originally compact in size (narrow-body), later Camry models have grown to fit the mid-size classification (wide-body)—although the two sizes co-existed in the 1990s.",
      "This article provides an overview of the automotive industry in countries around the world.",
      "The United States was the world's largest automobile producer by volume from the early years of the 20th century until the 1980s, when it was overtaken by Japan."
    ],
    "actualResponse": "Yes, I just recently found that out too. Toyota produces automobiles under five brands. They're Toyota (obviously), Hino, Lexus, Ranz, daihatsu. Although, I imagine a couple of those are more familiar in other countries."
  },
  {
    "convesation": [
      "Hi, I am worried about my family getting cancer.  Do you know someone who has or had cancer?",
      "Yes, I know several people who have had cancer. There are over 100 different types of cancers that can affect people. It is very scary indeed.",
      "Wow, that is a lot. What are the easier cancers to treat?",
      "I think one of the best things we can do for our children to help prevent HPV cancer is to make sure they get the vaccine. It can protect them in up to 9 types of HPV cancer. ",
      "How prevalent do you think HPV is in children?"
    ],
    "suggestions": [
      "Human papilloma virus (HPV) vaccines are vaccines that prevent infection by certain types of human papillomavirus.",
      "Available vaccines protect against either two, four, or nine types of HPV.",
      "Human papillomavirus infection is an infection by \"human papillomavirus\" (HPV).",
      "Most HPV infections cause no symptoms and resolve spontaneously.",
      "Gardasil, also known as Gardisil or Silgard or recombinant human papillomavirus vaccine [types 6, 11, 16, 18], is a vaccine for use in the prevention of certain strains of human papillomavirus (HPV), specifically HPV types 6, 11, 16 and 18.",
      "HPV types 16 and 18 cause an estimated 70% of cervical cancers, and are responsible for most HPV-induced anal, vulvar, vaginal, and penile cancer cases."
    ],
    "actualResponse": "It's not a childhood cancer, but they can get the vaccine early (age 12 maybe) to prevent HPV which is an infection that can cause cancer. So it's a cancer that happens later in life but can be prevented early on"
  },
  {
    "convesation": [
      "I love Jane Austen dont you!",
      "She sure is, I have read all three volumes of her juvenile writings in manuscript and even her unfinished novel, The Watsons.",
      "Do you know anything about her that might be of interest to me?",
      "Well I know that she often wrote about the dependence of women on marriage in the pursuit of favourable social standing and economic security.",
      "Yeah she was a very impowered woman. we ned more of them now more than ever"
    ],
    "suggestions": [
      "Jane Austen (; 16 December 1775 – 18 July 1817) was an English novelist known primarily for her six major novels, which interpret, critique and comment upon the British landed gentry at the end of the 18th century.",
      "Austen's plots often explore the dependence of women on marriage in the pursuit of favourable social standing and economic security.",
      "The reception history of Jane Austen follows a path from modest fame to wild popularity.",
      "Jane Austen (1775–1817), the author of such works as \"Pride and Prejudice\" (1813) and \"Emma\" (1815), has become one of the best-known and most widely read novelists in the English language.",
      "Titus Andronicus is a tragedy by William Shakespeare, believed to have been written between 1588 and 1593, probably in collaboration with George Peele.",
      "It is thought to be Shakespeare's first tragedy, and is often seen as his attempt to emulate the violent and bloody revenge plays of his contemporaries, which were extremely popular with audiences throughout the 16th century."
    ],
    "actualResponse": "Indeed, I just love her use of irony, along with her realism and social commentary, Its earned her acclaim among critics and scholars for many years. "
  },
  {
    "convesation": [
      "Some people seem to enjoy what they call Extreme Couponing.",
      "I know!  There is even a tv show about it!  In 2010 it had more than 2 million viewers!",
      "Wow, probably some people go to far with their couponing and it becomes and obsession",
      "No kidding!  You really need some great shopping skills to get the most groceries while saving as much money as you can!",
      "Sure, and it takes times too that maybe you could instead use to make more money, but I like to go were they have reasonable prices."
    ],
    "suggestions": [
      "Extreme Couponing (renamed Extreme Couponing: All-Stars for third season) is a scripted American reality television series produced by Sharp Entertainment and aired on cable network TLC in the United States and Canada.",
      "Extreme couponing is an activity that combines shopping skills with couponing in an attempt to save as much money as possible while accumulating the most groceries.",
      "In marketing, a coupon is a ticket or document that can be redeemed for a financial discount or rebate when purchasing a product.",
      "Customarily, coupons are issued by manufacturers of consumer packaged goods or by retailers, to be used in retail stores as a part of sales promotions.",
      "A drug coupon is a coupon intended to help consumers save money on pharmaceutical drugs.",
      "They are offered by drug companies or distributed to consumers via doctors and pharmacists, and most can be obtained online."
    ],
    "actualResponse": "I do use coupons, but not to that extent!  It's interesting that The Wall Street Journal was the first to mention extreme couponers!"
  },
  {
    "convesation": [
      "I love riding roller coasters.",
      "I love amusement rides. Especially the ones with steep slopes and tight turns.",
      "Yep. That would be a roller coaster.",
      "Six flags has a roller coaster called the Wild Mouse and it runs with a single car instead of attached trains. ",
      "That sounds really fun. I would love to try it."
    ],
    "suggestions": [
      "Roller coaster elements are the individual parts of roller coaster design and operation, such as a track, hill, loop, or turn.",
      "Variations in normal track movement that add thrill or excitement to the ride are often called \"thrill elements\" or \"thrill factor\".",
      "A roller coaster is a type of amusement ride that employs a form of elevated railroad track designed with tight turns, steep slopes, and sometimes inversions.",
      "People ride along the track in open cars, and the rides are often found in amusement parks and theme parks around the world.",
      "A wooden roller coaster is most often classified as a roller coaster with running rails made of flattened steel strips mounted on laminated wooden track.",
      "Occasionally, the support structure may be made out of a steel lattice or truss, but the ride remains classified as a wooden roller coaster due to the track design."
    ],
    "actualResponse": "Most roller coasters have a lot of seats that more than a few passengers can sit and are restrained with safety harnesses."
  },
  {
    "convesation": [
      "Do you like rap music? Meek Mill is my favorite rapper by far",
      "I do listen to rap on occassion. It is music that incorporates rhyme, speech, repetition.",
      "Sometimes it is really catchy, other times it is impressive how techinical someone gets or how fast they rap",
      "Yeah, the contents of rap include \"content\", \"flow\", and \"delivery\".",
      "Yeah, all of those things make for some really great songs, it is my favorite genre"
    ],
    "suggestions": [
      "Rapping (or rhyming, spitting, emceeing, MCing) is a musical form of vocal delivery that incorporates \"rhyme, rhythmic speech, and street vernacular\", which is performed or chanted in a variety of ways, usually over a backbeat or musical accompaniment.",
      "The components of rap include \"content\" (what is being said), \"flow\" (rhythm, rhyme), and \"delivery\" (cadence, tone).",
      "Hip hop music, also called hip-hop or rap music, is a music genre developed in the United States by inner-city African Americans in the 1970s which consists of a stylized rhythmic music that commonly accompanies rapping, a rhythmic and rhyming speech that is chanted.",
      "It developed as part of hip hop culture, a subculture defined by four key stylistic elements: MCing/rapping, DJing/scratching with turntables, break dancing, and graffiti writing.",
      "Hip hop or hip-hop is a subculture and art movement developed in The Bronx in New York City during the late 1970s.",
      "The origins of the word are often disputed."
    ],
    "actualResponse": "Rap differes from poetry in that it is usually performed in time to an instrumental track."
  },
  {
    "convesation": [
      "I enjoy walking or hiking on nature trails...how about you?",
      "I rather enjoy hiking as well especially along well groomed trails in the country side.",
      "As long as it is a flat trail...don't like the hills so much. Ever hiked the Appallacian Trail?",
      "I have hiked part of it actually. A group of friends and I went a short way starting at Springer Mountain, where the trail starts in Georgia.",
      "Wow, that's great. Always wanted to hike part of that trail. Georgia is a beautiful State."
    ],
    "suggestions": [
      "The Appalachian National Scenic Trail, generally known as the Appalachian Trail or simply the A.T., is a marked hiking trail in the Eastern United States extending between Springer Mountain in Georgia and Mount Katahdin in Maine.",
      "The trail is estimated around 2,200 miles (3,500 km) long, though the exact length changes over time as parts are modified or rerouted.",
      "The Appalachian National Scenic Trail spans fourteen U.S. states during its journey that is long, including Georgia, North Carolina, Tennessee, Virginia, West Virginia, Maryland, Pennsylvania, New Jersey, New York, Connecticut, Massachusetts, Vermont, New Hampshire, and Maine.",
      "It begins at Springer Mountain, Georgia, and follows the ridgeline of the Appalachian Mountains, crossing many of its highest peaks and running with only a few exceptions almost continuously through wilderness before ending at Mount Katahdin, Maine.",
      "Mount Katahdin (pronounced , \"\") is the highest mountain in the U.S. state of Maine at .",
      "Named Katahdin by the Penobscot Indians, which means \"The Greatest Mountain\", the mountain is located within Northeast Piscataquis, Piscataquis County, and is the centerpiece of Baxter State Park."
    ],
    "actualResponse": "The Appalachian Trail is rather neat and Georgia is a beautiful place to start the journey. In fact, at 2,200 miles long it is thought to be longest hiking only trail in the world."
  },
  {
    "convesation": [
      "I love playing my guitar. I have a Gibson Les Paul.",
      "That's awesome! It's a very prestigious line of guitars, first sold in 1952! Plenty of famous people have Gibson Les Paul's.",
      "I did not know they started making Gibson les Paul's that long ago. They make quality guitars.",
      "Indeed, the Les Paul has been continually produced in countless versions and editions since its release, so there is lots of variety in that time span!",
      "Do you know where the make the Les Paul guitars?"
    ],
    "suggestions": [
      "The Gibson Les Paul is a solid body electric guitar that was first sold by the Gibson Guitar Corporation in 1952.",
      "The Les Paul was designed by Gibson president Ted McCarty, factory manager John Huis and their team, along with guitarist/inventor Les Paul.",
      "Lester William Polsfuss (June 9, 1915 – August 12, 2009), known as Les Paul, was an American jazz, country, and blues guitarist, songwriter, luthier, and inventor.",
      "He was one of the pioneers of the solid-body electric guitar.",
      "An electric guitar is a guitar that uses one or more pickups to convert the vibration of its strings into electrical signals.",
      "The vibration occurs when a guitarist strums, plucks, fingerpicks, or taps the strings."
    ],
    "actualResponse": "I'm unsure of where, but I do know that it was designed by Ted McCarthy, factory manager John Huis and their team, along with the guitarist Les Paul. "
  },
  {
    "convesation": [
      "I like chocolate what  of you",
      "I love chocolate! It is a sweet, brown food prepared from cacao seeds.",
      "Yes what other products can be seen in cocoa",
      "When the beans are liquefied through heating, that is called chocolate liquor. Cocoa is used for many things.",
      "Tell me more about chocolate  liquor "
    ],
    "suggestions": [
      "Chocolate is a typically sweet, usually brown food preparation of \"Theobroma cacao\" seeds, roasted and ground.",
      "It is made in the form of a liquid, paste, or in a block, or used as a flavoring ingredient in other foods.",
      "Cocoa butter, also called theobroma oil, is a pale-yellow, edible vegetable fat extracted from the cocoa bean.",
      "It is used to make chocolate, as well as some ointments, toiletries, and pharmaceuticals.",
      "Cocoa solids are a mixture of many substances remaining after cocoa butter is extracted from cacao beans.",
      "When sold as an end product, it may also be called cocoa powder or cocoa."
    ],
    "actualResponse": "Sure, it contains cocoa solids and cocoa butter in equal proportions. It is solid or semi-solid."
  },
  {
    "convesation": [
      "I've been trying to eat healthy and have decided I absolutely love kale!",
      "Do you prefer kale with green leaves or kale with purple leaves",
      "I prefer the purple but it's easier to find the green in my local store. What's your preference?",
      "I don't think I have a preference, but the only kind of kale I have ever had is green.  I never knew that it actually had medicinal qualities to it",
      "It helps that it's versatile, too. The smoothie bar near me starting serving a kale smoothie. Didn't sound great but they add apple and kiwi, pretty tasty."
    ],
    "suggestions": [
      "Planet Smoothie is the third largest American chain of smoothie stores serving smoothies.",
      "The company was founded in 1995 by Martin Sprock in Atlanta, Georgia, and currently operates more than 100 locations.",
      "Smoothie King Franchises, Inc. is a privately held New Orleans-area-based smoothie franchise company with more than 900+ units worldwide.",
      "Working as a soda jerker in his teenage years, Steve Kuhnau, founder of Smoothie King, found himself unable to digest the malts, shakes, and floats he was preparing due to a lactose intolerance.",
      "Tropical Smoothie Cafe, sometimes referred to as simply Tropical Smoothie, is a restaurant franchise in the United States.",
      "In addition to smoothies, the cafes offer sandwiches, wraps, salads, flat breads, and introduced bowls to their food line in 2017."
    ],
    "actualResponse": "Oh really?  Is your local smoothie bar a Planet Smoothie or a Smoothie King?"
  },
  {
    "convesation": [
      "I really enjoy doing yoga after a long week of stressful work.",
      "Yoga is excellent exercise, it is a low impact exercise and is often used for therapeutic purposes",
      "Oh, yeah! That is what I use it for. How about you? Do you practice yoga? ",
      "Yes I try to do it daily but I usually don't do it that often. I like to go to classes sometimes which helps with my breath work and meditation",
      "Have you learned something new about yoga in your last class?"
    ],
    "suggestions": [
      "The Yoga Sūtras of Patañjali are 196 Indian sutras (aphorisms).",
      "The \"Yoga Sutras\" were compiled prior to 400 CE by Sage Patanjali, taking materials about yoga from older traditions.",
      "Yoga (; Sanskrit, योगः Listen) is a group of physical, mental, and spiritual practices or disciplines which originated in ancient India.",
      "There is a broad variety of yoga schools, practices, and goals in Hinduism, Buddhism, and Jainism.",
      "Yoga philosophy is one of the six major orthodox schools of Hinduism.",
      "Ancient, medieval and most modern literature often refers to the Yoga school of Hinduism simply as \"Yoga\"."
    ],
    "actualResponse": "Well, I learned that the base text for yoga is called \"Yoga Sutras of Patanjali\""
  },
  {
    "convesation": [
      "I like to watch my children play minecraft. I have not seen another video game like it, have you?",
      "I have not. I've never played Minecraft but I would like to someday. I always see people posting custom maps and resources from the game. I think it's cool you can build your own things.",
      "It seems to be a game for all ages. My kids started when they were young and the game grows with them. Yes, the custom maps are amazing! ",
      "Nice. My partner is a big gamer and always says I would love Minecraft because I like to build things in Fallout.",
      "I agree. You start with nothing and can build anything you want. You can really stretch your imagination. I like building in Sims, so Minecraft is similar in building stuff. "
    ],
    "suggestions": [
      "The Sims 3 is the third major title in the life simulation video game developed by The Sims Studio (Maxis) and published by Electronic Arts.",
      "It is the sequel to \"The Sims 2\".",
      "The Sims 4 is the fourth major title in life simulation video game series \"The Sims\", developed by Maxis and The Sims Studio and published by Electronic Arts.",
      "\"The Sims 4\" was originally announced on May 6, 2013, and was released in North America on September 2, 2014 for Microsoft Windows.",
      "The Sims 2 is a 2004 strategic life simulation video game developed by Maxis and published by Electronic Arts.",
      "It is the sequel to \"The Sims\"."
    ],
    "actualResponse": "I use to play sims a lot when I was younger. Have you played and of the Sims games recently?"
  },
  {
    "convesation": [
      "I enjoy making sculptures.",
      "I know a bit about it. It's actually considered one of the \"plastic arts\"",
      "I've being toying with designing sculptures digitally with CAD and then 3d printing them.",
      "I'm not sure what CAD is, but I do know about stereolithography. It's one of the most common file types for 3D printing.",
      "CAD is computer assisted design."
    ],
    "suggestions": [
      "Computer-aided design (CAD) is the use of computer systems (or ) to aid in the creation, modification, analysis, or optimization of a design.",
      "CAD software is used to increase the productivity of the designer, improve the quality of design, improve communications through documentation, and to create a database for manufacturing.",
      "A 3D scanner is a device that analyses a real-world object or environment to collect data on its shape and possibly its appearance (e.g.",
      "colour).",
      "3D printing refers to processes in which material is joined or solidified under computer control to create a three-dimensional object, with material being added together (such as liquid molecules or powder grains being fused together).",
      "3D printing is used in both rapid prototyping and additive manufacturing (AM)."
    ],
    "actualResponse": "I've heard of Computer-aided design, which helps to create, modify, analysis, and optimize a 3D design."
  },
  {
    "convesation": [
      "Heyy, what do you think of Apple! I've owned an iphone my whole life and I'm not sure if I'll always want to own one.",
      "I love Apple, the iphone is my favorite smartphone.",
      "Really! Why do you prefer the iphone over other smartphones? ",
      "I like that they run the iOS operating system.",
      "I guess I don't know how the iOS is different or better than, for example, an android's system. Does the iOS do something particularly well?"
    ],
    "suggestions": [
      "iPhone ( ) is a line of smartphones designed and marketed by Apple Inc.",
      "They run Apple's iOS mobile operating system.",
      "iOS (formerly iPhone OS) is a mobile operating system created and developed by Apple Inc. exclusively for its hardware.",
      "It is the operating system that presently powers many of the company's mobile devices, including the iPhone, iPad, and iPod Touch.",
      "Apple Inc. is an American multinational technology company headquartered in Cupertino, California that designs, develops, and sells consumer electronics, computer software, and online services.",
      "The company's hardware products include the iPhone smartphone, the iPad tablet computer, the Mac personal computer, the iPod portable media player, the Apple Watch smartwatch, the Apple TV digital media player, and the HomePod smart speaker."
    ],
    "actualResponse": "It powers many of the iphones, ipads and ipod touches."
  },
  {
    "convesation": [
      "I'm thinking of attending the University of Chicago, what do you think?",
      "That sounds like a good idea, it is in the top-ten position in national and international rankings!",
      "Are there a lot famous alumni from there? Any celebrities?",
      "Saul Below went there! He was a famous author who won the Nobel prize for literature and the national medal of arts!",
      "Oh wow, I like learning about Nobel Prize winners."
    ],
    "suggestions": [
      "After his death in 1896, the will of Swedish industrialist Alfred Nobel established the Nobel Prizes.",
      "Nobel's will specified that annual prizes are to be awarded for service to humanity in the fields of physics, chemistry, physiology or medicine, literature, and peace.",
      "The Nobel Prize (, ; Swedish definite form, singular: \"Nobelpriset\"; ) is a set of annual international awards bestowed in several categories by Swedish and Norwegian institutions in recognition of academic, cultural, or scientific advances.",
      "The will of the Swedish scientist Alfred Nobel established the prizes in 1895.",
      "The Nobel Prize in Physiology or Medicine (), administered by the Nobel Foundation, is awarded once a year for outstanding discoveries in the fields of life sciences and medicine.",
      "It is one of five Nobel Prizes established in 1895 by Swedish chemist Alfred Nobel, the inventor of dynamite, in his will."
    ],
    "actualResponse": "There is a Nobel prize for Medicine, which the University of Chicago offers courses in!"
  },
  {
    "convesation": [
      "I am a volunteer at a local animal shelter, i think that im doing a great job, have you ever been there?",
      "Yes.I used to be a volunteer myself.",
      "Nice for how long? Have you adopted any of the animals, or just took them home for the night if the shelter is full :D",
      "Yes, i adopted a german sheppard.What about you?",
      "I have, a cat, she was rescued from a farm, they didnt take care of the animals there at all!"
    ],
    "suggestions": [
      "An animal shelter or pound is a place where stray, lost, abandoned or surrendered animals, mostly dogs and cats, and sometimes sick or wounded wildlife are kept and rehabilitated.",
      "While no-kill shelters exist, it is sometimes policy to euthanize sick animals, and any animal that is not claimed quickly enough by a previous or new owner.",
      "People for the Ethical Treatment of Animals (PETA ; stylized PeTA) is an American animal rights organization based in Norfolk, Virginia, and led by Ingrid Newkirk, its international president.",
      "A nonprofit corporation with nearly 400 employees, it claims that it has 6.5 million members and supporters, in addition to claiming that it is the largest animal rights group in the world.",
      "Management of free-roaming feral and semi-feral horses, (colloquially called \"wild\") on various public or tribal lands in North America is accomplished under the authority of law, either by the government of jurisdiction or efforts of private groups.",
      "In western Canada, management is a provincial matter, with several associations and societies helping to manage wild horses in British Columbia and Alberta."
    ],
    "actualResponse": "I stopped going to the shelter because they started euthanizing euthanize sick animals, and any animal that is not claimed quickly enough by a previous or new owner."
  },
  {
    "convesation": [
      "I like some comic books because they don't require much thought to read. Never been a huge fan, you?",
      "I like them! Comic magazines are great because of the juxtaposed panels that represent scenes.",
      "Do you know much about them? I know they have a huge die hard fan base.",
      "They do! They were first popularized in the United States in 1933. Though there are origins that trace to Europe in the 1830s.",
      "Wow I would have never guessed they were around that long. That's very interesting!"
    ],
    "suggestions": [
      "The Eastern Color Printing Company was a company that published comic books, beginning in 1933.",
      "At first it was only newspaper comic strip reprints, but later on original material was published.",
      "A comic book or comicbook, also called comic magazine or simply comic, is a publication that consists of comic art in the form of sequential juxtaposed panels that represent individual scenes.",
      "Panels are often accompanied by brief descriptive prose and written narrative, usually dialog contained in word balloons emblematic of the comics art form.",
      "An American comic book is a thin periodical, typically 32-pages, containing comics content.",
      "While the form originated in 1933, American comic books first gained popularity after the 1938 publication of \"Action Comics\", which included the debut of the superhero Superman."
    ],
    "actualResponse": "Yes! And the first modern comic book in the United States was called, \"Famous Funnies\""
  },
  {
    "convesation": [
      "I really love Kentucky, I was born and raised here, Have you ever been there? ",
      "My parents are from Kentucky! I have only been to east, south-central region state a few times",
      "Oh ok, I have lived here for quite some time but dont really know too much about it, What are some cool Kentucky facts that you know? ",
      "They are known for horse racing, bourbon distilleries and moonshine..I definitely need to visit this place to get some real bourbon apparently ha",
      "I have never actually been to a horse race in Kentucky, Where is the derby held at anyways?"
    ],
    "suggestions": [
      "Louisville ( , or ) is the largest city in the Commonwealth of Kentucky and the 29th-most populous city in the United States.",
      "It is one of two cities in Kentucky designated as first-class, the other being the state's second-largest city of Lexington.",
      "The Kentucky Derby Festival is an annual festival held in Louisville, Kentucky during the two weeks preceding the first Saturday in May, the day of the Kentucky Derby.",
      "The festival, Kentucky's largest single annual event, first ran from 1935 to 1937, and restarted in 1956 and includes:  The Kentucky Derby Festival Association started the first week-long festival in 1935, including a parade, a riverfront regatta and an orchestral concert.",
      "Thunder Over Louisville, the annual kickoff event of the Kentucky Derby Festival, is an airshow and fireworks display in Louisville, Kentucky.",
      "It is generally held each April, about two weeks before the first Saturday in May, or Derby Day."
    ],
    "actualResponse": "Louisville Kentencky, It ends the Kentucky Derby Festival usually "
  },
  {
    "convesation": [
      "Thinking about taking violin lessons, do you know anything about playing the violin?",
      "Yes! Just to make sure, we're talking about the wooden string instrument, sometimes called a fiddle right?",
      "Yes, do you play?",
      "I do! I play traditional Irish music using a violin with a hallow wooden body.",
      "How cool! I am from the country and we often call a violin a fiddle lol"
    ],
    "suggestions": [
      "The double bass, or simply the bass (and numerous other names), is the largest and lowest-pitched bowed string instrument in the modern symphony orchestra.",
      "It is a transposing instrument and is typically notated one octave higher than tuned to avoid excessive ledger lines below the staff.",
      "The violin, also known informally as a fiddle, is a wooden string instrument in the violin family.",
      "Most violins have a hollow wooden body.",
      "The cello ( ; plural cellos or celli) or violoncello ( ; ) is a bowed, and sometimes plucked, string instrument with four strings tuned in perfect fifths.",
      "The strings from low to high are generally tuned to C, G, D and A, an octave lower than the viola."
    ],
    "actualResponse": "Nice! It's the highest pitched instrument in the string family. Some people do not enjoy it for this reason, but I love it."
  },
  {
    "convesation": [
      "Ive never had a reason to own a teapot.",
      "The vessel used for steeping tea?",
      "yep, nowadays you get electric kettles and such but teapots are rare",
      "I prefer dry tea especially the ones in tea bags.",
      "its all about leaf quality when it comes to tea."
    ],
    "suggestions": [
      "A teapot is a vessel used for steeping tea leaves or a herbal mix in boiling or near-boiling water, and for serving the resulting infusion which is called tea.",
      "Dry tea is available either in tea bags or as loose tea, in which case a tea infuser or tea strainer may be of some assistance, either to hold the leaves as they steep or to catch the leaves inside the teapot when the tea is poured.",
      "Yixing clay teapots () (also called \"Purple Sand\" () are made from Yixing clay.",
      "This traditional style commonly used to brew tea originated in China, dating back to the 15th century, and are made from clay produced near Yixing in the eastern Chinese province of Jiangsu.",
      "Teapot Island is a teapot museum in Kent, England.",
      "The museum grew from the personal teapot collection of owner Sue Blazye, which started when her grandmother gave her a teapot in 1983, encouraging other family members and friends to do the same."
    ],
    "actualResponse": "Yes, I like teapots that have an opening on the lid."
  },
  {
    "convesation": [
      "Hi. I've heard there are two parts to OCD, thoughts and actions, is this true?",
      "Kind of. OCD is a mental disorder where people feel the need to check things repeatedly, perform certain routines repeatedly, or have certain thoughts repeatedly.",
      "What are some examples of the thoughts or routines?",
      "Routines are often simple things like repetitive hand washing, counting things, and checking to see if a door is locked.",
      "Is there a component of people with OCD thinking bad things will happen if they stop."
    ],
    "suggestions": [
      "Obsessive–compulsive disorder (OCD) is a mental disorder where people feel the need to check things repeatedly, perform certain routines repeatedly (called \"rituals\"), or have certain thoughts repeatedly.",
      "People are unable to control either the thoughts or the activities for more than a short period of time.",
      "An intrusive thought is an unwelcome involuntary thought, image, or unpleasant idea that may become an obsession, is upsetting or distressing, and can feel difficult to manage or eliminate.",
      "When such thoughts are associated with obsessive-compulsive disorder (OCD), depression, body dysmorphic disorder (BDD), and sometimes attention-deficit hyperactivity disorder (ADHD), the thoughts may become paralyzing, anxiety-provoking, or persistent.",
      "Obsessive–compulsive personality disorder (OCPD) is a personality disorder characterized by a general pattern of concern with orderliness, perfectionism, excessive attention to details, mental and interpersonal control, and a need for control over one's environment, at the expense of flexibility, openness to experience, and efficiency.",
      "Workaholism and miserliness are also seen often in those with this personality disorder."
    ],
    "actualResponse": "I'm not sure. Most adults with OCD realize that their behaviors don't make sense, so if it is a fear of bad things happening it is subconscious."
  },
  {
    "convesation": [
      "I can't stand pizza!",
      "Me too. I'll only eat it if its from Naples because that's where it was invented.",
      "I think pizza from Naples has a good crust though.",
      "Yeah, they started a non profit organization called \"Associazione Verace Pizza Napoletana\"  to protect true Neapolitan pizza. Too many other pizza companies were stealing their swag.  ",
      "Oh wow, that is cool. I really hate stuffed crust."
    ],
    "suggestions": [
      "Pizza Hut is an American restaurant chain and international franchise founded in 1958 by Dan and Frank Carney.",
      "The company is known for its Italian-American cuisine menu including pizza and pasta, as well as side dishes and desserts.",
      "During the latter half of the 20th century, pizza became a globally accessible dish, mainly due to Italian immigrants that had brought their dishes to new people with resounding success, often in racially and culturally resistive environments.",
      "A survey from 2004 showed that Norwegians eat the most frozen pizza (5.4 kg/person*year), followed by Germans.",
      "Stuffed crust pizza is pizza with cheese and may include other toppings added into the crust.",
      "The stuffed crust pizza was popularized by Pizza Hut which debuted this style of pizza in 1995."
    ],
    "actualResponse": "Pizza Hut a restaurant that specializes in pizza makes some good stuffed crust pizza."
  }
]