{
    "assignment_ids": [
        "39RP059MEIZ41P937RE6XNBA880MBH"
    ],
    "bad_wizard_worker": "A2ACW7CBIDO9XE",
    "chosen_topic": "Las Vegas seems interesting. I love casinos",
    "chosen_topic_passage": {},
    "dialog": [
        {
            "checked_passage": {
                "no_passages_used": "no_passages_used"
            },
            "checked_sentence": {
                "no_passages_used": "no_passages_used"
            },
            "clicked_passages": {},
            "full_passages": [
                "Las Vegas Valley\n\nThe Las Vegas Valley is a major metropolitan area in the southern part of the U.S. state of Nevada. The state's largest urban agglomeration, it is the heart of the Las Vegas–Paradise-Henderson, NV MSA. The Valley is largely defined by the Las Vegas Valley landform, a basin area surrounded by mountains to the north, south, east and west of the metropolitan area. The Valley is home to the three largest incorporated cities in Nevada: Las Vegas, Henderson and North Las Vegas. Five unincorporated towns governed by the Clark County government are part of the Las Vegas Township and constitute the largest community in the state of Nevada.\n\nThe names Las Vegas and Vegas are interchangeably used to indicate the Valley, the Strip, and the city, and as a brand by the Las Vegas Convention and Visitors Authority to denominate the region. The Valley is affectionately known as the \"ninth island\" by Hawaii natives and Las Vegans alike, in part due to the large number of people originally from Hawaii who live in and regularly travel to Las Vegas.\n\nSince the 1990s the Las Vegas Valley has seen exponential growth, more than doubling its population of 741,459 in 1990 to more than 2 million estimated in 2015. The Las Vegas Valley remains one of the fastest growing metropolitan areas in the United States, and in its relatively short history has established a diverse presence in international business, commerce, urban development and entertainment, as well as one of the most iconic and most visited tourist destinations in the world. In 2014, a record breaking 41 million visited the Las Vegas area, producing a gross metropolitan product of more than $100 billion.\n\nThe first reported non-Native American visitor to the Las Vegas Valley was the Mexican scout Rafael Rivera in 1829. Las Vegas was named by Mexicans in the Antonio Armijo party, including Rivera, who used the water in the area while heading north and west along the Old Spanish Trail from Texas. In the 19th century, areas of the valley contained artesian wells that supported extensive green areas, or meadows, hence the name \"Las Vegas\" (\"vegas\" being Spanish for \"meadows\").\n\nThe area was previously settled by Mormon farmers in 1854 and later became the site of a United States Army fort in 1864, beginning a long relationship between southern Nevada and the U.S. military. Since the 1930s, Las Vegas has generally been identified as a gaming center as well as a resort destination, primarily targeting adults.\n\nNellis Air Force Base is located in the northeast corner of the valley. The ranges that the Nellis pilots use and various other land areas used by various federal agencies, limit growth of the valley in terms of geographic area.\n\nBusinessman Howard Hughes arrived in the late 1960s and purchased many casino hotels, as well as television and radio stations in the area. Legitimate corporations began to purchase casino hotels as well, and the mob was run out by the federal government over the next several years. The constant stream of tourist dollars from the hotels and casinos was augmented by a new source of federal money from the establishment of what is now Nellis Air Force Base. The influx of military personnel and casino job-hunters helped start a land building boom which is now leveling off.\n\nThe Las Vegas area remains one of the world's top entertainment destinations.\n\nThe valley is contained in the Las Vegas Valley landform. This includes the cities of Las Vegas, North Las Vegas, and Henderson, and the unincorporated towns of Summerlin South, Paradise, Spring Valley, Sunrise Manor, Enterprise, Winchester, and Whitney. The valley is technically located within the larger metropolitan area, as the metropolitan area covers all of Clark County including parts that do not fall within the valley.\n\nThe government of Clark County has an \"Urban Planning Area\" of Las Vegas. This definition is a roughly rectangular area, about from east to west and from north to south. Notable exclusions from the \"Urban Planning Area\" include Red Rock, Blue Diamond, and Mount Charleston.\n\nThe Las Vegas Metropolitan Police Department is the largest police department in the valley and the state and exercises jurisdiction in the entire county. There are approximately 3,000 police officers that cover the city of Las Vegas; unincorporated areas; the town of Laughlin, about from Downtown Las Vegas; and desert, park, and mountain areas within Clark County. The department does not exercise primary jurisdiction in areas with separate police forces such as North Las Vegas, Henderson, Boulder City, Nellis Air Force Base and the Paiute reservation.\n\nThe Las Vegas Valley lies in the Mojave Desert. The surrounding land is desert with mountains in the distance.\n\nThe Las Vegas Valley lies in a relatively high-altitude portion of the Mojave Desert, with a subtropical hot-desert climate. The Valley generally averages less than of rain annually. Daily daytime summer temperatures in July and August typically range from to , while nights generally range from to . Very low humidity, however, tempers the effect of these temperatures, though dehydration, heat exhaustion, and sun stroke can occur after even a limited time outdoors in the summer. The interiors of automobiles often prove deadly to small children and pets during the summer and surfaces exposed to the sun can cause first- and second-degree burns to unprotected skin. July and August can also be marked by \"monsoon season\", when moist winds from the Gulf of California soak much of the Southwestern United States. While not only raising humidity levels, these winds develop into dramatic desert thunderstorms that can sometimes cause flash flooding.\n\nWinters in the Las Vegas Valley are typically chilly, but sunny. Winter highs in December and January usually range from to , while nighttime lows range from to . The mountains surrounding the valley are snow-covered during the winter season, but snow accumulation in the area itself is uncommon. Every few years apart, however, Las Vegas does get a measurable snowfall.\n\nSpring and fall are generally warm to hot.\n\nThe valley has seven known earthquake fault zones; Frenchman Mountain Fault; Whitney Mesa Fault; Cashman Fault; Valley View Fault; Decatur Fault; Eglington Fault; West Charleston Fault.\n\nHaving part of the region in a desert basin creates issues with air quality. From the dust the wind picks up, to the smog produced by vehicles, to the pollen in the air, the valley has several bad air days.\n\nPollen can be a major issue several weeks a year, with counts occasionally in the 70,000-plus range. Local governments are trying to control this by banning plants that produce the most pollen.\n\nThe dust problems usually happen on very windy days, so they tend to be short and seasonal. Full-fledged dust storms are rare.\n\nSmog, on the other hand, gets worse when there is no wind to move the air out of the valley. Also, in winter it is possible for an inversion to form in the valley.\n\nSince manufacturing is not a dominant industry of Las Vegas, and with Clark County working to control air quality problems, success has been shown over the years.\n\nThe native flora does little to help the soil retain water. During the intense rains of monsoon season or (relatively) wet months of January and February, a network of dry natural channels, called washes or arroyos, carved into the valley floor allows water to flow down from the mountains and converge in the Las Vegas Wash which runs through the Clark County Wetlands Park. The wash system used to form a large natural wetlands which then flowed into the Colorado River, until the construction of Hoover Dam on the Colorado River led to the creation of Lake Mead. Further development in the 1980s and 1990s made Lake Las Vegas, which required directing the Las Vegas Wash into tunnels which run under Lake Las Vegas and into Lake Mead.\n\nNevada receives an allocation of water each year from Lake Mead, with credits for water it returns to the lake. The allocations were made with the Colorado River Compact when Nevada had a much smaller population and very little agriculture. The allocations were also made during a wet string of years, which overstated the available water in the entire watershed. As a result, precipitation that is below normal for a few years can significantly affect the Colorado River reservoirs. The Las Vegas area uses most of this allocation with Laughlin, Nevada using most of the remaining allocation. In June 2007, the price of a cubic meter was 57 cents in Las Vegas. Las Vegas gets around 90 percent of its water from Lake Mead.\n\nEarly Vegas depended on the aquifer which fed the flowing springs supporting the meadows that gave the area its name, but the pumping of water from these caused a large drop in the water levels and ground subsidence over wide areas of the valley. Today, the aquifers are basically used to store water that is pumped from the lake during periods of low demand and pumped out during periods of high demand.\n\nThe population doubling time in the greater metropolitan area was under ten years, since the early 1970s and the Las Vegas metropolitan area now has a population approaching two million people. This rapid population growth led to a significant urbanization of desert lands into industrial and commercial areas (see suburbia).\n\nThe driving force in Las Vegas is the tourism industry and the area has about 150,000 hotel rooms, more than any other city in the world. In the past, casinos and celebrity shows were the two major attractions for the area. Now shopping, conventions, fine dining, and outdoor beauty are also major forces in attracting tourist dollars.\n\nLas Vegas serves as world headquarters for the world's two largest Fortune 500 gaming companies, Caesars Entertainment and MGM Resorts International. Several companies involved in the manufacture of electronic gaming machines, such as slot machines, are located in the Las Vegas area. In the first decade of the 21st century, shopping and dining have become attractions of their own. Tourism marketing and promotion are handled by the Las Vegas Convention and Visitors Authority, a county-wide agency. Its annual Visitors Survey provides detailed information on visitor numbers, spending patterns, and resulting revenues.\n\nWhile Las Vegas has historically attracted high-stake gamblers from around the world, it is now facing tougher competition from the UK, Hong Kong and Macau (China), Eastern Europe and developing areas in the Middle East.\n\nLas Vegas has recently enjoyed a boom in population and tourism. The urban area has grown outward so quickly that it borders Bureau of Land Management holdings along its edges. This has led to an increase in land values such that medium- and high-density development is occurring closer to the core. The Chinatown of Las Vegas was constructed in the early 1990s on Spring Mountain Road. Chinatown initially consisted of only one large shopping center complex, but the area was expanded with shopping centers that contain various Asian businesses. Over the past few years, retirees have been moving to the metro area, driving businesses that support them from housing to health care.\n\nWhile the cost of housing spiked up over 40% in 2004, the lack of business and income taxes still makes Nevada an attractive place for many companies to relocate to or expand existing operations. Being a true twenty-four-hour city, call centers have always seemed to find Las Vegas a good place to hire workers who are accustomed to working at all hours.\n\nThe construction industry accounts for a share of the economy in Las Vegas. Hotel casinos planned for the Strip can take years to build and employ thousands of workers. Developers discovered that there was demand for high-end condominiums. By 2005, more than 100 condominium buildings were in various stages of development, however, in 2008, the construction industry went into a downturn due to the credit crunch, though the industry has since seen a rebound.\n\nIn 2000 more than 21,000 new homes and 26,000 resale homes were purchased. In early 2005 there were 20 residential development projects of more than each underway. During that same period, Las Vegas was regarded as the fastest-growing community in the United States.\n\nOther promising residential and office developments have begun construction around Downtown Las Vegas. New condominium and high-rise hotel projects have changed the Las Vegas skyline dramatically in recent years. Many large high-rise projects are planned for Downtown Las Vegas, as well as the Las Vegas Strip.\nConstruction in Las Vegas is a major industry and quickly growing with the population. In March 2011, construction employed 40,700 people and is expected to grow with the recovering economy. Since the mega resorts that have defined Las Vegas today, began going up in the early 1970s, construction has played a vital role in both commercial and non commercial developments. Cranes are a constant part of the Las Vegas Skyline. At any given time there are 300 new homes being constructed in Las Vegas. Downtown and The Strip always have at least one hospitality project under construction. In addition, in recent years Las Vegas has seen a spike in high-rise housing units. Luxurious condos and penthouse suites are always being built. New suburban master planned communities are also becoming common in Las Vegas ever since The Howard Hughes Corporation began work on Summerlin, an upper-class community on the west side of the valley.\n\nThe massive project CityCenter broke ground on June 26, 2006. Now completed at 3780 Las Vegas Boulevard South, it is the largest privately funded building complex in the world. At a cost of $9.2 billion, CityCenter was one of the largest projects in Vegas history. It put a massive strain on the construction ability and workforce of the area due to number of laborers and amount of materials required. Because of this, prices of almost any construction project in Las Vegas doubled. It is currently held by MGM Resorts International and has three hotels, two condo towers, and a hotel-condo building along with a large shopping and entertainment center.\n\nTraditionally, housing consisted primarily of single-family detached homes. Slab-on-grade foundations are the common base for residential buildings in the valley. Apartments generally were two story buildings. Until the 1990s, there were exceptions, but they were few and far between. In the 1990s, Turnberry Associates constructed the first high rise condominium towers. Prior to this, there were only a handful of mid-rise multi-family buildings. By the mid-2000s, there was a major move into high rise condominiums towers, which affected the region's skyline around the Strip.\n\nThe Las Vegas Valley is home to various suburban master planned communities that include extensive recreational amenities such as lakes, golf courses, parks, bike paths and jogging trails. Planned communities in the valley include Aliante, Anthem, Centennial Hills, Green Valley, Inspirada, The Lakes, Mountain's Edge, Peccole Ranch, Silverado Ranch, Seven Hills, Southern Highlands, and Summerlin.\n\nSome technology companies have either relocated to Las Vegas or were created there. For various reasons, Las Vegas has had a high concentration of technology companies in electronic gaming and telecommunications industries.\n\nSome current technology companies in southern Nevada include: Bigelow Aerospace, Petroglyph, Switch Communications, US Support LLC, and Zappos.\n\nIn 2015, Electric vehicle startup Faraday Future has chosen North Las Vegas's Apex Industrial Park for its $1 billion car factory.\n\nCompanies that originally were formed in the Las Vegas region, but have since sold or relocated include Westwood Studios (sold to Electronic Arts), Systems Research & Development (Sold to IBM), Yellowpages.com (Sold to BellSouth and SBC), and MPower Communications.\n\nThe major attractions in the Las Vegas Valley are the hotel/casinos. These hotels generally consist of large gambling areas, theaters for live performances, shopping, bars/clubs, and several restaurants and cafes. There are clusters of large hotel/casinos located in both downtown Las Vegas and on the Las Vegas Strip. The largest hotels are mainly located on the Strip, which is a four-mile section of Las Vegas Boulevard. These hotels provide thousands of rooms of various sizes. Fifteen of the world's 25 largest hotels by room count are on the Strip, with a total of over 62,000 rooms. There are many hotel/casinos in the city's downtown area as well, which was the original focal point of the Valley's gaming industry. Several hotel/casinos ranging from large to small are also located around the city and metro area. Many of the largest hotel, casino, and resort properties in the world are located on the Las Vegas Strip.\n\nThe valley's casinos can be grouped into several locations. The largest is the Las Vegas Strip, followed by Downtown Las Vegas, and then the smaller Boulder Strip. There are also several one-off single standing hotel/casinos dotted around the valley and the metro area.\n\nLas Vegas has expanded its attractiveness to visitors by offering both affordable and high-end merchandise in many shops and shopping malls. Many hotels on the Las Vegas Strip also have adjacent shopping malls, giving the Las Vegas area the highest concentration of shopping malls in any four mile stretch of road. In addition to the malls on the Strip, there are several outlying malls in the City of Las Vegas, Henderson, and the surrounding area. The monorail, lying somewhat east of the Strip, facilitates north–south travel, including stations at several casinos and the Las Vegas Convention Center.\n\nLas Vegas holds many of the world's largest conventions each year, including CES, SEMA, and Conexpo. The Las Vegas Convention Center is one of the largest in the world with 1,940,631 sq ft (180,290.5 m) of exhibit space. These events bring in an estimated $7.4 billion of revenue to the city each year, and host over 5 million attendees.\n\n\nThe \"First Friday\" celebration, held on the first Friday of each month, exhibits the works of local artists and musicians in an area just south of downtown. The city is home to an extensive Downtown Arts District which hosts numerous galleries, film festivals, and events.\n\nThe Southern Nevada Zoological-Botanical Park, also known as the Las Vegas Zoo, exhibits over 150 species of animals and plants. The Zoo closed its doors in September, 2013.\n\nThe Shark Reef Aquarium at Mandalay Bay is the only aquarium that is accredited by the Association of Zoos and Aquariums in the state of Nevada. It features over 2,000 animals and 1,200 species in 1.6 million gallons of seawater.\n\nThe $485 million Smith Center for the Performing Arts is located downtown in Symphony Park. The center is appropriate for Broadway shows and other major touring attractions as well as orchestral, opera, choir, jazz, and dance performances.\n\nBellagio Gallery of Fine Art is a facility presenting high-quality art exhibitions from major national and international museums. Past exhibits have included the works of Andy Warhol, Alexander Calder, and Peter Carl Fabergé. A self-guided audio tour is also offered.\n\nThe Las Vegas Natural History Museum features robot dinosaurs, live fish, and more than 26 species of preserved animals. There are several \"hands-on\" areas where animals can be petted.\n\nThe Atomic Testing Museum, affiliated with the Smithsonian Institution, houses artifacts from the Nevada Test Site and records the dramatic history of the atomic age through a series of interactive modules, timelines, films, and actual equipment and gadgets from the site.\n\nThe valley is home to numerous other art galleries, orchestras, ballets, theaters, sculptures, and museums as well.\n\n\n\n\n\nLas Vegas is served by 22 television and 46 radio stations. The area is also served by two NOAA Weather Radio transmitters (162.55 MHz located in Boulder City and 162.40 MHz located on Mount Potosi).\n\n\n\nMcCarran International Airport (LAS) provides commercial flights into the Las Vegas Valley. The airport serves domestic, international, and cargo flights, as well as some private aircraft. General aviation traffic, however, will typically use the much smaller North Las Vegas Airport, or other airfields in the county.\nPublic transportation is provided by RTC Transit. Numerous bus routes cover Las Vegas, Henderson, North Las Vegas, and other suburban areas.\n\nThe Las Vegas Monorail runs from the MGM Grand Hotel at the south end of the Strip to the SLS Las Vegas at the north end of the Strip.\nThe street numbering system is divided by the following streets:\n\nUntil 1997, the Amtrak Desert Wind train service ran through Las Vegas using the Union Pacific Railroad (UP) rails that run through the city; Amtrak service to Las Vegas has since been replaced by Amtrak's Thruway Motorcoach bus service. Plans to restore Los Angeles to Las Vegas Amtrak service using a Talgo train have been discussed but no plan for a replacement has been implemented. The Las Vegas Amtrak station was located in the Plaza Hotel. It had the distinction of being the only train station located in a casino.\n\nTwo major freeways—Interstate 15 and Interstate 515/U.S. Route 95—cross in downtown Las Vegas. I-15 connects Las Vegas to the Southern California coastal urban centers of Los Angeles and San Diego, and heads northeast to and beyond Salt Lake City, Utah. I-515 goes southeast to Henderson, beyond which US 93 continues south of Hoover Dam over the new Mike O'Callaghan – Pat Tillman Memorial Bridge towards Phoenix, Arizona and the Arizona Sun Corridor. US 95 connects the city to northwestern Nevada, including Carson City and Reno. US 93 splits from I-15 northeast of Las Vegas and goes north through the eastern part of the state, serving Ely and Wells, and US 95 heads south from US 93 near Henderson through far eastern California. A three-quarters beltway has been built, consisting of Interstate 215 on the south and Clark County 215 on the west and north. Other radial routes include Blue Diamond Road (SR 160) to Pahrump and Lake Mead Boulevard (SR 147) to Lake Mead.\n\nWith the notable exceptions of Las Vegas Boulevard, Boulder Highway (SR 582), and Rancho Drive (SR 599), the majority of surface streets outside downtown Las Vegas are laid out along Public Land Survey System section lines. Many are maintained by the Nevada Department of Transportation as state highways.\n\n\nWhile the Las Vegas area does not have any passenger rail service, proposals to revive passenger trains to Las Vegas have included the Desert Xpress high-speed train from Victorville, California; the California-Nevada Interstate Maglev, which would extend to Anaheim, California, with its first segment being to Primm, Nevada. The Las Vegas Railway Express; and the Z-Train, which would travel six days a week between Los Angeles Union Station and a new Z-Train Station adjacent to the Strip; and the Desert Lightning to Los Angeles and Phoenix.\nLas Vegas receives about 30 freight trains per day in 2004, and serves as a district crew change point, requiring all trains to stop in downtown. Freight traffic was 179,284 cars in 2004.\n\n\nTwo major freeways—Interstate 15 and U.S. Route 95—cross in downtown Las Vegas. I-15 connects Las Vegas to Los Angeles and San Diego, and heads northeast to and beyond Salt Lake City. Interstate 515 goes southeast to Henderson, beyond which U.S. Route 93 continues past the Hoover Dam towards Phoenix, Arizona. US 95 connects the city to northwestern Nevada, including Carson City and Reno. US 93 splits from I-15 northeast of Las Vegas and goes north through the eastern part of the state, serving Ely and Wells, and US 95 heads south from US 93 near Henderson through far eastern California. A three-quarters beltway has been built, consisting of Interstate 215 on the south and Clark County 215 on the west and north. Other radial routes include SR 160 to Pahrump and SR 147 to Lake Mead.\n\nWith the notable exceptions of Las Vegas Boulevard, Boulder Highway, and Tonopah Highway (better known as the northern part of Rancho Drive), the majority of surface streets outside downtown Las Vegas are laid out along Public Land Survey System section lines. Many are maintained, in part, by the Nevada Department of Transportation as state highways.\n\n\n\nThe Las Vegas area is dependent on imported gasoline, diesel, and aviation fuel as is most of Nevada, which has only one refinery. The region is dependent on the Calnev Pipeline as its single supply. Limited diesel is delivered to a dedicated terminal in North Las Vegas by rail. Diversified supply is dependent on the planned UNEV pipeline.\n\nAbout 25% of the electric power from Hoover Dam goes to Nevada, and about 70% of power to Southern Nevada comes from natural gas fired power stations.\n\nLas Vegas is home to several notable minor league teams, as well as the UNLV Runnin' Rebels, and one major professional team, the Vegas Golden Knights of the NHL. The Las Vegas Raiders of the NFL will play in Las Vegas in 2019 or 2020.\n\nNote: The Raiders will move to Las Vegas in 2019 or 2020; the Raiders franchise dates back to 1960 when it began in Oakland, and also played in Los Angeles between 1982 and 1994.\n\nLas Vegas has many natural outdoor recreational options.\n\nThere are several multi-use trail systems within the valley operated by multiple organizations. The River Mountains Loop Trail is a trail that connects the west side of the valley with Hoover Dam and Lake Mead. Summerlin offers more than 150 miles of award-winning trails within the community. There are also the Angel Park Trail, Bonanza Trail, and the county's Flamingo Arroyo Trail, I-215 West Beltway Trail (), I-215 East Beltway Trail (), Tropicana/Flamingo Washes Trail and the Western Trails Park Area Equestrian Trails (4 miles).\n\nThe Las Vegas Valley also hosts world class mountain biking including Bootleg Canyon Mountain Bike Park located in Boulder City which boasts itself as one of the International Mountain Biking Association's \"epic rides\".\n\nThe Clark County School District operates all of the public primary and secondary schools in the county with the exception of a few which are contracted out to a private organization.\n\nThe University of Nevada, Las Vegas (UNLV) is in Paradise, about three miles (5 km) south of the city limits and roughly two miles east of the Strip. The University of Nevada Medical School has a campus near downtown Las Vegas. Several national colleges, including the University of Phoenix and Le Cordon Bleu, have campuses in the Las Vegas area. Nevada State College, National University and Touro University Nevada are nearby Henderson. The College of Southern Nevada has campuses in Las Vegas, North Las Vegas and Henderson. Henderson also is home to DeVry University and the Keller Graduate School of Management, as well as the University of Southern Nevada. Other private entities in the Las Vegas Valley include Apollo College and ITT Technical Institute.\n\n\n\n\n\n",
                "History of Las Vegas\n\nThis history of Las Vegas covers both the city of Las Vegas, Nevada, and the Las Vegas Valley.\nThe name Las Vegas was given to the area in 1821 by Rafael Rivera, a member of the Antonio Armijo trading party that was traveling to Los Angeles, and stopped for water there on the Old Spanish Trail from New Mexico. At that time, several parts of the valley contained artesian wells surrounded by extensive green areas; \"Las Vegas\" means the meadows in Spanish. The flows from the wells fed the Las Vegas Wash, which runs to the Colorado River.\n\nThe prehistoric landscape of the Las Vegas Valley and most of Southern Nevada was once a marsh with water and vegetation. The rivers that created the marsh eventually went underground, and the marsh receded. The valley then evolved into a parched, arid landscape that only supported the hardiest animals and plants.\n\nAt some point in the valley's early geologic history, the water resurfaced and flowed into what is now the Colorado River. This created a luxurious plant life, forming a wetland oasis in the Mojave Desert landscape.\n\nEvidence of prehistoric life in Las Vegas Valley was found in 1993, when a group of construction workers discovered the remains of a Columbian mammoth. Palaeontologists estimate that the mammoth roamed the area some 8,000 to 15,000 years ago.\n\nNative Americans lived in the Las Vegas Valley, beginning over 10,000 years ago. Archaeologists have discovered baskets, petroglyphs, pictographs and other evidence in diverse locations, including Gypsum Cave and Tule Springs. Paiutes moved into the area as early as AD 700, migrating between nearby mountains in the summer and spending winter in the valley, near Big Springs.\n\nA trade caravan of 60 men led by the Mexican merchant Antonio Armijo was charged with establishing a trade route to Los Angeles. Las Vegas was named by Mexicans in the Antonio Armijo party. By following the Pike and Smith routes through a tributary of Colorado River they came upon the Las Vegas Valley, described by Smith as the best point to re-supply before going onto California. The travelers named the area \"Las Vegas\" which is Spanish for \"The Meadows\".\n\nJohn C. Frémont traveled into the Las Vegas Valley on May 3, 1844, while it was still part of Mexico. He was appointed by President John Tyler to lead a group of scientists, scouts, and spies for the United States Army Corps of Engineers who were preparing for a possible war with Mexico. Upon arriving in the valley they made camp at the Las Vegas Springs, establishing a clandestine fort there. A war with Mexico did occur, resulting in the region becoming United States territory. The fort was used in later years by travellers, mountain men, hunters, and traders seeking shelter, but was never permanently inhabited.\n\nIn 1855, William Bringhurst led a group of 29 Mormon missionaries from Utah to the Las Vegas Valley. The missionaries built a adobe fort near a creek and used flood irrigation to water their crops, a process still used at the park. However, because of tensions rising between leaders of the small Mormon community, the summer heat and difficulty growing crops, the missionaries returned to Utah in 1857, abandoning the fort.\n\nFor the next few years the area remained unoccupied by Americans except for travelers and traders. Then the U.S. Army, in an attempt to deceive Confederate spies active in southern California in 1864, falsely publicized that it reclaimed the fort and had renamed it Fort Baker, briefly recalling the area to national attention. After the end of the war in 1865, Octavius Gass, with a commission from the federal government, re-occupied the fort. The Paiute nation had declined in numbers and negotiated a new treaty with the United States, ceding the area around the fort to the United States in return for relocation and supplies of food and farming equipment. Consequently, Gass started irrigating the old fields and renamed the area 'Las Vegas Rancho.' Gass made wine at his ranch and Las Vegas became known as the best stop on the Old Spanish Trail. In 1881, because of mismanagement and intrigue with a Mormon syndicate, Gass lost his ranch to Archibald Stewart to pay off a lien Stewart had on the property. In 1884, Archibald's wife, Helen J. Stewart became the Las Vegas Postmaster.\n\nThe property (increased to ), stayed with the family (despite Archibald Stewart's murder in July 1884) until it was purchased in 1902 by the San Pedro, Los Angeles, and Salt Lake Railroad, then being built across southern Nevada. The railroad was a project of Montana Senator William Andrews Clark. Clark enlisted Utah's U.S. Senator and mining magnate Thomas Kearns to ensure the line's completion through Utah to Las Vegas. The State Land Act of 1885 offered land at $1.25 per acre ($3.09/hectare). Clark and Kearns promoted the area to American farmers who quickly expanded the farming plots of the areas. Not until 1895 did the first large-scale migration of Mormons begin in the area, at long last fulfilling Brigham Young's early dream. Through wells and arid irrigation, agriculture became the primary industry for the next 20 years and in return for his development, the farmers named the area Clark County in honor of the railroad tycoon and Senator.\n\nBy the early 20th century, wells piped water into the town, providing both a reliable source of fresh water and the means for additional growth. The increased availability of water in the area allowed Las Vegas to become a water stop, first for wagon trains and later railroads, on the trail between Los Angeles, California, and points east such as Albuquerque, New Mexico.\n\nThe San Pedro, Los Angeles & Salt Lake Railroad was completed in 1905, linking Salt Lake City to southern California. U.S. Senator William Andrews Clark was the majority owner of the railroad, which was a corporation based in Utah. Among its original incorporators were Utah's U.S. Senator Thomas Kearns and his business partner David Keith. Kearns, one of the richest and most powerful men in Utah, and Keith were the owners of Utah's Silver King Coalition Mine, several mines in Nevada and \"The Salt Lake Tribune\" newspaper. Kearns and Keith helped Clark ensure the success of the new railroad across Utah and into Nevada to California. Curiously, for a time there were two towns named Las Vegas. The east-side of Las Vegas (which encompassed the modern Main Street and Las Vegas Boulevard) was owned by Clark, and the west-side Las Vegas (which encompassed the area north of modern-day Bonanza Road) was owned by J.T. McWilliams, who was hired by the Stewart family during the sale of the Las Vegas Rancho and bought available land west of the ranch. It was from their property that Las Vegas took form.\n\nClark subsequently built another railroad branching off from Las Vegas to the boomtown of Bullfrog called the Las Vegas and Tonopah Railroad. With the revenue coming down both railways that intersected there, the area of Las Vegas was quickly growing. On May 15, 1905, Las Vegas officially was founded as a city, when , in what would later become downtown, were auctioned to ready buyers. Las Vegas was the driving force in the creation of Clark County, Nevada in 1909 and the city was incorporated in 1911 as a part of the county. The first mayor of Las Vegas was Peter Buol who served from 1911-1913.\n\nShortly after the city's incorporation, the State of Nevada reluctantly became the last western state to outlaw gaming. This occurred at midnight, October 1, 1910, when a strict anti-gambling law became effective in Nevada. It even forbade the western custom of flipping a coin for the price of a drink. Nonetheless, Las Vegas had a diversified economy and a stable and prosperous business community, and therefore continued to grow until 1917. In that year, a combination of economic influences and the redirection of resources by the federal government in support of the war effort forced the Las Vegas and Tonopah Railroad to declare bankruptcy. Although William Clark sold the remains of the company to the Union Pacific Railroad, a nationwide strike in 1922 left Las Vegas in a desperate state.\n\nOn July 3, 1930, President Herbert Hoover signed the appropriation bill for the Boulder Dam. The dam was later renamed the Hoover Dam during the Truman administration. Work started on the dam in 1931 and Las Vegas' population swelled from around 5,000 citizens to 25,000, with most of the newcomers looking for a job building the dam. However, the demographic of the work force consisting of males from across the country with no attachment to the area created a market for large scale entertainment. A combination of local Las Vegas business owners, and Mafia crime lords helped develop the casinos and showgirl theaters to entertain the largely male dam construction workers.\n\nDespite the influx of known crime figures, the local business community tried to cast Las Vegas in a respectable light when the Secretary of the Interior Ray Lyman Wilbur visited in 1929 to inspect the dam site. However a subordinate was found with alcohol on his breath (this was during the time of Prohibition) after a visit to Block 16 in Las Vegas. The government ultimately decided that a federal-controlled town, Boulder City, would be erected for the dam workers.\n\nRealizing that gambling would be profitable for local business, the Nevada state legislature legalized gambling at the local level in 1931. Las Vegas, with a small but already well-established illegal gambling industry, was poised to begin its rise as the gaming capital of the world. \nThe county issued the first gambling license in 1931 to the Northern Club, and soon other casinos were licensed on Fremont Street like the Las Vegas Club and the Apache Hotel. Fremont Street became the first paved street in Las Vegas and received the city's first traffic light in 1931.\n\nIn reply, the federal government restricted movement of the dam workers to Las Vegas. Smuggling and circuitous routes then were developed. In 1934, to curtail these activities and the resulting growth of criminal figures in the gambling industry, the city's leading figures purged gambling dens and started an effort to stem the flow of workers from the dam. This only emboldened some dam workers who still contrived to visit Las Vegas. A celebration of this era has become known as Helldorado Days.\n\nAlthough the suppression efforts resulted in declines at gambling venues and resulted in a business downturn, the city was recharged — both literally and figuratively — when the dam was completed in 1935. In 1937, Southern Nevada Power became the first utility to supply power from the dam, and Las Vegas was its first customer. Electricity flowed into Las Vegas and Fremont Street became known as Glitter Gulch due to the many bright lights powered by electricity from Hoover Dam. Meanwhile, although the dam worker population disappeared, Hoover Dam and its reservoir, Lake Mead, turned into tourist attractions on their own and the need for additional higher class hotels became clear.\n\nIn 1940, U.S. Route 95 was finally extended south into Las Vegas, giving the city two major access roads. Also in 1940 Las Vegas's first permanent radio station, KENO, began broadcasting replacing the niche occupied earlier by transient broadcasters.\n\nOn January 25, 1941 the U.S. Army established a flexible gunnery school for the United States Army Air Corps in Las Vegas. Mayor John L. Russell signed over land to the U.S. Army Quartermaster Corps for this development. The gunnery school later would become Nellis Air Force Base. The U.S. Army was not pleased with the legal prostitution in Las Vegas and in 1942 forced Las Vegas to outlaw the practice, putting Block 16, the local red light district permanently out of business.\n\nOn April 3, 1941, hotel owner Thomas Hull opened the El Rancho Vegas. It was the first resort on what would become the Las Vegas Strip. The hotel gained much of its fame from the gourmet buffet that it offered.\n\nOn October 30, 1942, R. E. Griffith rebuilt on the site of a nightclub called Pair-O-Dice, that first opened in 1930, and renamed it Hotel Last Frontier. A few more resorts were built on and around Fremont Street but the next hotel on the Strip publicly demonstrated the influence of organized crime on Las Vegas. Although ethnic organized crime figures had been involved in some of the operations at the hotels, the Mafia bosses never owned or controlled the hotels and clubs which remained monopolized by hard-bitten local Las Vegas families who were unwilling to cede ground to the crime bosses and proved strong enough to push back. This changed in post-war Las Vegas when Jewish gangster Bugsy Siegel, with help from friend and fellow mob boss Meyer Lansky, poured money through Mormon-owned banks for cover of legitimacy and built The Flamingo in 1946.\n\nThe Flamingo initially lost money and Siegel died in a hail of gunfire in Beverly Hills, California in the summer of 1947. Additionally, local police and Clark County Sheriff deputies were notorious for their heavy-handed tactics toward mobsters who \"grew too big for their pants.\" However, many mobsters saw the potential that gambling offered in Las Vegas. From 1952 to 1957, through money and institutional lending provided by the Teamsters Union and some Mormon bankers they built the Sahara, the Sands, the New Frontier, the Royal Nevada, the Showboat, The Riviera, The Fremont, Binion's Horseshoe (which was the Apache Hotel), and finally The Tropicana.\n\nOwned and operated by a joint combination of Mormon elders who provided political and business legitimacy and people involved with organized crime who provided unreported income and street muscle, such as Meyer Lansky, these crime hotels became regarded as the epitome of gambling entertainment. Even with the general knowledge that some of the owners of these casino resorts had dubious backgrounds, by 1954, over 8 million people were visiting Las Vegas yearly pumping $200 million into casinos. Gambling was no longer the only attraction; the biggest stars of films and music like Frank Sinatra, Dean Martin, Andy Williams, Liberace, Bing Crosby, Carol Channing, and others performed in intimate settings. After coming to see these stars, the tourists would resume gambling, and then eat at the gourmet buffets that have become a staple of the casino industry.\n\nHowever, the confluence of various marginal and/or suspected groups such as Jews, Sicilians, and Mormons into the gambling enterprises in Las Vegas and the subsequent cornering of the gambling market in the city by these groups sparked a two-year investigation by Senator Estes Kefauver and his Senate Special Committee to Investigate Crime in Interstate Commerce in 1950–51. The hearing concluded that organized crime money was incontrovertibly tied to the Las Vegas casinos and was becoming the controlling interest in the city thereby earning for the groups vast amounts of income which was strengthening their influence in the country. This led to a proposal by the Senate to institute federal gambling control. Only through the power and influence of Nevada's Senator Pat McCarran did the proposal die in committee.\n\nAlong with their connections in Hollywood and New York City, these interests in Las Vegas were able to use publicity provided by these media capitals to steer the rapid growth of tourism into Las Vegas thereby dooming Galveston, Texas; Hot Springs, Arkansas; and other illegal gaming centers around the nation. Nevada's legal gaming as well as the paradoxical increased scrutiny by local and federal law enforcement in these other locales during the 1950s made their demise inevitable.\n\nWhile the Strip was booming, the U.S. Atomic Energy Commission on January 27, 1951 detonated the first of over a hundred atmospheric explosions at the Nevada Test Site. These atmospheric tests would continue until enactment of the Partial Test Ban Treaty in 1963 when the tests moved underground. The last test explosion was in 1992. Despite the dangers and risks, greatly underestimated at the time, of radiation exposure from the fallout, Las Vegas advertised the explosions as another tourist attraction and offered \"Atomic Cocktails\" in \"Sky Rooms\" that offered a great view of the mushroom clouds.\n\nThe influx of government employees for the Atomic Energy Commission and from the Mormon-controlled Bank of Las Vegas spearheaded by E. Parry Thomas during those years funded the growing boom in casinos. But Las Vegas was doing more than growing casinos. In 1948, McCarran Field was established for commercial air traffic. In 1957 the University of Nevada, Las Vegas was first established, initially as a branch of the University of Nevada, Reno and becoming independent in 1969. In 1959 the Clark County Commission built the Las Vegas Convention Center, which would become a vital part of the area's economy. A new utility company, Southwest Gas expanded into Las Vegas in 1954.\n\nIn 1966, Howard Hughes, the eccentric hero of the American aviation industry, and noted American entrepreneurial financier with vast connections to long established networks in the country, moved to Las Vegas. Initially staying in the Desert Inn, he refused to vacate his room and instead decided to purchase the entire hotel. Hughes extended his financial empire to include Las Vegas real estate, hotels and media outlets, spending an estimated $300 million and using his considerable powers to take over many of the well known hotels, especially the organized crime connected venues and he quickly became one of the most powerful men in Las Vegas. He was instrumental in changing the image of Las Vegas from its Wild West roots into a more refined cosmopolitan city.\n\nThe local newspaper \"Las Vegas Sun\" and its editor Hank Greenspun led a crusade in those days to expose all the criminal ties, activities, and government corruption in Las Vegas. His investigative reporting and editorials led to the exposure of Clark County Sheriff Glen Jones' ownership of a brothel and the resignation of Lieutenant Governor Clifford A. Jones as the state's national committeeman for the Democratic Party. Before his death in 1989, Hank Greenspun founded The Greenspun Corporation to manage his family's assets, and it remains a major influence in Las Vegas, with media holdings in print, television and the Internet; substantial real estate holdings; and ownership stakes in a number of casinos.\n\nOne problem for the City of Las Vegas was that the Strip did not reside in Las Vegas . Because of this, the city lost tax revenue. There was a push to annex the Strip by the City of Las Vegas, but The Syndicate used the Clark County Commissioners to pull a legal maneuver by organizing the Las Vegas Strip properties into an unincorporated township called Paradise. Under Nevada Law, an incorporated town, Las Vegas, cannot annex an unincorporated township. To this day, virtually all of the Strip remains outside the City of Las Vegas.\n\nMuch like in other American settled counties and towns throughout the United States, entertainment venues were segregated between black- and white-owned businesses. With almost all of the businesses owned and operated by whites, Black Americans were barred from entering the venues which remained focused, regardless of their legitimacy or criminality, on entertaining a white-only clientele. As a result of property deeds, businesses owned by or mainly serving non-whites were confined to clubs on the \"west side\" of the tracks. This also was enforced in many of the work positions. Thus, African Americans (except those who provided the labor for low-paying menial positions or entertainment) and Hispanics were limited in employment occupations at the white-owned clubs. However, because of employment deals with black worker groups, many clubs favored black workers, and the Hispanic population actually decreased ninety percent from 2,275 to just 236 by the mid-1950s.\n\nOrganized crime-owned businesses saw an opportunity in not dividing their clientele by race and, despite property deeds and city and county codes barring such activities, made several attempts at desegregating their businesses in the hopes of putting out of operation the non-white owned clubs and expanding their own market share. An attempt was made at forming an all-integrated night-club modeled on the Harlem Clubs of New York City during the 1920s and 1930s, like those owned by German-Jewish gangster Dutch Schultz. On May 24, 1955, Jewish crime boss Will Max Schwartz, along with other investors, opened the Moulin Rouge. It was a very upscale and racially integrated casino that actually competed against the resorts on the Strip, especially the non-white owned strips on the west side. By the end of the year, the casino closed as Schwartz and his partners had a falling out, but the seeds for racial integration were sown.\n\nMany sources have credited Frank Sinatra and the Rat Pack as a significant driving force behind desegregation in the casinos. One famous story tells of Sinatra's refusal to perform at the Sands Hotel unless the hotel provided Sammy Davis Jr. with a room. The famed performing group made similar demands at other venues, forcing owners to amend their policies over time.\n\nHowever, it took political action, most often supported by Jewish crime groups, for racial desegregation to occur. In 1960, the NAACP threatened a protest of the city's casinos for their policies. A meeting between the NAACP, the mayor and local businessmen resulted in citywide casino desegregation, starting with the employees. Many whites were attritioned from positions and their jobs given to the black unions. Along with the rest of the country, Las Vegas experienced the struggle for civil rights. Activists like James B. McMillan, Grant Sawyer, Bob Bailey, and Charles Keller dragged Las Vegas to racial integration.\n\nAside from seeing no business advantage to excluding non-white customers from casinos and clubs, the organized crime groups themselves were composed of people of ethnicities (Jewish and Italian) that faced discrimination from WASP America and thus could understand the plight of blacks. This was also a driving force behind the integration advocated by ethnic performers such as Sinatra and Martin.\n\nAnother big force for equality was Mayor Oran Gragson. Spurred into local politics by a vigilante ring of cops who repeatedly broke into his appliance store, he implemented infrastructure improvements for the minority neighborhoods in Las Vegas, backed the NAACP in its actions, and promoted black workers for jobs. He also championed the cause of the Paiute tribe that owned a small portion of Las Vegas. Gragson stopped the U.S. government from evicting the tribe and actually made infrastructure improvements for them. His work helped reverse the decrease of minority populations in Las Vegas.\n\nLocal legislation kept up with the national legislation and integration was finally established. The only real violence came as a result of school integration, with violent riots and fights occurring in Clark High School when black gangs and youths began attacking the whites. Integration sparked white flight from the school district from 1965 to 1971. That school was then later destroyed.\n\nOn a percentage basis, Las Vegas and Clark County experienced incredibly high growth rates starting in the 1930s and lasting until the late 2000s recession. During that period, the population of the city more than doubled in most decades. The rate slowed down in the 1970s with the decrease of the white birth rate, but never dropped below 60% (1980–1990), and even accelerated after 1990 due to immigration. By 2000, Las Vegas was the largest city founded in the 20th century, and by 2006 it was the 28th largest city in the US, with a population of 552,000 in the city and nearly 1.8 million in Clark County. The explosive growth resulted in rapid development of commercial and residential areas throughout the Las Vegas Valley. The strong boom in the resort business led to many new condominium developments all along the Strip and downtown area. Also urban sprawl development of single-family homes continued across the valley, building the areas of Henderson, North Las Vegas, Centennial Hills, and Summerlin. The rapid development and population growth both halted abruptly in the late 2000s recession.\n\nDuring this period of time, American author and journalist Hunter S. Thompson wrote and published his seminal novel, \"Fear and Loathing in Las Vegas\", detailing the experience of his 1971 trip to the city.\n\nOn November 21, 1980 the MGM Grand Hotel and Casino, suffered a devastating fire. A total of 85 people died and 785 were injured in what remains the worst disaster in Nevada history. The property was eventually sold and reopened as Bally's Las Vegas, while MGM moved south to Tropicana Avenue.\n\nThe \"Mafia/Rat Pack\" Las Vegas of the mid-20th century came to a gradual end in the 1980s with the aging out of the World War II generation, the decline of organized crime elements, and the rise of baby boomer entrepreneurs who began a new chapter in the city's history, the so-called megaresort era. Las Vegas began to become a more commercialized, family-oriented place with large corporations coming to own the hotels, casinos, and nightclubs in place of Mafia bosses. The megaresort era kicked off in 1989 with the construction of The Mirage. Built by developer Steve Wynn, it was the first resort built with money from Wall Street, selling $630 million in junk bonds. Its 3,044 rooms, each with gold tinted windows, set a new standard for Vegas luxury and attracted tourists in droves, leading to additional financing and rapid growth on the Las Vegas Strip. More landmark hotels and other structures were razed to make way for ever-larger and more opulent resorts including:\n\n\nThe Helldorado Days festival was resumed in 2005 for the City of Las Vegas' centennial celebration.\n\nThe home mortgage crisis (2007-2010) and the late 2000s recession affected Las Vegas' economic success. New home construction was stalled, and construction projects were either canceled, postponed, or continued with financial troubles. Some of these projects included the MGM Mirage property of CityCenter, Fontainebleau, Echelon, and The Plaza. The global financial situation also had a negative effect on gaming and tourism revenue, causing many of the companies to report net loss. \n\nNevertheless, new landmark hotels and resorts were still to arise, including:\nStarting in 2013, the sector began to turn around with the proposal of the Resorts World projects replacing the Echelon currently under construction. The Alon resort is planned to resume the site formerly the Frontier and originally planned for the Plaza. Fontainbleau is currently being on the process of being sold and resumed. Wynn Resorts is also planning an additional tower with a central lake planned for 2020 and a new stadium opened near the New York New York hotel on 2016.\n\nLas Vegas has still managed to host many conventions and major events, such as the annual Latin Grammy Awards, & the Consumer Electronics Show.\n\nMany analysts agree that the Las Vegas economy is recovering, with improving conditions in tourism and the housing market for 2013. Prices are rising and there has been a large increase in the million dollar home market, with many new custom homes being built. January 2013 marks the 19th consecutive month with home sales higher than the same month in the previous year. In addition, Las Vegas was named America's Top Turn Around Market for 2012 by Trulia.\n\nIn June 2017, a heat wave grounded more than 40 airline flights of small aircraft were grounded, with American Airlines reducing sales on certain flights to prevent the vehicles from being over the maximum weight permitted for safe takeoff and Las Vegas tying its record high at 117 degrees Fahrenheit.\n\nDuring the late evening of October 1, 2017, Las Vegas became the scene of the deadliest mass shooting committed by a single gunman in the history of the United States. A gunman opened fire on Route 91 Harvest festival-goers from the Mandalay Bay resort, killing 58 and injuring 546.\n\n\n",
                "Las Vegas\n\nLas Vegas (, Spanish for \"The Meadows\"), officially the City of Las Vegas and often known simply as Vegas, is the 28th-most populated city in the United States, the most populated city in the state of Nevada, and the county seat of Clark County. The city anchors the Las Vegas Valley metropolitan area and is the largest city within the greater Mojave Desert. Las Vegas is an internationally renowned major resort city, known primarily for its gambling, shopping, fine dining, entertainment, and nightlife. The Las Vegas Valley as a whole serves as the leading financial, commercial, and cultural center for Nevada.\n\nThe city bills itself as The Entertainment Capital of the World, and is famous for its mega casino–hotels and associated activities. It is a top three destination in the United States for business conventions and a global leader in the hospitality industry, claiming more AAA Five Diamond hotels than any other city in the world. Today, Las Vegas annually ranks as one of the world's most visited tourist destinations. The city's tolerance for numerous forms of adult entertainment earned it the title of Sin City, and has made Las Vegas a popular setting for literature, films, television programs, and music videos.\n\nLas Vegas was settled in 1905 and officially incorporated in 1911. At the close of the 20th century, it was the most populated American city founded within that century (a similar distinction earned by Chicago in the 1800s). Population growth has accelerated since the 1960s, and between 1990 and 2000 the population nearly doubled, increasing by 85.2%. Rapid growth has continued into the 21st century, and according to a 2013 estimate, the population is 603,488 with a regional population of 2,027,828.\n\n\"Las Vegas\" is often used to describe areas beyond official city limits—especially the areas on and near the Las Vegas Strip, which is actually located within the unincorporated communities of Paradise, Winchester, and Enterprise.\n\nPerhaps the earliest visitors to the Las Vegas area were nomadic Paleo-Indians, who traveled there 10,000 years ago, leaving behind petroglyphs. Anasazi and Paiute tribes followed at least 2,000 years ago.\n\nA young Mexican scout named Rafael Rivera is credited as the first non-Native American to encounter the valley, in 1829. Trader Antonio Armijo led a 60-man party along the Spanish Trail to Los Angeles, California in 1829. The area was named Las Vegas, which is Spanish for \"the meadows,\" as it featured abundant wild grasses, as well as the desert spring waters needed by westward travelers. The year 1844 marked the arrival of John C. Frémont, whose writings helped lure pioneers to the area. Downtown Las Vegas's Fremont Street is named after him.\n\nEleven years later members of the LDS Church chose Las Vegas as the site to build a fort halfway between Salt Lake City and Los Angeles, where they would travel to gather supplies. The fort was abandoned several years afterward. The remainder of this Old Mormon Fort can still be seen at the intersection of Las Vegas Boulevard and Washington Avenue.\n\nLas Vegas was founded as a city in 1905, when of land adjacent to the Union Pacific Railroad tracks were auctioned in what would become the downtown area. In 1911, Las Vegas was incorporated as a city.\n\n1931 was a pivotal year for Las Vegas. At that time, Nevada legalized casino gambling and reduced residency requirements for divorce to six weeks. This year also witnessed the beginning of construction on nearby Hoover Dam. The influx of construction workers and their families helped Las Vegas avoid economic calamity during the Great Depression. The construction work was completed in 1935.\n\nIn 1941, the Las Vegas Army Air Corps Gunnery School was established. Currently known as Nellis Air Force Base, it is home to the aerobatic team called the Thunderbirds.\n\nFollowing World War II, lavishly decorated hotels, gambling casinos, and big-name entertainment became synonymous with Las Vegas.\n\nIn the 1950s the Moulin Rouge opened and became the first racially integrated casino-hotel in Las Vegas.\n\nIn 1951, nuclear weapons testing began at the Nevada Test Site, northwest of Las Vegas. City residents and visitors were able to witness the mushroom clouds (and were exposed to the fallout) until 1963, when the limited Test Ban Treaty required that nuclear tests be moved underground.\n\nThe iconic \"Welcome to Las Vegas\" sign, which was never located in the city, was created in 1959 by Betty Willis.\n\nDuring the 1960s, corporations and business powerhouses such as Howard Hughes were building and buying hotel-casino properties. Gambling was referred to as \"gaming\" which transitioned into legitimate business.\n\nThe year 1995 marked the opening of the Fremont Street Experience in Las Vegas's downtown area. This canopied five-block area features 12.5 million LED lights and 550,000 watts of sound from dusk until midnight during shows held on the top of each hour.\n\nDue to the realization of many revitalization efforts, 2012 was dubbed \"The Year of Downtown.\" Hundreds of millions of dollars' worth of projects made their debut at this time. They included The Smith Center for the Performing Arts and DISCOVERY Children's Museum, Mob Museum, Neon Museum, a new City Hall complex and renovations for a new Zappos.com corporate headquarters in the old City Hall building.\n\nLas Vegas is situated within Clark County in a basin on the floor of the Mojave Desert and is surrounded by mountain ranges on all sides. Much of the landscape is rocky and arid with desert vegetation and wildlife. It can be subjected to torrential flash floods, although much has been done to mitigate the effects of flash floods through improved drainage systems.\n\nThe peaks surrounding Las Vegas reach elevations of over , and act as barriers to the strong flow of moisture from the surrounding area. The elevation is approximately above sea level. According to the United States Census Bureau, the city has a total area of , of which is land and (0.03%) is water.\n\nNevada is the third most seismically active state in the U.S. (after Alaska and California); it has been estimated by the United States Geological Survey (USGS) that over the next 50 years there is a 10–20% chance of a M6.0 or greater earthquake occurring within 50 km of Las Vegas.\n\nWithin the city there are many lawns, trees and other greenery. Due to water resource issues, there has been a movement to encourage xeriscapes. Another part of conservation efforts is scheduled watering days for residential landscaping. A U.S. Environmental Protection Agency grant in 2008 funded a program that analyzed and forecast growth and environmental impacts through the year 2019.\n\nLas Vegas has a subtropical hot desert climate (Köppen climate classification: BWh), typical of the Mojave Desert in which it lies. This climate is typified by long, very hot summers; warm transitional seasons; and short, mild to chilly winters. There is abundant sunshine throughout the year, with an average of 310 sunny days and bright sunshine during 86% of all daylight hours. Rainfall is scarce, with an average of dispersed between roughly 26 to 27 total rainy days per year. Las Vegas is among the sunniest, driest, and least humid locations in North America, with exceptionally low dew points and humidity that sometimes remains below 10%.\n\nThe summer months of June through September are very hot, though moderated by extremely low humidity. July is the hottest month, with an average daytime high of . On average, 134 days per year reach or exceed , of which 74 days reach and 7 days reach . During the peak intensity of summer, overnight lows frequently remain above and occasionally above . While most summer days are consistently hot, dry, and cloudless, the North American Monsoon sporadically interrupts this pattern and brings more cloud cover, thunderstorms, lightning, increased humidity, and brief spells of heavy rain. The window of opportunity for the monsoon to affect Las Vegas usually falls between July and August, although this is inconsistent and varies considerably in its impact from year to year.\n\nLas Vegas winters are short and generally very mild, with chilly (but rarely cold) daytime temperatures. Like all seasons, sunshine is abundant. December is both the year's coolest and cloudiest month, with an average daytime high of and sunshine occurring during 78% of its daylight hours. Winter evenings are defined by clear skies and swift drops in temperature after sunset, with overnight lows sinking to or lower during the majority of nights in December and January. Owing to its elevation that ranges from 2,000 feet to 3,000 feet, Las Vegas experiences markedly cooler winters than other areas of the Mojave Desert and the adjacent Sonoran Desert that are closer to sea level. Consequently, the city records freezing temperatures an average of 16 nights per winter. However, it is exceptionally rare for temperatures to fall to or below , or for temperatures to remain below for an entire day. Most of the annual precipitation falls during the winter months, but even the wettest month (February) averages only four days of measurable rain. The mountains immediately surrounding the Las Vegas Valley accumulate snow every winter, but significant or sustained accumulation within the city is rare. The most recent major event occurred on December 16, 2008, when Las Vegas received . \n\nAccording to the 2010 Census, the racial composition of Las Vegas was as follows:\n\n\nSource:\n\nThe city's most populous ethnic group, non-Hispanic Whites, have proportionally declined from 72.1% of the population in 1990 to 47.9% in 2010, even as total numbers of all ethnicities have increased with the population. Hispanics or Latinos of any race make up 31.5% of the population. Of those 24.0% are of Mexican, 1.4% of Salvadoran, 0.9% of Puerto Rican, 0.9% of Cuban, 0.6% of Guatemalan, 0.2% of Peruvian, 0.2% of Colombian, 0.2% of Honduran and 0.2% of Nicaraguan descent.\nHawaiians and Las Vegans sometimes refer to Las Vegas as the \"ninth island of Hawaii\" because so many Hawaiians have moved to the city.\n\nAs of the census of 2010, there were 583,756 people, 211,689 households, and 117,538 families residing in the city. The population density was . There are 190,724 housing units at an average density of .\n\nAs of 2006, there were 176,750 households, out of which 31.9% had children under the age of 18 living with them, 48.3% were married couples living together, 12.2% had a female householder with no husband present, and 33.5% were non-families. 25.0% of all households were made up of individuals and 7.5% had someone living alone who was 65 years of age or older. The average household size was 2.66 and the average family size was 3.20.\n\nIn the city, the population was spread out with 25.9% under the age of 18, 8.8% from 18 to 24, 32.0% from 25 to 44, 21.7% from 45 to 64, and 11.6% who were 65 years of age or older. The median age was 34 years. For every 100 females there were 103.3 males. For every 100 females age 18 and over, there were 102.5 males.\n\nThe median income for a household in the city was $53,000 and the median income for a family was $58,465. Males had a median income of $35,511 versus $27,554 for females. The per capita income for the city was $22,060. About 6.6% of families and 8.9% of the population were below the poverty line, including 5.4% of those under age 18 and 6.3% of those age 65 or over.\n\nAccording to a 2004 study, Las Vegas has one of the highest divorce rates. The city's high divorce rate is not wholly due to Las Vegans themselves getting divorced. Since divorce is easier in Nevada than most other states, many people come from across the country for the easier process. Similarly, Nevada marriages are notoriously easy to get. Las Vegas has one of the highest marriage rates of U.S. cities, with many licenses issued to people from outside the area (see Las Vegas weddings).\n\nThe primary drivers of the Las Vegas economy are tourism, gaming and conventions, which in turn feed the retail and restaurant industries.\n\nThe major attractions in Las Vegas are the casinos and the hotels, although in recent years other new attractions have begun to emerge.\n\nMost casinos in the downtown area are located on the Fremont Street Experience, The Stratosphere being one of the exceptions. Fremont East, adjacent to the Fremont Street Experience, was granted variances to allow bars to be closer together, similar to the Gaslamp Quarter of San Diego, the goal being to attract a different demographic than the Strip attracts.\n\nThe Golden Gate Hotel & Casino, located downtown along the Fremont Street Experience, is the oldest continuously operating hotel and casino in Las Vegas; it opened in 1906 as the Hotel Nevada.\n\nThe year 1931 marked the opening of the Northern Club (now the La Bayou). The most notable of the early casinos may have been Binion's Horseshoe (now Binion's Gambling Hall and Hotel) while it was run by Benny Binion.\n\nBoyd Gaming has a major presence downtown operating the California Hotel & Casino, Fremont Hotel & Casino and the Main Street Casino. Other casinos operations include the Four Queens Hotel & Casino, Las Vegas Club (currently undergoing renovation) and Mermaid's Casino, which are also located downtown along the Fremont Street Experience.\n\nDowntown casinos that have undergone major renovations and revitalization in recent years include the Golden Nugget Hotel & Casino, The D Las Vegas Hotel Casino (formerly Fitzgerald's), Downtown Grand (formerly Lady Luck), El Cortez Hotel & Casino and The Plaza Hotel & Casino.\n\nThe center of the gambling and entertainment industry, however, is located on the Las Vegas Strip, outside the city limits in the surrounding unincorporated communities of Paradise and Winchester in Clark County. The largest and most notable casinos and buildings are located there.\n\nWhen The Mirage opened in 1989, it started a trend of major resort development on the Las Vegas Strip outside of the city. This resulted in a drop in tourism in the downtown area, but many recent projects have increased the number of visitors to downtown.\n\nAn effort has been made by city officials to diversify the economy by attracting health-related, high-tech and other commercial interests. No state tax for individuals or corporations, as well as a lack of other forms of business-related taxes, have aided the success of these efforts.\n\nWith the Strip expansion in the 1990s, downtown Las Vegas – which has maintained an old Las Vegas feel – began to suffer. However, in recent years the city has made strides in turning around the fortunes of this urban area.\n\nThe Fremont Street Experience was built in an effort to draw tourists back to the area, and has been popular since its startup in 1995.\n\nThe city purchased of property from the Union Pacific Railroad in 1995 with the goal of creating a better draw for more people to the downtown area. In 2004, Las Vegas Mayor Oscar Goodman announced plans for Symphony Park, which could include a mixture of offerings, such as residential space and office buildings.\n\nAlready operating in Symphony Park is the Cleveland Clinic Lou Ruvo Center for Brain Health (opened in 2010), The Smith Center for the Performing Arts (opened in 2012) and the DISCOVERY Children's Museum (opened in 2013).\n\nOn land across from Symphony Park, the World Market Center Las Vegas opened in 2005. It currently encompasses three large buildings with a total of 5.1 million square feet. Trade shows for the furniture and furnishing industries are held there semiannually.\n\nAlso located nearby is the Las Vegas North Premium Outlets. A second expansion was completed in May 2015, with the mall currently offering 175 stores.\n\nA new Las Vegas City Hall opened in February 2013 on downtown's Main Street. The former City Hall building is now occupied by the corporate headquarters for the major online retailer, Zappos.com, which opened downtown in 2013. Zappos CEO Tony Hsieh has taken an interest in the urban area and has contributed $350 million toward a revitalization effort called the Downtown Project. Projects funded include Las Vegas's first independent bookstore, The Writer's Block.\n\nThe city is home to several museums, including the Neon Museum (the location for many of the historical signs from Las Vegas's mid-20th century heyday), The Mob Museum, the Las Vegas Natural History Museum, the DISCOVERY Children's Museum, the Nevada State Museum and the Old Las Vegas Mormon State Historic Park.\n\nThe city is home to an extensive Downtown Arts District, which hosts numerous galleries and events including the annual Las Vegas Film Festival. \"First Friday\" is a monthly celebration that includes arts, music, special presentations and food in a section of the city's downtown region called 18b, The Las Vegas Arts District. The festival extends into the Fremont East Entertainment District as well.\n\nThe Thursday prior to First Friday is known in the arts district as \"Preview Thursday.\" This evening event highlights new gallery exhibitions throughout the district.\n\nThe Las Vegas Academy of International Studies, Performing and Visual Arts is a Grammy award-winning magnet school located in downtown Las Vegas.\n\nThe Smith Center for the Performing Arts is situated downtown in Symphony Park. The world-class performing arts center hosts Broadway shows and other major touring attractions, as well as orchestral, opera, ballet, choir, jazz, and dance performances.\n\nLas Vegas is also known as the Gambling Capital of the World, as the city currently has the largest strip of land-based casinos in the world.\n\nThe Las Vegas Valley is the home of one major league professional team, the Vegas Golden Knights of the National Hockey League, an expansion team that began play in the 2017–18 NHL season out of T-Mobile Arena in nearby Paradise. The Oakland Raiders of the National Football League plan to relocate to the under-construction Las Vegas Stadium, also in Paradise, by the 2020 NFL season.\n\nThe only minor league sports team that plays in the city of Las Vegas is the Las Vegas 51s of the Pacific Coast League, the AAA farm club of the New York Mets.\n\nIn response to the original rumors of the eventual NHL expansion team in Las Vegas, ESPN writer Scott Burnside noted several obstacles that would be faced by the city if it were to become a professional sports market, including the presence of legal sports betting, scheduling conflicts with the large number of residents who work nighttime and overnight shifts, and that the casinos would be unlikely to give away tickets to such events as a promotion, as they run contrary to a goal of encouraging patrons to remain in their facilities.\n\nMajor league professional teams\nMinor league professional teams\nAmateur league teams\nCollege teams\n\nLas Vegas has 68 parks. The city owns the land for, but does not operate, four golf courses: Angel Park Golf Club, Desert Pines Golf Club, Durango Hills Golf Club, and the Las Vegas Municipal Golf Course. It is also responsible for 123 playgrounds, 23 softball fields, 10 football fields, 44 soccer fields, 10 dog parks, six community centers, four senior centers, 109 skates parks, six swimming pools, and more.\n\nThe city of Las Vegas government operates as a council–manager government. The Mayor sits as a Council member-at-large and presides over all of the City Council meetings. In the event that the Mayor cannot preside over a City Council meeting, the Mayor Pro-Tem is the presiding officer of the meeting until such time as the Mayor returns to his/her seat. The City Manager is responsible for the administration and the day-to-day operations of all municipal services and city departments. The City Manager maintains intergovernmental relationships with federal, state, county and other local governments.\n\nMuch of the Las Vegas metropolitan area is split into neighboring incorporated cities or unincorporated communities. Approximately 700,000 people live in unincorporated areas governed by Clark County, and another 465,000 live in incorporated cities such as North Las Vegas, Henderson and Boulder City. Las Vegas and Clark County share a police department, the Las Vegas Metropolitan Police Department, which was formed after a 1973 merger of the Las Vegas Police Department and the Clark County Sheriff's Department. North Las Vegas, Henderson, Boulder City and some colleges have their own police departments.\n\nA Paiute Indian reservation occupies about in the downtown area.\n\nLas Vegas, home to the Lloyd D. George Federal District Courthouse and the Regional Justice Center, draws numerous companies providing bail, marriage, divorce, tax, incorporation and other legal services.\n\nPrimary and secondary public education is provided by the Clark County School District, which is the fifth most populous school district in the nation. Students totaled 314,653 in grades K-12 for school year 2013–2014.\n\nThe College of Southern Nevada (the third largest community college in the United States by enrollment) is the main higher education facility in the city. Other institutions include the University of Nevada School of Medicine, with a campus in the city, and the for-profit private school Le Cordon Bleu College of Culinary Arts. Educational opportunities exist around the city; among them are the University of Nevada, Las Vegas and Nevada State College run by the Nevada System of Higher Education, Desert Research Institute, The International Academy of Design & Technology Las Vegas and Touro University Nevada.\n\nRTC Transit is a public transportation system providing bus service throughout Las Vegas, Henderson, North Las Vegas and other areas of the valley. Inter-city bus service to and from Las Vegas is provided by Greyhound, BoltBus, Orange Belt Stages, Tufesa, and several smaller carriers. Amtrak trains have not served Las Vegas since the service via the Desert Wind was discontinued in 1997. Though no Amtrak trains have served Las Vegas since the Desert Wind was cancelled in 1997, Amtrak California operates Thruway Motorcoach dedicated service between the city and its passenger rail stations in Bakersfield, California, as well as Los Angeles Union Station via Barstow.\n\nA bus rapid-transit link in Las Vegas called the Strip & Downtown Express (previously ACE Gold Line) with limited stops and frequent service was launched in March 2010, and connects downtown Las Vegas, the Strip and the Las Vegas Convention Center.\n\nWith some exceptions, including Las Vegas Boulevard, Boulder Highway (SR 582) and Rancho Drive (SR 599), the majority of surface streets in Las Vegas are laid out in a grid along Public Land Survey System section lines. Many are maintained by the Nevada Department of Transportation as state highways. The street numbering system is divided by the following streets:\n\n\nInterstates 15, 515, and US 95 lead out of the city in four directions. Two major freeways – Interstate 15 and Interstate 515/U.S. Route 95 – cross in downtown Las Vegas. I-15 connects Las Vegas to Los Angeles, and heads northeast to and beyond Salt Lake City. I-515 goes southeast to Henderson, beyond which US 93 continues over the Mike O'Callaghan–Pat Tillman Memorial Bridge towards Phoenix, Arizona. US 95 connects the city to northwestern Nevada, including Carson City and Reno. US 93 splits from I-15 northeast of Las Vegas and goes north through the eastern part of the state, serving Ely and Wells. US 95 heads south from US 93 near Henderson through far eastern California. A partial beltway has been built, consisting of Interstate 215 on the south and Clark County 215 on the west and north. Other radial routes include Blue Diamond Road (SR 160) to Pahrump and Lake Mead Boulevard (SR 147) to Lake Mead.\n\n\n\nMcCarran International Airport handles international and domestic flights into the Las Vegas Valley. The airport also serves private aircraft and freight/cargo flights. Most general aviation traffic uses the smaller North Las Vegas Airport and Henderson Executive Airport.\n\nThe Union Pacific Railroad is the only Class I railroad providing rail freight service to the city. Until 1997, the Amtrak Desert Wind train service ran through Las Vegas using the Union Pacific Railroad tracks.\n\n\n\n",
                "List of condominiums in Las Vegas\n\nSince the 1990s, various condominium projects have been proposed for the Las Vegas Valley. Park Towers and Turnberry Place, two high-rise condominium properties located near the Las Vegas Strip, were completed in 2001; they subsequently inspired a condominium boom that started in 2003, when various developers began announcing projects that were planned throughout the Las Vegas Valley.\n\nMany projects were ultimately cancelled because of a rise in construction costs, as well as a lack of skilled construction workers and contractors who were qualified to build high-rises; both reasons were attributed to the large number of projects being announced. The following list includes notable condominium projects that were both completed and cancelled, as well as projects that are on hold.\n\nRegency Towers, built in 1974, was the first high-rise condominium property to open in the Las Vegas Valley, with 226-units. The property was initially unsuccessful, selling only eight units before going into foreclosure. In the late 1990s, Las Vegas was the fastest-growing area in the United States. As a result, five new high-rise condominium projects were being planned for the Las Vegas Valley in 1998, for a total of 12 new condominium towers. Among the five proposed projects was Turnberry Place and Park Towers.\n\nHigh-rise condominiums became a popular trend in the Las Vegas Valley after the opening of Turnberry Place and Park Towers in 2001. Numerous high-rise condominium projects were subsequently announced beginning in 2003. Real estate experts predicted that only 20 to 50 percent of the announced projects would actually get built. The condo-hotel concept was introduced in the Las Vegas Valley in September 2003, at MonteLago Village at Lake Las Vegas. At the end of the year, plans were underway for the first high-rise condominium in downtown Las Vegas: Soho Lofts.\n\nThe condominium boom was sometimes referred to as the \"Manhattanization of Las Vegas\". The term was first used in 1999, by Steve Bottfeld, the owner of a Las Vegas real estate consulting firm. The term was popularized by Richard Lee director of public relations for First American Title Company after he used it during a presentation. Lee was a well-known local proponent of the high-rise condominium boom, and spoke frequently about it at local conferences and seminars. Lee had used the term as early as 2003; it was later used as the title for \"Manhattanizing Las Vegas\", a 2005 book by Paul Murad that chronicled the Las Vegas condominium boom. A website called Manhattanization.com was also created to cover the local high-rise market.\n\nBy January 2005, 122 high-rise condominium buildings with a total of nearly 17,000 units had been announced. The tallest proposed project was the 73-story Summit, which also had the most expensive price listed for a unit: $35 million. The lowest price was $139,900 for units at the 51-story Las Vegas Central. New condominium projects, when completed, were expected to create an increase in visitation to local casinos. Since the start of the condominium boom in 2003, the Krystle Sands high-rise on the Las Vegas Strip was the first of the newly proposed condominium projects to be cancelled, in March 2005. As of December 2005, at least 70 condominium towers had been announced for the Las Vegas Valley during the previous 12 months. Multiple projects had been cancelled up to that point.\n\nMany projects were cancelled because of rising construction costs, as well as a lack of skilled construction workers and contractors who were capable of building high-rise structures; both reasons were attributed to the large amount of high-rise condominium projects that were being planned. While most of the cancelled condominium projects did not have difficulty selling, their respective developers could not build the projects at a suitable cost due to construction expenses rising 30 percent to 50 percent. In February 2006, representatives from six projects announced the formation of the Las Vegas High Rise and Condominium Alliance, which would promote the mid-rise and high-rise condominium market in Las Vegas.\n\nIn April 2006, Murad who was planning the 39-story Gateway Las Vegas condominium tower stated that Las Vegas had entered its second phase of \"Manhattanization\", saying, \"This first phase of Manhattanizing is over. Now we're entering the second phase. What happened in Las Vegas over the last few years is amazing, going from a couple of high rises to a hundred. That hasn't happened anywhere else in the world.\" The Platinum and The Signature at MGM Grand, the first projects near the Las Vegas Strip to offer condo-hotel units, were completed in 2006.\n\nBy that point, after the cancellations of several high-rise condominium projects, banks had become more resistant to developers who were seeking construction financing for proposed projects. Two banks were heavily involved in Las Vegas' high-rise condominium market at that time: Corus Bank and Hypo Real Estate Corporation. Corus had $770 million of its loan portfolio allocated to Las Vegas condominium projects, while Hypo had approximately $850 million allocated to such projects. During 2006, multiple condominium projects were under construction in downtown Las Vegas. Mayor Oscar Goodman, who was elected in 1999, had made it a priority to revitalize the downtown area. Sky Las Vegas, finished in 2007, was the first high-rise condominium to be completed on the Las Vegas Strip.\n\nSales of high-rise condominiums began to decrease in 2008. The condo-hotel market, consisting of projects on and near the Las Vegas Strip, also suffered that year because of low sales; thousands of condo-hotel units had been cancelled up to that point. By the end of 2008, only three additional developers had successfully completed condominium high-rises near the Las Vegas Strip: MGM Mirage (The Signature), Donald Trump (Trump International), and Andrew Fonfa (Allure Las Vegas). In 2009, condominium and condo-hotel units on and near the Las Vegas Strip were still struggling to sell because of the financial crisis of 2007–2008.\n\nAs of August 2009, less than 25 percent of the proposed condominium projects had been built, as predicted by some analysts; developers of projects that were completed were having difficulty selling their units as a result of the 2008 recession. Sales of high-rise condominiums increased seven percent in the third quarter of 2009, although condo-hotels continued to struggle. Poor condominium sales continued into the following year. In June 2010, there were 5,500 high-rise condominium units and 5,400 condo-hotel units in the Las Vegas Valley. By that point, developers of several high-rise condominium properties had begun renting their vacant units, which were left unsold because of the poor economy.\n\nSales of high-rise condominiums had increased in 2011, with many units being sold at a reduced cost through bank sales, short sales, and foreclosures to investors, who would subsequently improve and flip the units. The largest increase occurred at properties on and near the Las Vegas Strip. However, sales of new condominiums were down, and the condo-hotel market also continued to suffer. High-rise sales were expected to increase in 2015 as the market continued to recover.\n\nBy 2016, the construction industry in Las Vegas had been revived, although there were no plans for any new high-rise condominium projects. Prices for existing high-rise condominiums had increased by that time. Demand for high-rise homes on the Las Vegas Strip was projected to increase because of the opening of the T-Mobile Arena, as well as the announcement of an NHL expansion franchise and discussions about a potential NFL team in Las Vegas.\n\nAllure was announced in January 2005, and began construction in September 2005. Allure, located west of the Las Vegas Strip, was completed in December 2007, and was the tallest residential building within Las Vegas city limits at that time, standing 41 stories high with a total of 428 units. The tower was built at a cost of $150 million. A second tower was cancelled because of poor sales in the first tower caused by the Great Recession, and because of an oversupply of condominium high-rises on the Las Vegas Strip.\n\nJuhl is a mixed-use development project that includes 341 condominium units, some of which are located within a 15-story tower. Units range from to nearly . Juhl is located at 353 East Bonneville Avenue in downtown Las Vegas.\n\nThe property was initially occupied by four houses. The Las Vegas Redevelopment Agency solicited proposals from approximately a dozen companies across the United States to develop the land. CityMark Development was chosen in 2004 develop the property. CityMark purchased the property for $5 million, and planned to build Juhl, a $167 million mixed-use and condo project. Juhl would include six towers, standing between six and 15 stories, with a total of 341 units. The project would include of retail space, while parking would be located on the first five floors. The houses on the property were demolished, and by April 2006, $600,000 of underground work and the relocation of utilities had begun on the site. Turner Construction was the general contractor, while Martinez-Cuitri was the architect. Corus Bank provided $106 million for the project.\n\nIn August 2006, 600 cubic yards of concrete were delivered by more than 75 trucks for the foundation of the project. In December 2006, approximately 60 percent of Juhl's units had been sold through binding purchase agreements. That month, construction crews poured the third and fourth floors of the residential and parking structures for the project. Approximately 115 construction workers were on the site at that time, with the number expected to increase to 200 to 225 within the following 15 to 18 months. In July 2007, several businesses were being planned for the new project, including a bar, a coffee shop, and a jewelry store. Three cranes were used during construction of the 15-story mid-rise building. The 15-story tower was topped off in August 2007, with the first residents expected to move in by May 2008. At that time, 70 percent of Juhl's units had been sold. Juhl remained under construction in June 2008, with only 67 percent of its units sold. Juhl's planned opening was delayed by more than a year. In August 2011, Juhl still had 307 units left unsold.\n\nST Residential, at a cost of $14 million, purchased the project after the failure of Corus in September 2009. A bike store, The Town Bike, opened at Juhl in September 2013. In 2013, ST Residential sold Juhl's 306 unsold units to KRE Capital, based in California; Dune Real Estate Partners, based in New York; and Northcap, based in Las Vegas. Juhl's unsold units were turned into rentals. On March 23, 2017, it was announced that Juhl's unsold units would be put on sale in late April 2017, while renewing some rental agreements to keep the building occupied.\n\nThe Mandarin Oriental hotel, located within MGM's mixed-use CityCenter complex on the Las Vegas Strip, includes 225 condominiums, and was opened in December 2009.\n\nNewport Lofts is a 23-story, 168-unit tower located at 200 Hoover Street in downtown Las Vegas. The project was co-developed by Sam Cherry, who also developed Soho Lofts. In August 2004, Cherry was planning Newport Lofts as a 17-story tower with 131 units, to be built at the northeast corner of Casino Center and Hoover Avenue. The project was a joint venture between Cherry and Seegmiller Partners, a company based in Newport Beach, California, with Clark and West Seegmiller as its principals. The property for the project had been purchased several years earlier by Clark Seegmiller.\n\nIn October 2004, the Las Vegas City Council approved Newport Lofts as a 22-story tower with 168 units. Groundbreaking was to begin in late May 2005, with completion expected in fall 2006. Reservations began in January 2005, while groundbreaking began in early July 2005, with Breslin Builders as the project's general contractor. Completion was expected for 2007. That month, the project received $81 million in construction financing from George Smith Partners, based in Irving, California. In March 2006, the elevator shaft and center staircase had been built up to the 12th floor, while shear walls were up to the eighth floor.\n\nConstruction was still underway in August 2007, although some new residents had already begun moving into the building by that time. More than 70 percent of the building's units had been sold up to that point. Construction concluded at a cost of $115 million. Corus Bank helped financed the project for $67.1 million. West Seegmiller said Newport Lofts was designed with a Southern California theme, as its target demographic was California residents who desired to purchase a second home in Las Vegas. In 2007, Newport Lofts won a Mayor's Urban Design Award.\n\nIn January 2008, an auction of 60 units was cancelled after Pyramis Global Advisors a division of Fidelity Investments took over management of the building. Condo prices at Newport Lofts were decreased 30 percent later that year. At the end of 2008, artist Brett Sperry opened the Brett Wesley Gallery inside his penthouse at Newport Lofts. When Corus Bank failed in September 2009, the property was acquired by ST Residential. In April 2011, ST Residential announced that the last of Newport Lofts' units had been sold to buyers.\n\nOne Las Vegas is located at the intersection of South Las Vegas Boulevard and Windmill Lane. One Las Vegas was announced in February 2005, as a joint project between Amland Development and B.S.R. Group, an international developer based in Israel. Chet Nichols, executive vice president for Amland Development, was working with Wells Fargo, Wachovia and Hypo Real Estate Capital to devise a financial package to help build the project. Grading on the 20-acre property was expected to begin in late February 2005, with construction of the first two towers standing 20 stories high expected to begin in July 2005. In February 2005, Amland won the legal rights to use the \"One Las Vegas\" name, which had also been chosen by Del American for their own condominium project. Sales began on April 7, 2005.\n\nThe first phase, expected to cost $142 million, was under construction in April 2006, with excavation, grading, and underground utility work occurring on the property. J.E. Dunn Construction of Kansas City served as the general contractor. The first phase consisted of two condominium towers, scheduled for completion in December 2007. Approximately 50 percent of the first phase had been presold up to that point. A total of five towers standing 18 to 21 stories were ultimately planned for the property, with a final total of 890 condominium units. A 200-room boutique hotel and a 200-unit condo-hotel both of which would be operated by the same company were also planned at that time. By that point, Amland had gained financing from Corus Bank, which fully financed the project for $142 million. Units ranged in price from the $400,000s for an one-bedroom unit to $1.8 million for a penthouse. Units initially started at $275,000 when the project was announced.\n\nIn October 2006, construction was underway on the two towers, which were expected to have a total of 359 units, with an ultimate total of 960 units when all five towers were completed. The 182-unit first tower was topped off on January 19, 2007, with completion scheduled for late 2007. Construction on the second tower was up to the 16th floor. Approximately 400 construction workers were on the project. The second tower was topped off in April 2007, and was expected to be completed in early 2008, with the first phase expected to cost $150 million.\n\nDelays were attributed to excessive construction activity in Las Vegas, and to the fact that inspections of safety systems did not occur as initially scheduled. Certificates of occupancy were issued for the towers in June 2008. At the time, discussions were underway with two hotel companies for the 220-room boutique hotel. In April 2009, One Las Vegas entered foreclosure because of low sales, and was taken over by Corus Bank, which planned to offer units at a 50 percent discount. After Corus Bank failed in September 2009, Starwood Property Trust acquired the project a month later and began renting units because of poor sales; less than 75 of the 359 units had closed on their sales. Upgrades totaling $2 million were completed in 2015.\n\nOriginally announced under the name of Versailles in March 1998. The project was to consist of three 12-story towers with a total of 84 condominium units, to be constructed on of land in the Las Vegas community of Summerlin. Construction was to begin in May 1998, with completion scheduled for 14 months later. In July 2004, a new condominium project was announced for the property under the name of Queensridge Towers, later changed to One Queensridge Place. Construction began in April 2005, and concluded by September 2007, at a cost of $400 million. One Queensridge Place consists of two 18-story towers with 219 condominium units, and is located on part of a property near the Suncoast Hotel and Casino and the Tivoli Village shopping mall. Two additional towers standing 14 and 18 stories high had initially been announced as part of the Queensridge project, and had been approved for the remainder of the 20-acre property.\n\nPanorama Towers was announced in September 2003, and began construction the following year. The first tower was opened in December 2006, while a second tower was opened a year later. Both towers stand 33 stories high, and were built at an estimated cost of $300 million. A third tower, standing 45 stories, was renamed as The Martin in 2011, and received a $3 million renovation to increase sales. The complex is located west of Interstate 15 and CityCenter.\n\nPark Towers is a two-tower, 20-story condominium property with 84 units, located east of the Las Vegas Strip. Park Towers was announced by developer Irwin Molasky in 1998, and began construction the following year, with Steve Wynn as a co-developer. The project was completed in 2001.\n\nRegency Towers is located at 3111 Bel Air Drive, at the Las Vegas Country Club in Winchester, Nevada. Regency Towers was built in 1974, and was the first high-rise condominium property to open in the Las Vegas Valley, standing 28 stories with 226 units. Only eight of the units sold after opening, before the property went into foreclosure. Irwin Molasky, who was among the eight buyers, later purchased the entire structure and renovated it before ultimately selling the remaining units. Regency Towers was designed by Las Vegas architect Homer A. Rissman, who also lived at the property for years. In March 2001, approximately 80 residents were evacuated after the explosion of a meth lab operated by a resident inside one of the condominiums. In March 2007, six weeks of filming began at Regency Towers for the second season of the television series \"HGTV Design Star\". The season was shot inside the penthouse formerly owned by Molasky.\n\nNotable tenants at Regency Towers have included George Carlin, Don Miguel Ruiz, Hank Greenspun and his wife, Shaun King, musician Larry Hart, Norm Clarke, casino executive Burton Cohen, Russian-art collector Dr. Rupert Perrin, Sandra Murphy, and Anthony Spilotro. Moe Dalitz owned a penthouse unit until his death there in 1989; his unit, which included his furniture and books, was for sale in 2002 at a cost of $1.2 million. Also for sale at that time was Rodney Dangerfield's unit, at a cost of $275,000. Actress Debbie Reynolds, who purchased a condominium unit on the 12th floor in 1974, put her unit up for sale in 2011, at a cost of $269,900. La Toya Jackson owned a unit from 1996 until 2009, when it was foreclosed.\n\nSky Las Vegas is a 45-story tower with 409 condominium units that is located on the Las Vegas Strip. Sky Las Vegas was announced in July 2004, and was opened in May 2007, becoming the first high-rise condominium project to be completed on the Las Vegas Strip.\n\nSoho Lofts, named after the Manhattan neighborhood of SoHo, is a 16-story condominium tower with 112 units, located within the city's arts district at 900 South Las Vegas Boulevard in downtown Las Vegas. The project was developed by Sam Cherry, who also developed Newport Lofts. Cherry and his father-in-law, Harris Rittoff, were planning Soho Lofts in December 2003. The project was to be built at a cost of $40 million to $50 million, on of vacant property at the southwest corner of South Las Vegas Boulevard and Hoover Avenue. Soho Lofts was the first high-rise condominium project to be announced for the downtown area. Groundbreaking was scheduled for May 2004. The project was to include of ground-level retail space. The property was purchased in January 2004, at a cost of $1.2 million.\n\nThe project's general contractor was Breslin Builders. Digging for the building's support columns began in July 2004. Construction was expected to cost $60 million. Crews were preparing to begin the structure's foundation work in October 2004. Occupancy was initially expected for early December 2005. Occupancy was later expected for February 2006, although construction was ongoing in April 2006.\n\nIn May 2006, an automobile dealership for Lamborghinis, Ferraris, and Rolls-Royces was being planned for the building's ground floor, while residents were expected to begin occupying the building later that month. In December 2007, a lease was signed for the Dust Contemporary Fine Art gallery to occupy a space inside Soho Lofts. The gallery opened two months later. The Globe Salon was the first business to occupy Soho Lofts' commercial space, beginning in July 2008; the rest of the space remained vacant because of the poor economy.\n\nBy 2009, the Naomi Arin Contemporary Art gallery was operating inside Soho Lofts. In January 2011, a small grocery store, Resnicks Grocery, opened inside a space inside Soho Lofts that was previously occupied by an art gallery. A lounge, known as The Lady Silvia, opened inside Soho Lofts in July 2011. The Amanda Harris Gallery opened inside Soho Lofts in January 2012. The Contemporary Arts Center later operated from within one of Soho Loft's ground-level spaces.\n\nThe Ogden was initially opened as the Streamline Tower, built on the property of the demolished Golden Inn motel in downtown Las Vegas. Streamline Tower opened in May 2008, with 275 condominium units in a 21-story tower, although sales suffered as a result of the weak local and national economy. The units were converted into apartments in 2010, and the property was renamed as The Ogden a year later. In 2014, The Ogden was converted back into condominiums.\n\nThe Platinum is a 17-story, 255-unit condo hotel built on of land, previously occupied by a motel and located east of the Las Vegas Strip. The project was developed by Platinum Condominium Development, LLC, a joint venture of Diversified Real Estate Concepts, Inc. and Marcus Hotels and Resorts. Construction began in 2005, and the project opened in October 2006.\n\nThe Signature is a condo hotel located near the MGM Grand Las Vegas resort. The project was jointly developed by MGM Mirage and Turnberry Associates, and opened in 2006, on the former land of MGM Grand Adventures Theme Park.\n\nIn April 2002, businessmen Phil Ruffin and Donald Trump announced plans to build Trump Tower Las Vegas, a $300 million, 60-story condominium tower with 300 units. Construction had been expected to begin within seven months. Groundbreaking took place in July 2005, after the project had been revised to include a hotel. The 64-floor tower was constructed behind the Las Vegas Strip's New Frontier Hotel and Casino, on of property that had been used as part of the New Frontier's rear parking lot. The project ultimately cost $500 million, and opened in 2008, with a total of 1,282 condominium units and hotel rooms. A nearly identical second tower had been planned, but was postponed due to poor economic conditions. Construction of the second tower had been expected to begin in late 2008.\n\nTurnberry Place was announced in June 1998, and consists of four 40-story condominium towers located east of the Las Vegas Strip.\n\nTurnberry Towers is a two-tower property near the Las Vegas Strip. The towers stand 45 stories and contain a total of 636 units.\n\nVdara, opened in December 2008, is a condo hotel within CityCenter that includes 1,495 units.\n\nVeer Towers, located within CityCenter, consists of twin towers that stand 37 stories high and include 670 condominium units. The towers opened in July 2010.\n\nThe Fontainebleau project began construction on the Las Vegas Strip in 2007, and was to include a hotel, casino, and 1,018 condominium units. Construction on the $2.9 billion project ceased in 2009, the year of its planned opening. Carl Icahn purchased the unfinished project later that year for $156 million. It was estimated that the project would require another year and an additional $1 billion to be completed. Icahn listed the unfinished project for sale in November 2015, at a price of $650 million.\n\nIn 2004, the Atlanta-based Ambling Development Company held meetings with mayor Oscar Goodman, councilman Lawrence Weekly, and other city officials regarding a condominium project. Ambling was planning a complex of three 28-story condominium towers with a total of 840 units, to be built at a cost of $330 million on at the northwest corner of Alta Drive and South Martin Luther King Boulevard. The land had previously been occupied by a gas station, which was later burned down during a riot.\n\nAmbling invested $2 million to acquire the land, to open a Las Vegas office, and to perform initial design work. Months later, on December 15, 2004, the City Council voted unanimously to reject Ambling's project because of opposition from nearby residents, who believed that the tall modern-style glass buildings would not go well with the neighborhood's southwestern theme and its 600 single-story houses. Residents also believed the new project would create traffic problems and overcrowd nearby schools. Weekly criticized city staff members, alleging that they misled Ambling to believe that their project was guaranteed to be approved by the City Council. The manager of the city's Economic Development division, who had worked with Ambling on their project, resigned from his position two days after the vote.\n\nIn June 2005, Ambling was unanimously approved by the City Council for a smaller version of its initial project to be constructed on the same property. The new project was to consist of three nine-story buildings and one five-story building, with retail space and a total of 664 condominium units. The project was to be built in phases, with construction planned to begin at the end of 2005, and the first phase being potentially completed in 2007. The project was ultimately cancelled due to further opposition from nearby residents. The land was subsequently sold in February 2006.\n\nBy December 2004, the newly created high-rise development division of Prudential Americana Group Realtors was planning Aqua Blue, a luxury condominium-hotel project. Aqua Blue was the division's flagship project, with gross sales expected to exceed $550 million. The project was approved that year, and was to be constructed east of the Las Vegas Strip near the intersection of Flamingo Road and Koval Lane, on of property that was occupied at the time by a Super 8 motel, located adjacent to the Ellis Island Casino & Brewery. The motel was to be demolished to make room for Aqua Blue, while Ellis Island would continue operations but would receive an exterior renovation to match the appearance of the new project.\n\nAqua Blue would have included a casino that would be operated by Gary Ellis, who owned the Ellis Island. Ellis decided to become involved in the Aqua Blue after meeting with the project's developer, Michael Peterson, who had developed and owned condominiums and restaurants in Wisconsin and Chicago. Aqua Blue was to stand 46 stories, and would have included 825 units, priced between $399,000 and $1,125,000. The project's expected cost was $600 million. Construction was expected to begin in fall 2005, and its opening was expected to occur by fall 2007.\n\nIn January 2005, retired basketball player Michael Jordan became involved in Aqua Blue. Jordan was to open two restaurants at Aqua Blue: Michael Jordon's Steak House and Michael Jordon's 23 Sportcafe. Jordan would also open the Michael Jordan Athletic Center inside the new building. In June 2005, Peterson began considering offers for the property. After three weeks, Peterson announced on June 29, 2005, that the project had been cancelled due to a large increase of proposed nearby condominium projects and a lack of buyers to sustain the increase. The property was sold to David Schwartz and his Chicago-based company, Waterton Associates, with plans to keep the Super 8 motel operational.\n\nChampions of Las Vegas was to consist of a 21-story tower with 844 condominium units that would be priced at approximately $1 million each. The project was being planned in 1995, and by March 1998, it had received approval by the Clark County Commission. The project was to be located near the southern entrance to Red Rock Canyon National Conservation Area. As of 1998, the project was scheduled for completion in 2006, because of the necessity to perform extensive infrastructure work on the property.\n\nThe Charlie Palmer Hotel was announced by chef Charlie Palmer in April 2006. The project was to include a 35-story boutique condo hotel with 400 to 500 rooms, and initially was to be built on the three-acre site of the Golden Palm Hotel, at the intersection of Tropicana Avenue and Dean Martin Drive. The $400 million project was scheduled to break ground later in 2006, with completion expected for mid-2008. The project's proposed location was later changed to Symphony Park in downtown Las Vegas, with the condominium aspect removed.\n\nIn March 2005, the Seattle-based Northwest Resource Management Group filed plans with the city of Las Vegas for Cielo Vista, a 25-story condominium tower with 414 units, as well as of commercial space on the first floor. Above the first floor would be six floors used for parking, and 18 floors for condominium units. The project was designed by Las Vegas-based MWT Ofra, and was scheduled for a vote by the Las Vegas Planning Commission and the City Council in May and June 2005, respectively.\n\nCielo Vista would have been the company's first Las Vegas project. The company had previously developed single-family residential homes in California, as well as an 11-story building in Seattle. Cielo Vista was to be built at the southeast corner of East Washington Avenue and Veterans Memorial Drive, west of Cashman Field and north of downtown Las Vegas, on a 2.8-acre site that the company purchased for $1.2 million on March 29, 2005. A local expert believed that the project was in a bad location: an older part of Las Vegas with little development. The area was also known for a high rate of crime and homelessness; Steve Hartley, a partner for Northwest Resource Management Group, said the company had previously developed a project in California that had similar demographics.\n\nThe low price of the land allowed the company to sell condominium units ranging from to at a starting price of $295,000, and exceeding $500,000. Condominium units in the project could be reserved for a refundable fee of $5,000, compared to a $25,000 fee that was being charged by some other high-rise condominium projects in the city. Construction was expected to begin in late 2005, as long as the project received approval from the city. Completion was expected by early 2007. The project received unanimous approval from the Las Vegas Planning Commission in June 2005. At the time, 155 units had been reserved.\n\nThree months after the announcement of Cielo Vista, Northwest Resource suspended sales and delayed the project because of rising construction costs, choosing instead to wait until it was further along in the construction cost process before beginning sales; 300 units had been reserved up to that point, and some buyers received a refund. As final construction costs were being determined in March 2006, Eric Radovich, Northwest Resource's managing director of public relations and marketing, said, \"We're getting close to a number and we think it's real. We didn't feel we could tell people truthfully what the product was going to cost and whether we can afford to build it.\" The project never materialized.\n\nIn January 2005, Diversified Real Estate Group and Downtown Redevelopment Group announced Club Renaissance, a 60-story condominium tower with either 906 units or 950 units. Mayor Oscar Goodman noted the $150,000 starting price for condominiums in the project, saying, \"I like the affordability of it.\" Philippe Pageau-Goyette, the president of Diversified Real Estate Group, planned for Club Renaissance to be the least-expensive high-rise condominium in the Las Vegas Valley, and said 95 percent of the project's inhabitants would be local residents: \"I don't want to go after luxury, I want to go after locals. As of right now, we have no competition in the locals affordable market. A lot of guys are doing luxury.\"\n\nThe project would include of retail space, located on the first floor. Other amenities on the lower floors were to include restaurants, a food market, child day care, and dry cleaners. An additional of office space would be located on the 13th and 14th floors, with condominium units beginning on floor 15. The top two floors, 58 and 59, were to include a private club and fitness center. The project was planned for the southeast corner of Casino Center Boulevard and Bonneville Street in downtown Las Vegas. Presale reservations were expected to begin in March 2005. At the time of its announcement, the project was reported to cost $400 million to construct. The cost was later reported as being $250 million.\n\nThe project received final approval in February 2005. Several historic railroad cottages located on the property were expected to be relocated. The tower, expected to be 702 feet high, was one of the taller high-rise projects to be approved for downtown Las Vegas. Sales began in October 2005, at which point the starting price had increased into the $400,000 range because of rises in steel, concrete and labor costs. As of February 2006, the cottages remained on the site, with little progress on Club Renaissance. Gilles Pageau, a Canadian developer and the uncle of Philippe Pageau-Goyette, said he had invested $60 million of his money into the project and that he had been offered an additional $400 million from various banks to cover the construction costs. Pageau said at the time that the project would still be built.\n\nIn February 2007, Goodman gave the developers two weeks to demonstrate to the Las Vegas City Council that the project was nearing construction; otherwise, he said the approval for the project would be revoked. Leanord Mussina, a spokesman for the project, had told the City Council, \"We're just a victim of construction costs. Financing has dried up to a large extent for Las Vegas. We're redesigning, trying to value engineer, to do something affordable. We're in negotiations with some large construction companies to joint venture at this point, because that's the only way to finance it.\" Mussina estimated that the project could take up to a year before construction started, to which Goodman responded, \"I'm not interested in a year. I've been to three groundbreakings there so far and haven't seen ground broke.\" Approximately $8 million or $9 million had already been spent on the project up to that point.\n\nThe City Council ultimately granted the project a six-month extension. At the time, part of the property that was to be used for the project was in foreclosure. In March 2007, the project was purchased out of foreclosure by Los Angeles architect Mark Vaghei and engineer Nabih Yousseff for nearly $3.5 million. The pair began redesigning the project to be smaller. Club Renaissance ultimately did not materialize.\n\nIcon was proposed to have twin towers that would rise over 500 feet into the Las Vegas skyline with all units facing towards the south Las Vegas Strip.\n\nIcon was proposed to have a more unique modern all glass design which would have set it apart from the more traditional high-rise condos.\n\nOn April 1, 2004, reservations opened for floors 4 to 38 of a 45-story, 510-foot condominium-hotel tower known as Krystle Sands. The project was officially announced in May 2004 by F.W. \"Freddie\" Schinz, a Florida developer. The Krystle Sands project was to replace the 105-room Algiers Hotel, located on a 3.6-acre site on the Las Vegas Strip, adjacent to the Turnberry Place complex and to the former site of the El Rancho Hotel and Casino. At the time of the announcement, 70 percent of the project's 600 units had been reserved.\n\nUnits would range from to , and would range in price from $400,000 to more than $700,000. Although the tower was to be 45 stories high, it would skip the 13th floor. The tower's penthouses, starting at $1 million, would be located from floors 39 to 44, and would range from to more than . Restaurants and retail were planned for the tower's first and second floors. The third floor was to consist of a recreation center and pool for condominium owners and renters. A rooftop restaurant was also planned. JMA Architecture Studios was the architect. Perini Construction Company was to be the general contractor. Krystle Sands was to cost $400 million, and was to begin construction in October 2004, with an opening in summer 2006.\n\nSchinz paid more than $26.2 million for the land, and closed on the deal in July 2004. The project was to be handled by Krystle Sands LLC, a limited liability company formed by Schinz in Florida. The company name was later changed to Krystle Towers LLC. In March 2005, Schinz sold Krystle Towers LLC and the property for $97 million to Turnberry Associates, which owned the Turnberry Place complex and the former land of the El Rancho. To avoid paying a real estate transfer tax, Turnberry purchased the Krystle Sands project in addition to the property on which it was to be built. Turnberry announced the cancellation of Krystle Sands to buyers in a letter on March 25, 2005, stating that it was unable to receive construction financing to build the project.\n\nShortly after the cancellation was announced, some buyers of the project's condominium units filed five lawsuits against Schinz, Krystle Sands LLC, Krystle Towers LLC, and Fidelity National Title Agency of Nevada. One lawsuit sought class-action status. Each lawsuit alleged that Schinz never planned to build the tower and was in the process of seeking a buyer for the property while selling the project's 600 units, in an alleged attempt to make what would ultimately become a $70 million profit. Other claims in the lawsuits included allegations of fraud, deceptive trade practices and civil conspiracy. Plaintiffs sought at least $70 million in damages, as well as the return of escrow money to the buyers. One lawsuit alleged that Turnberry had made false statements regarding its reason for cancelling Krystle Sands, noting that four days earlier, Turnberry had announced that it received construction financing for a separate 636-unit tower at its Turnberry Place complex.\n\nA class action lawsuit consisting of 150 buyers was underway by June 2006, alleging that Turnberry had an obligation to provide condominium units to buyers who signed purchase and sale agreements and placed 10 percent of the purchase price in escrow. Turnberry stated that all deposits made on Krystle Sands units had been returned and that the company had no intention of building the project. A lawyer representing the group alleged that Turnberry lied to buyers about being unable to obtain construction financing for Krystle Sands as part of an attempt to build the Fontainebleau resort on the property: \"They had to figure a way to lie to buyers and not tell the truth that they're going to jettison the project to build Fountainbleu [sic].\" The case was expected to go to trial in March 2007.\n\nAnnounced in March 2005, as a joint project between Centra Properties and The Related Companies. The $3 billion Las Ramblas project was planned as a mixed-use complex that would have included 11 high-rise buildings, which would be used for hotel rooms and condominiums. with a total of 4,400 units. The complex, designed by Arquitectonica, would also include a small casino and up to of retail stores. Las Ramblas was to replace the 996-unit Harbor Island apartments, as well as 14 four-plex buildings, all located east of the Las Vegas Strip on Harmon Avenue. In August 2005, actor George Clooney and nightclub developer Rande Gerber announced that they would invest in the project. Because of a declining market and rising construction costs, Las Ramblas was cancelled in 2006, and the property was subsequently sold to Edge Resorts, which planned to construct a boutique hotel district to accompany their proposed W resort, located on adjacent land. Las Ramblas was to begin construction in September 2006, with its first phase scheduled to open in June 2007.\n\nLas Vegas Plaza was planned as a multibillion-dollar resort on the site of the demolished New Frontier hotel and casino. The project was to include 2,600 condominium units. The project never materialized, and in 2014, the property was sold to Crown Resorts, which planned to build the Alon Las Vegas on the site.\n\nLiberty Tower was announced in June 2004, as a 21-story building to be built on at 1801 South Las Vegas Boulevard, at the southern end of downtown Las Vegas. The project would be located north of the Stratosphere tower and near the Las Vegas Arts District, on land that was purchased for $900,000. The project was designed by JMA Architecture Studios and was to be developed by Harvard Securities of Australia. Groundbreaking was expected by November 2004, with completion occurring a year and a half later at a cost of $35 million.\n\nIn August 2004, the 21-story project was approved by the Las Vegas City Council to include 18 condominium units, 116 apartments, and of ground-level retail space. That month, it was announced that Australian developers Joseph Di Mauro and Victor Altomare would finance the project, which they also planned to do for The Summit. By January 2005, the closed Holy Cow Casino and Brewery (the planned future site of The Summit) had been converted into a $1 million sales office for Liberty Tower. At that time, construction on the project was expected to begin in July 2005, with a cost of $100 million.\n\nConstruction of Liberty Tower never began. In December 2005, Altomare sold the property for $5.5 million to Stratorise South, a limited liability company based in Nevada. That month, plans were announced for a $105 million condominium project called Monument to be built on the property. The project was to be 22 stories, with 236 units, and was to be developed by Constellation Property Group, an Australia-based company owned by Eugene Marchese, with financing by partner David Rifkind. By August 2006, a new project known as Stratorise was being planned for the property. The project would stand 517 feet, and would include 45 stories. In September 2006, a hearing on the proposed project was delayed until November 1, 2006, at the request of the owner.\n\nMajestic Las Vegas was announced in February 2004, and was to be built on the property occupied by the La Concha Motel on the Las Vegas Strip. Majestic Las Vegas initially was to consist of a 42-story tower, although the project later went through several redesigns, before being cancelled in 2007.\n\nIn August 2004, Chris DelGuidice, who was developing Vegas Grand through his Del American company, announced plans for a second project to be known as One Las Vegas. The project would include a 565-foot 50-story condominium tower with 542 units, to be built at a cost of $500 million on 10 acres of land on Flamingo Road, east of the Palms Casino Resort. DelGuidice negotiated for a year and a half to purchase the property.\n\nEarly design plans included a 400-foot waterfall, rooftop hot tubs, a dance floor, a gourmet grocer, restaurants, a pool with cabanas, a health spa on the 35th floor, valet and housekeeping services, 24-hour concierge, a pet park, and a business center. Sales were expected to begin in early 2005, with prices starting at $500,000 and exceeding $10 million. Groundbreaking was reported to be a year away. The following month, construction was scheduled to begin in summer 2005. The project was to be financed by Lehman Brothers, with a loan of up to $79.45 million. Lehman Brothers also financed Vegas Grand.\n\nDel American closed escrow on the property in January 2005, at a cost of $50 million. In February 2005, Amland Development took legal action against Del American to continue using the name for its own condominium project, also known as One Las Vegas. Amland Development won the right to use the name. In November 2005, Del American announced that the project would be named Vegas 888. The sales office for Vegas 888 closed in July 2006, at which point the property was reportedly for sale. Approximately $250 million worth of condominium units had been presold, with approximately $75 million spent on the project, most of which came from Lehman Brothers. In August 2006, Del American announced intentions to instead build a mixed-use resort, hotel and casino on the property.\n\nThe new project remained un-built. In 2007, the property was foreclosed and acquired by Lehman Brothers. Christopher Beavor, a Las Vegas investor, purchased the property in October 2016, at a cost of $13.5 million. Beavor's initial, unfinalized plans included retail space, a five-story apartment complex, and a hotel, with construction expected to begin in six to seven months.\n\nThe Opus Las Vegas was approved in November 2004, and was announced on March 25, 2005, at a conference that was related to high-rise development and was held at the Bellagio resort on the Las Vegas Strip. The $550 million project would have consisted of two 50-story towers with 350 condominium units each, for a total of 700. The project, to be developed by The Congress Group of Boston, was planned for a property that was presently occupied by the city's Scandia Family Fun Center, located west of the Las Vegas Strip at 2900 Sirius Avenue. Up to that point, The Congress Group had spent a year determining construction costs. Scandia and The Congress Group agreed to delay the initial escrow closing date of May 2005, so that final costs for the new project could be completed. As part of the agreement, the Scandia fun center would remain open through the summer, its busiest period, before its scheduled closing date on September 6, 2005.\n\nAt the time of the announcement, the property was in the process of being sold by Highrise Partners to The Congress Group for an undisclosed amount of money, with escrow expected to close in September 2005. Groundbreaking was expected to occur in the first quarter of 2006, with the first units available for occupancy in spring 2008. Opus Las Vegas would have featured 1,400 parking spaces spread across four levels, along with of residential retail stores. A pool would be located on the property's six-story deck. Floor plans would have ranged from , and would have come in one-, two-, and three-bedroom designs, while the top two floors would be occupied by two-story penthouses. Prices would have ranged from $200,000 to more than $4 million. Developer Michael Jabara said the project would offer \"a metropolitan lifestyle for people who really want it all, great views, easy access to nearby neighborhood amenities, but at the same time it's an urban project.\"\n\nIn June 2005, Scandia said their fun center would remain open as the property had not been sold. On September 7, 2005, Fisher Brothers purchased the property occupied by Scandia, as well as nearby land. In December 2006, Station Casinos and Fisher Brothers announced a joint venture to develop a mixed-use project on up to of land, including the property of the closed Scandia fun center, which was demolished in 2007. As of July 2007, the mixed-use project was to be developed on nearly of land, which had been zoned for several thousand high-rise condominium or hotel units, and would have connected to Station's nearby Palace Station resort. Details about the new project's construction and costs were still undetermined at that time. In 2011, a business named Dig This opened on the vacant property, allowing customers to take control of an excavator on the dirt lot.\n\nA casino and hotel/hotel-condo resort with more than 1,800 units that was planned by Royal Palms Las Vegas, a subsidiary of Royal Palms Communities. The project was to replace the Klondike Hotel and Casino at the south end of the Las Vegas Strip, beside the Las Vegas welcome sign. The resort was approved in October 2006, but an investor pulled out of the project in August 2007, and the land was put up for sale in May 2008.\n\nPinnacle was to include 1,100 condominium units in two 36-story gold glass towers that would be adjoined by three sky bridges, which would contain units themselves. Plans were announced for Pinnacle in March 2005. At that time, the mixed-use project would include two 40-story condominium towers, standing 410 feet, to be built on a property at the southwest corner of West Tropicana Avenue and Cameron Avenue, across from The Orleans hotel-casino. The land was occupied at that time by the Falconi Honda automobile dealership, which closed in October 2004. The property had been owned by Angelo Falconi since 1987.\n\nThe project was being planned by The Falcon Group, an automobile dealership firm; Elysium Enterprises, a local consulting firm; and Praxis Resources Inc., a development company based in Pittsburgh. Initial plans included retail, office, and restaurant space, and between 592 and 1,184 condominium units, which would range from to , with prices between $295,000 and $1.2 million. Condominium buyers would be given the option of combining units into a single unit.\n\nThe search for a general contractor was underway by November 2005, with Turner Construction ultimately being chosen. In March 2006, Falcon chose Youngblood Wucherer Sparer Architects to design the project, for which the height had been reduced to 36 stories. The project's cost, at that time, was $850 million. In June 2006, The Falcon Group began negotiations with Berkshire Capital Financial of New York for a $550 million loan, while Pinnacle's sales office was scheduled to open later that month. Berkshire provided $50 million in mezzanine lending. Groundbreaking was initially scheduled for fall 2006.\n\nThe Falconi Honda dealership was demolished in July 2007, to make room for the new project. Up to that time, Falcon Group had spent two years to plan the project and to obtain entitlements and zoning. At the time, the property for Pinnacle was valued at approximately $8 million per acre. By the time of demolition, Marnell Corrao Associates had been chosen as the new general contractor. Groundbreaking was scheduled for later in 2007, with the opening planned for spring 2010. Approximately 2,000 construction jobs would be created by the project, which would ultimately employee 500 people upon opening. At that time, condominium prices were from the $400,000 range to more than $1.4 million. Amenities were to include a wet deck, a movie theater, a health and fitness center, restaurants, a spa, and an office and business center. Michael Bellon, managing partner for The Falcon Group, said, \"We wanted to create something that single-handedly redefined the standard of Las Vegas condominium living.\" Later in summer 2007, Marnell Corrao was replaced by Dick Pacific Construction, which also became a partner in the project. In October 2007, after repeated delays, groundbreaking was announced to begin by mid-2008.\n\nIn January 2008, Green Cable LLC filed a class action lawsuit on behalf of Pinnacle condominium buyers. Green Cable sued the development team for an alleged breach of contract, as construction had yet to begin after three years. The lawsuit stated that buyers initially purchased units with the belief that Pinnacle would be opened by August 2008, and sought at least $5 million in returned deposits, damages and attorney's fees. The lawsuit also alleged that the property site was contaminated with high benzene levels because of dropping ground water levels. Sam Schwartz, a principal for Green Cable, said, \"Generally, we believe Pinnacle is an excellent project. At this point in time, however, due to the construction delays the project has endured, the buyers I represent, including myself, believe it is in the best interests of all the parties that we go our separate ways.\" Pinnacle's sales gallery closed on February 22, 2008, and the project's cancellation was announced on March 3, 2008.\n\n was being planned by Florida developer Renzo Renzi as of June 2006. Renzi Towers was to be built in downtown Las Vegas, at the corner of Main Street and Charleston Boulevard. Renzi Towers, designed by Kobi Karp Architecture & Interior Design, would have included a 63-story tower with 1,011 units. The project did not materialize.\n\nIn 1995, Thomas Greenough relocated his bar and restaurant, Tommy Rocker's, to Dean Martin Drive, west of Interstate 15 and the Las Vegas Strip. In 2004, Greenough began receiving numerous offers from condominium developers for the one-acre lot that Tommy Rocker's occupied. Greenough, who was unable to work out a deal with potential developers that would incorporate Tommy Rocker's into any planned condominiums, later chose to build his own condominium on the property. In January 2006, Greenough received approval for a 46-story, 252-unit condominium tower, to be constructed on his property at a cost of $150 million. The structure was to be named Rocker Tower.\n\nThe tower was expected to be the first in southern Nevada to feature a computerized automated parking structure, with the intention of saving space and decreasing pollution. Greenough had toured Viennese parking garages as part of his research into automated-garage technology. Greenough hoped that the building would be certified by the Leadership in Energy and Environmental Design Green Building Rating System. Construction was expected to begin approximately one year later, with completion expected in summer 2008. Later in 2006, construction was scheduled to begin in fall 2007, with completion scheduled for January 2009. By January 2007, Greenough had shelved his plans to build the condominium due to increasing labor and material costs in the Las Vegas Valley.\n\nThe Sandhurst was announced in October 2004. The project, to be located in downtown Las Vegas, would have included a 35-story tower with 398 units. The tower would have had a total of , including of commercial space for shops and restaurants. Two additional towers and commercial space for the project were also planned for nearby land. Groundbreaking was initially planned to begin in March 2005, with completion expected by September 2006. However, construction was delayed several times because of rising construction costs. The project was ultimately cancelled in 2007, and the Grand Central Hotel was announced for the property a year later.\n\nThe Harmon hotel, located within MGM's CityCenter complex, initially was to include 207 condominiums. Construction on the building stopped in 2008, after structural defects were discovered. MGM later had the building demolished in 2015.\n\nOriginally announced as The Summit in August 2004, and renamed as Ivana Las Vegas in 2005, when Ivana Trump became involved in the project. Ivana Las Vegas would have consisted of a $500 million, 73-floor tower with 945 condominium units. The tower was to begin construction in summer 2006, at the north end of the Las Vegas Strip, on of land that was occupied by the closed Holy Cow Casino and Brewery at the time. Ivana Las Vegas had been scheduled for completion in December 2008, but was cancelled in December 2005, due to rising construction costs.\n\nVegas Grand was announced by developer Del American in 2003, and initially was to consist of 440 apartments and 440 condominiums. The apartment aspect was removed later that year because of rising construction costs, with all 880 units to be used as condominiums. Construction began east of the Las Vegas Strip in March 2006. Vegas Grand was co-financed by Lehman Brothers, which took over the project in 2007, after Del American defaulted on its loan. The project was ultimately completed as an apartment complex known as Las Vegas Grand.\n\nW Las Vegas was announced as a condo hotel in 2005. The project was expanded in 2006, after the purchase of adjacent land that was to be used for Las Ramblas. W Las Vegas was cancelled in 2007, before beginning construction.\n\n"
            ],
            "good_message": false,
            "loggedData": [],
            "offensive": null,
            "selectedData": [],
            "shown_passages": [
                [
                    "Las Vegas Valley",
                    [
                        "The Las Vegas Valley is a major metropolitan area in the southern part of the U.S. state of Nevada.",
                        "The state's largest urban agglomeration, it is the heart of the Las Vegas–Paradise-Henderson, NV MSA.",
                        "The Valley is largely defined by the Las Vegas Valley landform, a basin area surrounded by mountains to the north, south, east and west of the metropolitan area.",
                        "The Valley is home to the three largest incorporated cities in Nevada: Las Vegas, Henderson and North Las Vegas.",
                        "Five unincorporated towns governed by the Clark County government are part of the Las Vegas Township and constitute the largest community in the state of Nevada."
                    ]
                ],
                [
                    "History of Las Vegas",
                    [
                        "This history of Las Vegas covers both the city of Las Vegas, Nevada, and the Las Vegas Valley.",
                        "The name Las Vegas was given to the area in 1821 by Rafael Rivera, a member of the Antonio Armijo trading party that was traveling to Los Angeles, and stopped for water there on the Old Spanish Trail from New Mexico.",
                        "At that time, several parts of the valley contained artesian wells surrounded by extensive green areas; \"Las Vegas\" means the meadows in Spanish.",
                        "The flows from the wells fed the Las Vegas Wash, which runs to the Colorado River.",
                        "The prehistoric landscape of the Las Vegas Valley and most of Southern Nevada was once a marsh with water and vegetation."
                    ]
                ],
                [
                    "Las Vegas",
                    [
                        "Las Vegas (, Spanish for \"The Meadows\"), officially the City of Las Vegas and often known simply as Vegas, is the 28th-most populated city in the United States, the most populated city in the state of Nevada, and the county seat of Clark County.",
                        "The city anchors the Las Vegas Valley metropolitan area and is the largest city within the greater Mojave Desert.",
                        "Las Vegas is an internationally renowned major resort city, known primarily for its gambling, shopping, fine dining, entertainment, and nightlife.",
                        "The Las Vegas Valley as a whole serves as the leading financial, commercial, and cultural center for Nevada."
                    ]
                ],
                [
                    "List of condominiums in Las Vegas",
                    [
                        "Since the 1990s, various condominium projects have been proposed for the Las Vegas Valley.",
                        "Park Towers and Turnberry Place, two high-rise condominium properties located near the Las Vegas Strip, were completed in 2001; they subsequently inspired a condominium boom that started in 2003, when various developers began announcing projects that were planned throughout the Las Vegas Valley.",
                        "Many projects were ultimately cancelled because of a rise in construction costs, as well as a lack of skilled construction workers and contractors who were qualified to build high-rises; both reasons were attributed to the large number of projects being announced."
                    ]
                ]
            ],
            "speaker": "0_Wizard",
            "text": "Las Vegas seems interesting. I love casinos",
            "time": 1568483509.2129815,
            "turn": 1
        },
        {
            "checked_passage": {
                "no_passages_used": "no_passages_used"
            },
            "checked_sentence": {
                "no_passages_used": "no_passages_used"
            },
            "clicked_passages": {},
            "full_passages": [
                "Las Vegas Valley\n\nThe Las Vegas Valley is a major metropolitan area in the southern part of the U.S. state of Nevada. The state's largest urban agglomeration, it is the heart of the Las Vegas–Paradise-Henderson, NV MSA. The Valley is largely defined by the Las Vegas Valley landform, a basin area surrounded by mountains to the north, south, east and west of the metropolitan area. The Valley is home to the three largest incorporated cities in Nevada: Las Vegas, Henderson and North Las Vegas. Five unincorporated towns governed by the Clark County government are part of the Las Vegas Township and constitute the largest community in the state of Nevada.\n\nThe names Las Vegas and Vegas are interchangeably used to indicate the Valley, the Strip, and the city, and as a brand by the Las Vegas Convention and Visitors Authority to denominate the region. The Valley is affectionately known as the \"ninth island\" by Hawaii natives and Las Vegans alike, in part due to the large number of people originally from Hawaii who live in and regularly travel to Las Vegas.\n\nSince the 1990s the Las Vegas Valley has seen exponential growth, more than doubling its population of 741,459 in 1990 to more than 2 million estimated in 2015. The Las Vegas Valley remains one of the fastest growing metropolitan areas in the United States, and in its relatively short history has established a diverse presence in international business, commerce, urban development and entertainment, as well as one of the most iconic and most visited tourist destinations in the world. In 2014, a record breaking 41 million visited the Las Vegas area, producing a gross metropolitan product of more than $100 billion.\n\nThe first reported non-Native American visitor to the Las Vegas Valley was the Mexican scout Rafael Rivera in 1829. Las Vegas was named by Mexicans in the Antonio Armijo party, including Rivera, who used the water in the area while heading north and west along the Old Spanish Trail from Texas. In the 19th century, areas of the valley contained artesian wells that supported extensive green areas, or meadows, hence the name \"Las Vegas\" (\"vegas\" being Spanish for \"meadows\").\n\nThe area was previously settled by Mormon farmers in 1854 and later became the site of a United States Army fort in 1864, beginning a long relationship between southern Nevada and the U.S. military. Since the 1930s, Las Vegas has generally been identified as a gaming center as well as a resort destination, primarily targeting adults.\n\nNellis Air Force Base is located in the northeast corner of the valley. The ranges that the Nellis pilots use and various other land areas used by various federal agencies, limit growth of the valley in terms of geographic area.\n\nBusinessman Howard Hughes arrived in the late 1960s and purchased many casino hotels, as well as television and radio stations in the area. Legitimate corporations began to purchase casino hotels as well, and the mob was run out by the federal government over the next several years. The constant stream of tourist dollars from the hotels and casinos was augmented by a new source of federal money from the establishment of what is now Nellis Air Force Base. The influx of military personnel and casino job-hunters helped start a land building boom which is now leveling off.\n\nThe Las Vegas area remains one of the world's top entertainment destinations.\n\nThe valley is contained in the Las Vegas Valley landform. This includes the cities of Las Vegas, North Las Vegas, and Henderson, and the unincorporated towns of Summerlin South, Paradise, Spring Valley, Sunrise Manor, Enterprise, Winchester, and Whitney. The valley is technically located within the larger metropolitan area, as the metropolitan area covers all of Clark County including parts that do not fall within the valley.\n\nThe government of Clark County has an \"Urban Planning Area\" of Las Vegas. This definition is a roughly rectangular area, about from east to west and from north to south. Notable exclusions from the \"Urban Planning Area\" include Red Rock, Blue Diamond, and Mount Charleston.\n\nThe Las Vegas Metropolitan Police Department is the largest police department in the valley and the state and exercises jurisdiction in the entire county. There are approximately 3,000 police officers that cover the city of Las Vegas; unincorporated areas; the town of Laughlin, about from Downtown Las Vegas; and desert, park, and mountain areas within Clark County. The department does not exercise primary jurisdiction in areas with separate police forces such as North Las Vegas, Henderson, Boulder City, Nellis Air Force Base and the Paiute reservation.\n\nThe Las Vegas Valley lies in the Mojave Desert. The surrounding land is desert with mountains in the distance.\n\nThe Las Vegas Valley lies in a relatively high-altitude portion of the Mojave Desert, with a subtropical hot-desert climate. The Valley generally averages less than of rain annually. Daily daytime summer temperatures in July and August typically range from to , while nights generally range from to . Very low humidity, however, tempers the effect of these temperatures, though dehydration, heat exhaustion, and sun stroke can occur after even a limited time outdoors in the summer. The interiors of automobiles often prove deadly to small children and pets during the summer and surfaces exposed to the sun can cause first- and second-degree burns to unprotected skin. July and August can also be marked by \"monsoon season\", when moist winds from the Gulf of California soak much of the Southwestern United States. While not only raising humidity levels, these winds develop into dramatic desert thunderstorms that can sometimes cause flash flooding.\n\nWinters in the Las Vegas Valley are typically chilly, but sunny. Winter highs in December and January usually range from to , while nighttime lows range from to . The mountains surrounding the valley are snow-covered during the winter season, but snow accumulation in the area itself is uncommon. Every few years apart, however, Las Vegas does get a measurable snowfall.\n\nSpring and fall are generally warm to hot.\n\nThe valley has seven known earthquake fault zones; Frenchman Mountain Fault; Whitney Mesa Fault; Cashman Fault; Valley View Fault; Decatur Fault; Eglington Fault; West Charleston Fault.\n\nHaving part of the region in a desert basin creates issues with air quality. From the dust the wind picks up, to the smog produced by vehicles, to the pollen in the air, the valley has several bad air days.\n\nPollen can be a major issue several weeks a year, with counts occasionally in the 70,000-plus range. Local governments are trying to control this by banning plants that produce the most pollen.\n\nThe dust problems usually happen on very windy days, so they tend to be short and seasonal. Full-fledged dust storms are rare.\n\nSmog, on the other hand, gets worse when there is no wind to move the air out of the valley. Also, in winter it is possible for an inversion to form in the valley.\n\nSince manufacturing is not a dominant industry of Las Vegas, and with Clark County working to control air quality problems, success has been shown over the years.\n\nThe native flora does little to help the soil retain water. During the intense rains of monsoon season or (relatively) wet months of January and February, a network of dry natural channels, called washes or arroyos, carved into the valley floor allows water to flow down from the mountains and converge in the Las Vegas Wash which runs through the Clark County Wetlands Park. The wash system used to form a large natural wetlands which then flowed into the Colorado River, until the construction of Hoover Dam on the Colorado River led to the creation of Lake Mead. Further development in the 1980s and 1990s made Lake Las Vegas, which required directing the Las Vegas Wash into tunnels which run under Lake Las Vegas and into Lake Mead.\n\nNevada receives an allocation of water each year from Lake Mead, with credits for water it returns to the lake. The allocations were made with the Colorado River Compact when Nevada had a much smaller population and very little agriculture. The allocations were also made during a wet string of years, which overstated the available water in the entire watershed. As a result, precipitation that is below normal for a few years can significantly affect the Colorado River reservoirs. The Las Vegas area uses most of this allocation with Laughlin, Nevada using most of the remaining allocation. In June 2007, the price of a cubic meter was 57 cents in Las Vegas. Las Vegas gets around 90 percent of its water from Lake Mead.\n\nEarly Vegas depended on the aquifer which fed the flowing springs supporting the meadows that gave the area its name, but the pumping of water from these caused a large drop in the water levels and ground subsidence over wide areas of the valley. Today, the aquifers are basically used to store water that is pumped from the lake during periods of low demand and pumped out during periods of high demand.\n\nThe population doubling time in the greater metropolitan area was under ten years, since the early 1970s and the Las Vegas metropolitan area now has a population approaching two million people. This rapid population growth led to a significant urbanization of desert lands into industrial and commercial areas (see suburbia).\n\nThe driving force in Las Vegas is the tourism industry and the area has about 150,000 hotel rooms, more than any other city in the world. In the past, casinos and celebrity shows were the two major attractions for the area. Now shopping, conventions, fine dining, and outdoor beauty are also major forces in attracting tourist dollars.\n\nLas Vegas serves as world headquarters for the world's two largest Fortune 500 gaming companies, Caesars Entertainment and MGM Resorts International. Several companies involved in the manufacture of electronic gaming machines, such as slot machines, are located in the Las Vegas area. In the first decade of the 21st century, shopping and dining have become attractions of their own. Tourism marketing and promotion are handled by the Las Vegas Convention and Visitors Authority, a county-wide agency. Its annual Visitors Survey provides detailed information on visitor numbers, spending patterns, and resulting revenues.\n\nWhile Las Vegas has historically attracted high-stake gamblers from around the world, it is now facing tougher competition from the UK, Hong Kong and Macau (China), Eastern Europe and developing areas in the Middle East.\n\nLas Vegas has recently enjoyed a boom in population and tourism. The urban area has grown outward so quickly that it borders Bureau of Land Management holdings along its edges. This has led to an increase in land values such that medium- and high-density development is occurring closer to the core. The Chinatown of Las Vegas was constructed in the early 1990s on Spring Mountain Road. Chinatown initially consisted of only one large shopping center complex, but the area was expanded with shopping centers that contain various Asian businesses. Over the past few years, retirees have been moving to the metro area, driving businesses that support them from housing to health care.\n\nWhile the cost of housing spiked up over 40% in 2004, the lack of business and income taxes still makes Nevada an attractive place for many companies to relocate to or expand existing operations. Being a true twenty-four-hour city, call centers have always seemed to find Las Vegas a good place to hire workers who are accustomed to working at all hours.\n\nThe construction industry accounts for a share of the economy in Las Vegas. Hotel casinos planned for the Strip can take years to build and employ thousands of workers. Developers discovered that there was demand for high-end condominiums. By 2005, more than 100 condominium buildings were in various stages of development, however, in 2008, the construction industry went into a downturn due to the credit crunch, though the industry has since seen a rebound.\n\nIn 2000 more than 21,000 new homes and 26,000 resale homes were purchased. In early 2005 there were 20 residential development projects of more than each underway. During that same period, Las Vegas was regarded as the fastest-growing community in the United States.\n\nOther promising residential and office developments have begun construction around Downtown Las Vegas. New condominium and high-rise hotel projects have changed the Las Vegas skyline dramatically in recent years. Many large high-rise projects are planned for Downtown Las Vegas, as well as the Las Vegas Strip.\nConstruction in Las Vegas is a major industry and quickly growing with the population. In March 2011, construction employed 40,700 people and is expected to grow with the recovering economy. Since the mega resorts that have defined Las Vegas today, began going up in the early 1970s, construction has played a vital role in both commercial and non commercial developments. Cranes are a constant part of the Las Vegas Skyline. At any given time there are 300 new homes being constructed in Las Vegas. Downtown and The Strip always have at least one hospitality project under construction. In addition, in recent years Las Vegas has seen a spike in high-rise housing units. Luxurious condos and penthouse suites are always being built. New suburban master planned communities are also becoming common in Las Vegas ever since The Howard Hughes Corporation began work on Summerlin, an upper-class community on the west side of the valley.\n\nThe massive project CityCenter broke ground on June 26, 2006. Now completed at 3780 Las Vegas Boulevard South, it is the largest privately funded building complex in the world. At a cost of $9.2 billion, CityCenter was one of the largest projects in Vegas history. It put a massive strain on the construction ability and workforce of the area due to number of laborers and amount of materials required. Because of this, prices of almost any construction project in Las Vegas doubled. It is currently held by MGM Resorts International and has three hotels, two condo towers, and a hotel-condo building along with a large shopping and entertainment center.\n\nTraditionally, housing consisted primarily of single-family detached homes. Slab-on-grade foundations are the common base for residential buildings in the valley. Apartments generally were two story buildings. Until the 1990s, there were exceptions, but they were few and far between. In the 1990s, Turnberry Associates constructed the first high rise condominium towers. Prior to this, there were only a handful of mid-rise multi-family buildings. By the mid-2000s, there was a major move into high rise condominiums towers, which affected the region's skyline around the Strip.\n\nThe Las Vegas Valley is home to various suburban master planned communities that include extensive recreational amenities such as lakes, golf courses, parks, bike paths and jogging trails. Planned communities in the valley include Aliante, Anthem, Centennial Hills, Green Valley, Inspirada, The Lakes, Mountain's Edge, Peccole Ranch, Silverado Ranch, Seven Hills, Southern Highlands, and Summerlin.\n\nSome technology companies have either relocated to Las Vegas or were created there. For various reasons, Las Vegas has had a high concentration of technology companies in electronic gaming and telecommunications industries.\n\nSome current technology companies in southern Nevada include: Bigelow Aerospace, Petroglyph, Switch Communications, US Support LLC, and Zappos.\n\nIn 2015, Electric vehicle startup Faraday Future has chosen North Las Vegas's Apex Industrial Park for its $1 billion car factory.\n\nCompanies that originally were formed in the Las Vegas region, but have since sold or relocated include Westwood Studios (sold to Electronic Arts), Systems Research & Development (Sold to IBM), Yellowpages.com (Sold to BellSouth and SBC), and MPower Communications.\n\nThe major attractions in the Las Vegas Valley are the hotel/casinos. These hotels generally consist of large gambling areas, theaters for live performances, shopping, bars/clubs, and several restaurants and cafes. There are clusters of large hotel/casinos located in both downtown Las Vegas and on the Las Vegas Strip. The largest hotels are mainly located on the Strip, which is a four-mile section of Las Vegas Boulevard. These hotels provide thousands of rooms of various sizes. Fifteen of the world's 25 largest hotels by room count are on the Strip, with a total of over 62,000 rooms. There are many hotel/casinos in the city's downtown area as well, which was the original focal point of the Valley's gaming industry. Several hotel/casinos ranging from large to small are also located around the city and metro area. Many of the largest hotel, casino, and resort properties in the world are located on the Las Vegas Strip.\n\nThe valley's casinos can be grouped into several locations. The largest is the Las Vegas Strip, followed by Downtown Las Vegas, and then the smaller Boulder Strip. There are also several one-off single standing hotel/casinos dotted around the valley and the metro area.\n\nLas Vegas has expanded its attractiveness to visitors by offering both affordable and high-end merchandise in many shops and shopping malls. Many hotels on the Las Vegas Strip also have adjacent shopping malls, giving the Las Vegas area the highest concentration of shopping malls in any four mile stretch of road. In addition to the malls on the Strip, there are several outlying malls in the City of Las Vegas, Henderson, and the surrounding area. The monorail, lying somewhat east of the Strip, facilitates north–south travel, including stations at several casinos and the Las Vegas Convention Center.\n\nLas Vegas holds many of the world's largest conventions each year, including CES, SEMA, and Conexpo. The Las Vegas Convention Center is one of the largest in the world with 1,940,631 sq ft (180,290.5 m) of exhibit space. These events bring in an estimated $7.4 billion of revenue to the city each year, and host over 5 million attendees.\n\n\nThe \"First Friday\" celebration, held on the first Friday of each month, exhibits the works of local artists and musicians in an area just south of downtown. The city is home to an extensive Downtown Arts District which hosts numerous galleries, film festivals, and events.\n\nThe Southern Nevada Zoological-Botanical Park, also known as the Las Vegas Zoo, exhibits over 150 species of animals and plants. The Zoo closed its doors in September, 2013.\n\nThe Shark Reef Aquarium at Mandalay Bay is the only aquarium that is accredited by the Association of Zoos and Aquariums in the state of Nevada. It features over 2,000 animals and 1,200 species in 1.6 million gallons of seawater.\n\nThe $485 million Smith Center for the Performing Arts is located downtown in Symphony Park. The center is appropriate for Broadway shows and other major touring attractions as well as orchestral, opera, choir, jazz, and dance performances.\n\nBellagio Gallery of Fine Art is a facility presenting high-quality art exhibitions from major national and international museums. Past exhibits have included the works of Andy Warhol, Alexander Calder, and Peter Carl Fabergé. A self-guided audio tour is also offered.\n\nThe Las Vegas Natural History Museum features robot dinosaurs, live fish, and more than 26 species of preserved animals. There are several \"hands-on\" areas where animals can be petted.\n\nThe Atomic Testing Museum, affiliated with the Smithsonian Institution, houses artifacts from the Nevada Test Site and records the dramatic history of the atomic age through a series of interactive modules, timelines, films, and actual equipment and gadgets from the site.\n\nThe valley is home to numerous other art galleries, orchestras, ballets, theaters, sculptures, and museums as well.\n\n\n\n\n\nLas Vegas is served by 22 television and 46 radio stations. The area is also served by two NOAA Weather Radio transmitters (162.55 MHz located in Boulder City and 162.40 MHz located on Mount Potosi).\n\n\n\nMcCarran International Airport (LAS) provides commercial flights into the Las Vegas Valley. The airport serves domestic, international, and cargo flights, as well as some private aircraft. General aviation traffic, however, will typically use the much smaller North Las Vegas Airport, or other airfields in the county.\nPublic transportation is provided by RTC Transit. Numerous bus routes cover Las Vegas, Henderson, North Las Vegas, and other suburban areas.\n\nThe Las Vegas Monorail runs from the MGM Grand Hotel at the south end of the Strip to the SLS Las Vegas at the north end of the Strip.\nThe street numbering system is divided by the following streets:\n\nUntil 1997, the Amtrak Desert Wind train service ran through Las Vegas using the Union Pacific Railroad (UP) rails that run through the city; Amtrak service to Las Vegas has since been replaced by Amtrak's Thruway Motorcoach bus service. Plans to restore Los Angeles to Las Vegas Amtrak service using a Talgo train have been discussed but no plan for a replacement has been implemented. The Las Vegas Amtrak station was located in the Plaza Hotel. It had the distinction of being the only train station located in a casino.\n\nTwo major freeways—Interstate 15 and Interstate 515/U.S. Route 95—cross in downtown Las Vegas. I-15 connects Las Vegas to the Southern California coastal urban centers of Los Angeles and San Diego, and heads northeast to and beyond Salt Lake City, Utah. I-515 goes southeast to Henderson, beyond which US 93 continues south of Hoover Dam over the new Mike O'Callaghan – Pat Tillman Memorial Bridge towards Phoenix, Arizona and the Arizona Sun Corridor. US 95 connects the city to northwestern Nevada, including Carson City and Reno. US 93 splits from I-15 northeast of Las Vegas and goes north through the eastern part of the state, serving Ely and Wells, and US 95 heads south from US 93 near Henderson through far eastern California. A three-quarters beltway has been built, consisting of Interstate 215 on the south and Clark County 215 on the west and north. Other radial routes include Blue Diamond Road (SR 160) to Pahrump and Lake Mead Boulevard (SR 147) to Lake Mead.\n\nWith the notable exceptions of Las Vegas Boulevard, Boulder Highway (SR 582), and Rancho Drive (SR 599), the majority of surface streets outside downtown Las Vegas are laid out along Public Land Survey System section lines. Many are maintained by the Nevada Department of Transportation as state highways.\n\n\nWhile the Las Vegas area does not have any passenger rail service, proposals to revive passenger trains to Las Vegas have included the Desert Xpress high-speed train from Victorville, California; the California-Nevada Interstate Maglev, which would extend to Anaheim, California, with its first segment being to Primm, Nevada. The Las Vegas Railway Express; and the Z-Train, which would travel six days a week between Los Angeles Union Station and a new Z-Train Station adjacent to the Strip; and the Desert Lightning to Los Angeles and Phoenix.\nLas Vegas receives about 30 freight trains per day in 2004, and serves as a district crew change point, requiring all trains to stop in downtown. Freight traffic was 179,284 cars in 2004.\n\n\nTwo major freeways—Interstate 15 and U.S. Route 95—cross in downtown Las Vegas. I-15 connects Las Vegas to Los Angeles and San Diego, and heads northeast to and beyond Salt Lake City. Interstate 515 goes southeast to Henderson, beyond which U.S. Route 93 continues past the Hoover Dam towards Phoenix, Arizona. US 95 connects the city to northwestern Nevada, including Carson City and Reno. US 93 splits from I-15 northeast of Las Vegas and goes north through the eastern part of the state, serving Ely and Wells, and US 95 heads south from US 93 near Henderson through far eastern California. A three-quarters beltway has been built, consisting of Interstate 215 on the south and Clark County 215 on the west and north. Other radial routes include SR 160 to Pahrump and SR 147 to Lake Mead.\n\nWith the notable exceptions of Las Vegas Boulevard, Boulder Highway, and Tonopah Highway (better known as the northern part of Rancho Drive), the majority of surface streets outside downtown Las Vegas are laid out along Public Land Survey System section lines. Many are maintained, in part, by the Nevada Department of Transportation as state highways.\n\n\n\nThe Las Vegas area is dependent on imported gasoline, diesel, and aviation fuel as is most of Nevada, which has only one refinery. The region is dependent on the Calnev Pipeline as its single supply. Limited diesel is delivered to a dedicated terminal in North Las Vegas by rail. Diversified supply is dependent on the planned UNEV pipeline.\n\nAbout 25% of the electric power from Hoover Dam goes to Nevada, and about 70% of power to Southern Nevada comes from natural gas fired power stations.\n\nLas Vegas is home to several notable minor league teams, as well as the UNLV Runnin' Rebels, and one major professional team, the Vegas Golden Knights of the NHL. The Las Vegas Raiders of the NFL will play in Las Vegas in 2019 or 2020.\n\nNote: The Raiders will move to Las Vegas in 2019 or 2020; the Raiders franchise dates back to 1960 when it began in Oakland, and also played in Los Angeles between 1982 and 1994.\n\nLas Vegas has many natural outdoor recreational options.\n\nThere are several multi-use trail systems within the valley operated by multiple organizations. The River Mountains Loop Trail is a trail that connects the west side of the valley with Hoover Dam and Lake Mead. Summerlin offers more than 150 miles of award-winning trails within the community. There are also the Angel Park Trail, Bonanza Trail, and the county's Flamingo Arroyo Trail, I-215 West Beltway Trail (), I-215 East Beltway Trail (), Tropicana/Flamingo Washes Trail and the Western Trails Park Area Equestrian Trails (4 miles).\n\nThe Las Vegas Valley also hosts world class mountain biking including Bootleg Canyon Mountain Bike Park located in Boulder City which boasts itself as one of the International Mountain Biking Association's \"epic rides\".\n\nThe Clark County School District operates all of the public primary and secondary schools in the county with the exception of a few which are contracted out to a private organization.\n\nThe University of Nevada, Las Vegas (UNLV) is in Paradise, about three miles (5 km) south of the city limits and roughly two miles east of the Strip. The University of Nevada Medical School has a campus near downtown Las Vegas. Several national colleges, including the University of Phoenix and Le Cordon Bleu, have campuses in the Las Vegas area. Nevada State College, National University and Touro University Nevada are nearby Henderson. The College of Southern Nevada has campuses in Las Vegas, North Las Vegas and Henderson. Henderson also is home to DeVry University and the Keller Graduate School of Management, as well as the University of Southern Nevada. Other private entities in the Las Vegas Valley include Apollo College and ITT Technical Institute.\n\n\n\n\n\n",
                "Las Vegas–Paradise, NV MSA\n\nThe Las Vegas–Paradise, NV MSA, also known as the Las Vegas–Henderson–Paradise, NV Metropolitan Statistical Area (2013), is in the southern part of the U.S. state of Nevada, coextensive since 2003 with Clark County, Nevada. A central part of the metropolitan area is the Las Vegas Valley, a basin that includes the metropolitan area's largest city, Las Vegas as well as the other primary city, Paradise, Nevada. The area contains the largest concentration of people in the state. Cities in the metropolitan area include Las Vegas, Henderson, North Las Vegas, and Boulder City. The metropolitan area is one of the top tourist destinations in the world, drawing over 40 million international and domestic visitors in 2013 with a GMP of US$103.3 billion.\n\nThe metropolitan area was created for the 1970 census when it only included Clark County. In 2000, the metropolitan area was changed to include Nye County, Nevada and Mohave County, Arizona. This area appears to have existed since at least 1967 when the census bureau defined the SMSAs outside New England as \"a county or group of contiguous counties which contains at least one city of 50,000 inhabitants in addition to the county or counties containing such a city or cities, contiguous counties are included in an SMSA if, according to certain criteria, they are socially and economically integrated with the central city.\"\n\nAs of the census of 2000, there were 1,375,765 people, 512,253 households, and 339,693 families residing within the MSA. The racial makeup of the MSA was 71.6% White (60.2% White Non-Hispanic), 9.1% Black, 5.7% Asian, 0.8% American Indian and 12.8% of other or mixed race. 22.0% were Hispanic of any race. As of 2009, the population in the metropolitan area had grown up to 1,902,834 people, being one of the fastest growing MSA in the United States.\n\nIn 1999, the median income for a household in the MSA was $44,616 and the median income for a family was $50,485. The per capita income was $21,785.\n\nThe United States Census Bureau 2009 estimates place the population for the Las Vegas Metropolitan Statistical Area at 1,902,834 people, and the region is one of the fastest growing in the United States. Large numbers of new residents in the state originate from California.\n\nThe Office of Management and Budget has designated Clark County as the Las Vegas-Henderson-Paradise, NV Metropolitan Statistical Area. The United States Census Bureau ranked the Las Vegas-Henderson-Paradise, NV Metropolitan Statistical Area as the 31st most populous metropolitan statistical area of the United States as of July 1, 2012.\n\nThe Office of Management and Budget has further designated the Las Vegas-Henderson-Paradise, NV Metropolitan Statistical Area as a component of the more extensive Las Vegas–Henderson, NV–AZ CSA, the 27th most populous combined statistical area and the 30th most populous primary statistical area of the United States as of July 1, 2012.\n\nIn calendar year 2011, the majority of tourists arrived from the western states (55%) with 31% from California alone. Approximately 16% of tourists arrived from outside North America.\n",
                "Nevada\n\nNevada (; see pronunciations) is a state in the Western, Mountain West, and Southwestern regions of the United States of America. Nevada is the 7th most extensive, the 34th most populous, but the 9th least densely populated of the 50 United States. Nearly three-quarters of Nevada's people live in Clark County, which contains the Las Vegas–Paradise metropolitan area where three of the state's four largest incorporated cities are located. Nevada's capital is Carson City. Nevada is officially known as the \"Silver State\" because of the importance of silver to its history and economy. It is also known as the \"Battle Born State\", because it achieved statehood during the Civil War (the words \"Battle Born\" also appear on the state flag); as the \"Sagebrush State\", for the native plant of the same name; and as the \"Sage-hen State\". Nevada borders Oregon to the northwest, Idaho to the northeast, California to the west, Arizona to the southeast and Utah to the east.\n\nNevada is largely desert and semi-arid, much of it within the Great Basin. Areas south of the Great Basin are within the Mojave Desert, while Lake Tahoe and the Sierra Nevada lie on the western edge. About 86% of the state's land is managed by various jurisdictions of the U.S. federal government, both civilian and military.\n\nBefore European contact, Native Americans of the Paiute, Shoshone, and Washoe tribes inhabited the land that is now Nevada. The first Europeans to explore the region were Spanish. They called the region \"Nevada\" (snowy) because of the snow which covered the mountains in winter. The area formed part of the Viceroyalty of New Spain, and became part of Mexico when it gained independence in 1821. The United States annexed the area in 1848 after its victory in the Mexican–American War, and it was incorporated as part of Utah Territory in 1850. The discovery of silver at the Comstock Lode in 1859 led to a population boom that became an impetus to the creation of Nevada Territory out of western Utah Territory in 1861. Nevada became the 36th state on October 31, 1864, as the second of two states added to the Union during the Civil War (the first being West Virginia).\n\nNevada has a reputation for its libertarian laws. In 1940, with a population of just over 110,000 people, Nevada was by far the least-populated state, with less than half the population of the next least-populated state. However, legalized gambling and lenient marriage and divorce laws transformed Nevada into a major tourist destination in the 20th century. Nevada is the only U.S. state where prostitution is legal, though it is illegal in Clark County (Las Vegas), Washoe County (Reno) and Carson City (which, as an independent city, is not within the boundaries of any county). The tourism industry remains Nevada's largest employer, with mining continuing as a substantial sector of the economy: Nevada is the fourth-largest producer of gold in the world.\n\nThe name \"Nevada\" comes from the Spanish \"nevada\" , meaning \"snow-covered\", after the Sierra Nevada (\"snow-covered mountain range\").\n\nMost Nevadans pronounce the second syllable of their state name using the vowel (). Many from outside the Western United States pronounce it with the vowel (). Although the latter pronunciation is closer to the Spanish pronunciation, it is not the pronunciation preferred by most Nevadans. State Assemblyman Harry Mortenson proposed a bill to recognize the alternate (quasi-Spanish) pronunciation of Nevada, though the bill was not supported by most legislators and never received a vote. The Nevadan pronunciation is the de facto official one, since it is the one used by the state legislature. At one time, the state's official tourism organization, TravelNevada, stylized the name of the state as \"Nevăda\", with a breve mark over the \"a\" indicating the locally preferred pronunciation which is also available as a license plate design.\n\nNevada is almost entirely within the Basin and Range Province, and is broken up by many north-south mountain ranges. Most of these ranges have endorheic valleys between them, which belies the image portrayed by the term Great Basin.\n\nMuch of the northern part of the state is within the Great Basin, a mild desert that experiences hot temperatures in the summer and cold temperatures in the winter. Occasionally, moisture from the Arizona Monsoon will cause summer thunderstorms; Pacific storms may blanket the area with snow. The state's highest recorded temperature was in Laughlin (elevation of ) on June 29, 1994. The coldest recorded temperature was set in San Jacinto in 1972, in the northeastern portion of the state.\n\nThe Humboldt River crosses the state from east to west across the northern part of the state, draining into the Humboldt Sink near Lovelock. Several rivers drain from the Sierra Nevada eastward, including the Walker, Truckee, and Carson rivers. All of these rivers are endorheic basins, ending in Walker Lake, Pyramid Lake, and the Carson Sink, respectively. However, not all of Nevada is within the Great Basin. Tributaries of the Snake River drain the far north, while the Colorado River, which also forms much of the boundary with Arizona, drains much of southern Nevada.\n\nThe mountain ranges, some of which have peaks above , harbor lush forests high above desert plains, creating sky islands for endemic species. The valleys are often no lower in elevation than , while some in central Nevada are above .\n\nThe southern third of the state, where the Las Vegas area is situated, is within the Mojave Desert. The area receives less rain in the winter but is closer to the Arizona Monsoon in the summer. The terrain is also lower, mostly below , creating conditions for hot summer days and cool to chilly winter nights.\n\nNevada and California have by far the longest diagonal line (in respect to the cardinal directions) as a state boundary at just over . This line begins in Lake Tahoe nearly offshore (in the direction of the boundary), and continues to the Colorado River where the Nevada, California, and Arizona boundaries merge southwest of the Laughlin Bridge.\n\nThe largest mountain range in the southern portion of the state is the Spring Mountain Range, just west of Las Vegas. The state's lowest point is along the Colorado River, south of Laughlin.\n\nNevada has 172 mountain summits with of prominence. Nevada ranks second in the United States by number of mountains, behind Alaska, and ahead of California, Montana, and Washington. Nevada is the most mountainous state in the contiguous United States.\n\nNevada is the driest state in the United States. It is made up of mostly desert and semi-arid climate regions, and, with the exception of the Las Vegas Valley, the average summer diurnal temperature range approaches in much of the state. While winters in northern Nevada are long and fairly cold, the winter season in the southern part of the state tends to be of short duration and mild. Most parts of Nevada receive scarce precipitation during the year. Most rain that falls in the state falls on the lee side (east and northeast slopes) of the Sierra Nevada.\n\nThe average annual rainfall per year is about ; the wettest parts get around . Nevada's highest recorded temperature is at Laughlin on June 29, 1994 and the lowest recorded temperature is at San Jacinto on January 8, 1937. Nevada's reading is the third highest statewide record high temperature of a U.S. state, just behind Arizona's reading and California's reading.\n\nThe vegetation of Nevada is diverse and differs by state area. Nevada contains six biotic zones: alpine, sub-alpine, ponderosa pine, pinion-juniper, sagebrush and creosotebush.\n\nNevada is divided into political jurisdictions designated as \"counties\". Carson City is officially a consolidated municipality; however, for many purposes under state law it is considered to be a county. As of 1919 there were 17 counties in the state, ranging from .\n\nLake County, one of the original nine counties formed in 1861, was renamed Roop County in 1862. Part of the county became Lassen County, California in 1864. The portion that remained in Nevada was annexed in 1883 by Washoe County.\n\nIn 1969, Ormsby County was dissolved and the Consolidated Municipality of Carson City was created by the Legislature in its place co-terminous with the old boundaries of Ormsby County.\n\nBullfrog County was formed in 1987 from part of Nye County. After the creation was declared unconstitutional the county was abolished in 1989.\n\nHumboldt county was designated as a county in 1856 by Utah Territorial Legislature and again in 1861 by the new Nevada Legislature.\n\nClark County is the most populous county in Nevada, accounting for nearly three-quarters of its residents. Las Vegas, Nevada's most populous city, has been the county seat since the county was created in 1909 from a portion of Lincoln County, Nevada. Before that, it was a part of Arizona Territory. Clark County attracts numerous tourists. An estimated 44 million people visited Clark County in 2014.\n\nWashoe County is the second most populous county of Nevada. Its county seat is Reno. Washoe County includes the Reno–Sparks metropolitan area.\n\nLyon County is the third most populous county. It was one of the nine original counties created in 1861. It was named after Nathaniel Lyon, the first Union General to be killed in the Civil War. Its current county seat is Yerington. Its first county seat was established at Dayton on November 29, 1861.\n\nFrancisco Garcés was the first European in the area, Nevada was annexed as a part of the Spanish Empire in the northwestern territory of New Spain. Administratively, the area of Nevada was part of the Commandancy General of the Provincias Internas in the Viceroyalty of New Spain. Nevada became a part of Alta California (\"Upper California\") province in 1804 when the Californias were split. \nWith the Mexican War of Independence won in 1821, the province of Alta California became a territory (state) of Mexico, with small population. \nJedediah Smith entered the Las Vegas Valley in 1827, and Peter Skene Ogden traveled the Humboldt River in 1828. When the Mormons created the State of Deseret in 1847, they laid claim to all of Nevada within the Great Basin and the Colorado watershed. They also founded the first white settlement in what is now Nevada, Mormon Station (modern day Genoa), in 1851. In June 1855, William Bringhurst and 29 fellow Mormon missionaries from Utah arrived at a site just northeast of downtown Las Vegas and built a 150-foot square adobe fort, the first permanent structure erected in the valley, which remained under the control of Salt Lake City until the winter of 1858-1859.\n\nAs a result of the Mexican–American War and the Treaty of Guadalupe-Hidalgo, Mexico permanently lost Alta California in 1848. The new areas acquired by the United States continued to be administered as territories. As part of the Mexican Cession (1848) and the subsequent California Gold Rush that used Emigrant Trails through the area, the state's area evolved first as part of the Utah Territory, then the Nevada Territory (March 2, 1861; named for the Sierra Nevada).\n\nSee History of Utah, History of Las Vegas, and the discovery of the first major U.S. deposit of silver ore in Comstock Lode under Virginia City, Nevada in 1859.\n\nOn March 2, 1861, the Nevada Territory separated from the Utah Territory and adopted its current name, shortened from \"Sierra Nevada\" (Spanish for \"snow-covered mountain range\").\n\nThe 1861 southern boundary is commemorated by Nevada Historical Markers 57 and 58 in Lincoln and Nye counties.\n\nEight days before the presidential election of 1864, Nevada became the 36th state in the union. Statehood was rushed to the date of October 31 to help ensure Abraham Lincoln's reelection on November 8 and post-Civil War Republican dominance in Congress, as Nevada's mining-based economy tied it to the more industrialized Union. As it turned out, however, Lincoln and the Republicans won the election handily, and did not need Nevada's help.\n\nNevada is one of only two states to significantly expand its borders after admission to the Union. (The other is Missouri, which acquired additional territory in 1837 due to the Platte Purchase.)\n\nIn 1866 another part of the western Utah Territory was added to Nevada in the eastern part of the state, setting the current eastern boundary.\n\nNevada achieved its current southern boundaries on January 18, 1867, when it absorbed the portion of Pah-Ute County in the Arizona Territory west of the Colorado River, essentially all of present-day Nevada south of the 37th parallel. The transfer was prompted by the discovery of gold in the area, and it was thought by officials Nevada would be better able to oversee the expected population boom. This area includes most of what is now Clark County and the Las Vegas metropolitan area.\n\nMining shaped Nevada's economy for many years (see \"Silver mining in Nevada\"). When Mark Twain lived in Nevada during the period described in \"Roughing It\", mining had led to an industry of speculation and immense wealth. However, both mining and population declined in the late 19th century. However, the rich silver strike at Tonopah in 1900, followed by strikes in Goldfield and Rhyolite, again put Nevada's population on an upward trend.\n\nUnregulated gambling was commonplace in the early Nevada mining towns but was outlawed in 1909 as part of a nationwide anti-gambling crusade. Because of subsequent declines in mining output and the decline of the agricultural sector during the Great Depression, Nevada again legalized gambling on March 19, 1931, with approval from the legislature. Governor Fred B. Balzar's signature enacted the most liberal divorce laws in the country and open gambling. The reforms came just eight days after the federal government presented the $49 million construction contract for Boulder Dam (now Hoover Dam).\n\nThe Nevada Test Site, northwest of the city of Las Vegas, was founded on January 11, 1951, for the testing of nuclear weapons. The site consists of about of desert and mountainous terrain. Nuclear testing at the Nevada Test Site began with a bomb dropped on Frenchman Flat on January 27, 1951. The last atmospheric test was conducted on July 17, 1962, and the underground testing of weapons continued until September 23, 1992. The location is known for having the highest concentration of nuclear-detonated weapons in the U.S.\n\nOver 80% of the state's area is owned by the federal government. The primary reason for this is homesteads were not permitted in large enough sizes to be viable in the arid conditions that prevail throughout desert Nevada. Instead, early settlers would homestead land surrounding a water source, and then graze livestock on the adjacent public land, which is useless for agriculture without access to water (this pattern of ranching still prevails).\n\nThe United States Census Bureau estimates the population of Nevada on July 1, 2016 was 2,940,058, an increase of 56,300 residents (1.95%) since the 2015 US Census estimate and an increase of 239,367 residents (8.86%) since the 2010 United States Census. Nevada had the second highest percentage growth in population from 2015 to 2016.\n\nSince the 2010 census, the population of Nevada had a natural increase of 87,581 (the net difference between 222,508 births and 134,927 deaths); and an increase due to net migration of 146,626 (of which 104,032 was due to domestic and 42,594 was due to international migration).\n\nThe center of population of Nevada is in southern Nye County. In this county, the unincorporated town of Pahrump, west of Las Vegas on the California state line, has grown very rapidly from 1980 to 2010. At the 2010 census, the town had 36,441 residents. Las Vegas grew from a gulch of 100 people in 1900 to 10,000 by 1950 to 100,000 by 1970, and was America's fastest-growing city and metropolitan area from 1960 to 2000.\n\nFrom about the 1940s until 2003, Nevada was the fastest-growing state in the US percentage-wise. Between 1990 and 2000, Nevada's population increased 66%, while the USA's population increased 13%. Over two thirds of the population of the state lives in the Clark County Las Vegas metropolitan area.\n\nHenderson and North Las Vegas are among the USA's top 20 fastest-growing cities of over 100,000.\n\nThe rural community of Mesquite northeast of Las Vegas was an example of micropolitan growth in the 1990s and 2000s. Other desert towns like Indian Springs and Searchlight on the outskirts of Las Vegas have seen some growth as well.\n\nLarge numbers of new residents in the state originate from California, which led some locals to feel their state is being \"Californicated\".\n\n\"Note: Births within the table table do not add up, due to Hispanics being counted both by their ethnicity and by their race, giving a higher overall number.\"\n\nA small percentage of Nevada's population lives in rural areas. The culture of these places differs significantly from the major metropolitan areas. People in these rural counties tend to be native Nevada residents, unlike in the Las Vegas and Reno areas, where the vast majority of the population was born in another state. The rural population is also less diverse in terms of race and ethnicity. Mining plays an important role in the economies of the rural counties, with tourism being less prominent. Ranching also has a long tradition in rural Nevada.\n\nAccording to 2016 Census Bureau data, Nevada is now majority minority joining California, Texas, New Mexico, Hawaii, and the District of Columbia. As of July 1, 2016, the Census Bureau estimated that Nevada was 75.1% White (49.9% non-Hispanic White), 9.6% Black or African American, 8.7% Asian, 1.6% American Indian or Alaska Native, and 0.8% Native Hawaiian or Other Pacific Islander. Individuals from two or more races made up 4.2% of the population. Hispanics of any race made up 28.5% of the State's population.\n\nAccording to the 2010 census estimates, racial distribution was as follows:\n\nHispanics or Latinos of any race made 26.5% of the population. In 1980, non-Hispanic whites made up 83.3% of the state's population.\n\nThe principal ancestries of Nevada's residents in 2009 have been surveyed to be the following:\n\nNevada is home to many cultures and nationalities. As of 2011, 63.6% of Nevada's population younger than age 1 were minorities. Las Vegas is a minority majority city. Nevada also has a sizable Basque ancestry population. In Douglas, Mineral and Pershing counties, a plurality of residents are of Mexican ancestry, with Clark County (Las Vegas) alone being home to over 200,000 Mexican Americans. Nye County and Humboldt County have a plurality of Germans; and Washoe County has many Irish Americans. Americans of English descent form pluralities in Lincoln County, Churchill County, Lyon County, White Pine County and Eureka County. Las Vegas is home to rapid-growing ethnic communities, including Scandinavians, Italians, Poles, Greeks, Spaniards and Armenians. Though, Mexicans are the majority of Latinos in the state, Nevada has a relatively diverse Hispanic/Latino population.\n\nAsian Americans lived in the state since the California Gold Rush of the 1850s brought thousands of Chinese miners to Washoe county. They were followed by a few hundred Japanese farm workers in the late 19th century. By the late 20th century, many immigrants from China, Japan, Korea, the Philippines, Bangladesh, India and Vietnam came to the Las Vegas metropolitan area. The city now has one of America's most prolific Asian American communities, with a mostly Chinese and Taiwanese area known as \"Chinatown\" west of I-15 on Spring Mountain Road. Filipino Americans form the largest Asian American group in the state, with a population of more than 113,000. They comprise 56.5% of the Asian American population in Nevada and constitute about 4.3% of the entire state's population.\n\nLargely African American sections of Las Vegas and Reno can be found. Many current African-American Nevadans are newly transplanted residents from California.\n\nAccording to the 2000 US Census, 16.19% of Nevada's population aged 5 and older speak Spanish at home, while 1.59% speak Filipino, and 1% speak Chinese.\n\nAt the 2010 census, 6.9% of the state's population were reported as under 5, 24.6% were under 18, and 12.0% were 65 or older. Females made up about 49.5% of the population.\n\nLas Vegas was a major destination for immigrants from South Asia and Latin America seeking employment in the gaming and hospitality industries during the 1990s and first decade of the 21st century, but farming and construction are the biggest employers of immigrant labor.\n\nSenior citizens (over age 65) and infants, young children or teenagers (under age 18) form large sections of the Nevada population. The religious makeup of Nevadans includes large communities of Mormons, Roman Catholics and Evangelicals; each is known for higher birth rates and a younger than national average age. American Jews represent a large proportion of the active adult retirement community.\n\nData from 2000 and 2005 suggests the following figures:\nChurch attendance in Nevada is among the lowest of all US states. In a 2009 Gallup poll only 30% of Nevadans said they attended church weekly or almost weekly, compared to 42% of all Americans (only four states were found to have a lower attendance rate than Nevada).\n\nMajor religious affiliations of the people of Nevada are: Protestant 35%, no religion 28%, Roman Catholic 25%, Latter-day Saint 4%, Jewish 2%, Hindu less than 1%, Buddhist 0.5% and Islam less than 0.1%. Parts of Nevada (in the eastern parts of the state) are situated in the Mormon Corridor.\n\nThe largest denominations by number of adherents in 2010 were the Roman Catholic Church with 451,070; The Church of Jesus Christ of Latter-day Saints with 175,149; and the Southern Baptist Convention with 45,535; Buddhist congregations 14,727; Bahá'í 1,723; and Muslim 1,700. The Jewish community is represented by The Rohr Jewish Learning Institute and Chabad.\n\nThe economy of Nevada is tied to tourism (especially entertainment and gambling related), mining, and cattle ranching. Nevada's industrial outputs are tourism, mining, machinery, printing and publishing, food processing, and electric equipment. The Bureau of Economic Analysis estimates Nevada's total state product in 2010 was $126 billion. The state's per capita personal income in 2009 was $38,578, ranking nineteenth in the nation. Nevada's state debt in 2012 was calculated to be $7.5 billion, or $3,100 per taxpayer. As of December 2014, the state's unemployment rate was 6.8%.\n\nThe economy of Nevada has long been tied to vice industries. \"[Nevada was] founded on mining and refounded on sin—beginning with prizefighting and easy divorce a century ago and later extending to gaming and prostitution\", said the August 21, 2010 issue of \"The Economist\".\n\nIn portions of the state outside of the Las Vegas and Reno metropolitan areas mining plays a major economic role. By value, gold is by far the most important mineral mined. In 2004, of gold worth $2.84 billion were mined in Nevada, and the state accounted for 8.7% of world gold production (see \"Gold mining in Nevada\"). Silver is a distant second, with worth $69 million mined in 2004 (see \"Silver mining in Nevada\"). Other minerals mined in Nevada include construction aggregates, copper, gypsum, diatomite and lithium. Despite its rich deposits, the cost of mining in Nevada is generally high, and output is very sensitive to world commodity prices.\n\nCattle ranching is a major economic activity in rural Nevada. Nevada's agricultural outputs are cattle, hay, alfalfa, dairy products, onions, and potatoes. As of January 1, 2006, there were an estimated 500,000 head of cattle and 70,000 head of sheep in Nevada. Most of these animals forage on rangeland in the summer, with supplemental feed in the winter. Calves are generally shipped to out-of-state feedlots in the fall to be fattened for market. Over 90% of Nevada's of cropland is used to grow hay, mostly alfalfa, for livestock feed.\n\nNevada does not have a state income tax.\n\nThe state sales tax (similar to VAT or GST) in Nevada is variable depending upon the county. The minimum statewide tax rate is 6.85%, with five counties (Elko, Esmeralda, Eureka, Humboldt, and Mineral) charging this minimum amount. All other counties assess various option taxes, making the combined state/county sales taxes rate in one county as high as 8.25%, which is the amount charged in Clark County. Sales tax in the other major counties: Carson at 7.745%, Washoe at 7.725%. The minimum Nevada sales tax rate changed on July 1, 2009.\n\nThe largest employers in the state, as of the first fiscal quarter of 2011, are the following, according to the Nevada Department of Employment, Training and Rehabilitation:\n\nAmtrak's \"California Zephyr\" train uses the Union Pacific's original transcontinental railroad line in daily service from Chicago to Emeryville, California, serving Elko, Winnemucca, and Reno. Amtrak Thruway Motorcoaches also provide connecting service from Las Vegas to trains at Needles, California, Los Angeles, and Bakersfield, California; and from Stateline, Nevada, to Sacramento, California. Las Vegas has had no passenger train service since Amtrak's Desert Wind was discontinued in 1997, although there have been a number of proposals to re-introduce service to either Los Angeles or Southern California.\n\nThe Union Pacific Railroad has some railroads in the north and south of Nevada. Greyhound Lines provide some bus service to the state.\nInterstate 15 passes through the southern tip of the state, serving Las Vegas and other communities. I-215 and spur route I-515 also serve the Las Vegas metropolitan area. Interstate 80 crosses through the northern part of Nevada, roughly following the path of the Humboldt River from Utah in the east and the Truckee River westward through Reno into California. It has a spur route, I-580. Nevada also is served by several U.S. highways: US 6, US 50, US 93, US 95 and US 395. There are also 189 Nevada state routes. Many of Nevada's counties have a system of county routes as well, though many are not signed or paved in rural areas. Nevada is one of a few states in the U.S. that does not have a continuous interstate highway linking its two major population centers—the road connection between the Las Vegas and Reno areas is a combination of Interstate and U.S. highways.\n\nThe state is one of just a few in the country to allow semi-trailer trucks with three trailers—what might be called a \"road train\" in Australia. But American versions are usually smaller, in part because they must ascend and descend some fairly steep mountain passes.\n\nRTC Transit is the public transit system in the Las Vegas metropolitan area. The agency is the largest transit agency in the state and operates a network of bus service across the Las Vegas Valley, including the use of The Deuce, double-decker buses, on the Las Vegas Strip and several outlying routes. RTC RIDE operates a system of local transit bus service throughout the Reno-Sparks metropolitan area. Other transit systems in the state include Carson City's JAC. Most other counties in the state do not have public transportation at all.\n\nAdditionally, a monorail system provides public transportation in the Las Vegas area. The Las Vegas Monorail line services several casino properties and the Las Vegas Convention Center on the east side of the Las Vegas Strip, running near Paradise Road, with a possible future extension to McCarran International Airport. Several hotels also run their own monorail lines between each other, which are typically several blocks in length.\n\nMcCarran International Airport in Las Vegas is the busiest airport serving Nevada. The Reno-Tahoe International Airport (formerly known as the Reno Cannon International Airport) is the other major airport in the state.\n\nUnder the Constitution of the State of Nevada, the powers of the Nevada government are divided among three separate departments: the Executive consisting of the Governor of Nevada and their cabinet along with the other elected constitutional officers; the Legislative consisting of the Nevada Legislature, which includes the Assembly and the Senate; and the Judicial consisting of the Supreme Court of Nevada and lower courts.\n\nThe Governor of Nevada is the chief magistrate of Nevada, the head of the executive department of the state's government, and the commander-in-chief of the state's military forces. The current Governor of Nevada is Brian Sandoval, a Republican.\n\nThe Nevada Legislature is a bicameral body divided into an Assembly and Senate. Members of the Assembly serve for 2 years, and members of the Senate serve for 4 years. Both houses of the Nevada Legislature will be impacted by term limits starting in 2010, as Senators and Assemblymen/women will be limited to a maximum of 12 years service in each house (by appointment or election which is a lifetime limit)—a provision of the constitution which was recently upheld by the Supreme Court of Nevada in a unanimous decision. Each session of the Legislature meets for a constitutionally mandated 120 days in every odd-numbered year, or longer if the Governor calls a special session.\n\nThe Supreme Court of Nevada is the state supreme court. Original jurisdiction is divided between the District Courts (with general jurisdiction), and Justice Courts and Municipal Courts (both of limited jurisdiction). Appeals from District Courts are made directly to the Nevada Supreme Court, which under a deflective model of jurisdiction, has the discretion to send cases to the Nevada Court of Appeals for final resolution.\n\nIncorporated towns in Nevada, known as cities, are given the authority to legislate anything not prohibited by law. A recent movement has begun to permit home rule in incorporated Nevada cities to give them more flexibility and fewer restrictions from the Legislature. Town Boards for unincorporated towns are limited local governments created by either the local county commission, or by referendum, and form a purely advisory role and in no way diminish the responsibilities of the county commission that creates them.\n\nState departments and agencies:\n\nIn 1900, Nevada's population was the smallest of all states and was shrinking, as the difficulties of living in a \"barren desert\" began to outweigh the lure of silver for many early settlers. Historian Lawrence Friedman has explained what happened next:\n\nNevada, in a burst of ingenuity, built an economy by exploiting its sovereignty. Its strategy was to legalize all sorts of things that were illegal in California ... after easy divorce came easy marriage and casino gaming. Even prostitution is legal in Nevada, in any county that decides to allow it. Quite a few of them do.\n\nWith the advent of air conditioning for summertime use and Southern Nevada's mild winters, the fortunes of the state began to turn around, as it did for Arizona, making these two states the fastest growing in the Union.\n\nNevada is the only state where prostitution is legal (under the form of licensed brothels).\n\nProstitution is specifically illegal by state law in the state's larger jurisdictions, which include Clark County (which contains Las Vegas), Washoe County (which contains Reno), and the independent city of Carson City. Otherwise, it is legal in those counties which specifically vote to permit it. When permitted, brothels are only in rural or isolated parts of counties.\n\nNevada's early reputation as a \"divorce haven\" arose from the fact that, before the no-fault divorce revolution in the 1970s, divorces were difficult to obtain in the United States. Already having legalized gambling and prostitution, Nevada continued the trend of boosting its profile by adopting one of the most liberal divorce statutes in the nation. This resulted in \"Williams v. North Carolina (1942)\", , in which the U.S. Supreme Court ruled North Carolina had to give \"full faith and credit\" to a Nevada divorce. The Court modified its decision in Williams v. North Carolina (1945), , by holding a state need not recognize a Nevada divorce unless one of the parties was domiciled there at the time the divorce was granted and the forum state was entitled to make its own determination.\n\nAs of 2009, Nevada's divorce rate was above the national average.\n\nNevada's tax laws are intended to draw new residents and businesses to the state. Nevada has no personal income tax or corporate income tax. Since Nevada does not collect income data it cannot share such information with the federal government, the IRS.\n\nNevada's state sales tax rate is 6.85 percent. Counties may impose additional rates via voter approval or through approval of the Legislature; therefore, the applicable sales tax will vary by county from 6.85 percent to 8.1 percent in Clark County.\nClark County, which includes Las Vegas, imposes four separate county option taxes in addition to the statewide rate – 0.25 percent for flood control, 0.50 percent for mass transit, 0.25 percent for infrastructure, and 0.25 percent for more cops. In Washoe County, which includes Reno, the sales tax rate is 7.725 percent, due to county option rates for flood control, the ReTRAC train trench project, mass transit, and an additional county rate approved under the Local Government Tax Act of 1991.\n\nThe lodging tax rate in unincorporated Clark County, which includes the Las Vegas Strip, is 12%. Within the boundaries of the cities of Las Vegas and Henderson, the lodging tax rate is 13%.\n\nCorporations such as Apple Inc. allegedly have set up investment companies and funds in Nevada to avoid paying taxes.\n\nIn 2009, the Nevada Legislature passed a bill creating a domestic partnership registry that enables gay couples to enjoy the same rights as married couples. As of 2014, gay marriage is legal in Nevada.\n\nNevada provides friendly environment for the formation of corporations, and many (especially California) businesses have incorporated in Nevada to take advantage of the benefits of the Nevada statute. Nevada corporations offer great flexibility to the Board of Directors and simplify or avoid many of the rules that are cumbersome to business managers in some other states. In addition, Nevada has no franchise tax, although it does require businesses to have a license for which the business has to pay the state.\n\nSimilarly, many U.S. states have usury laws limiting the amount of interest a lender can charge, but federal law allows corporations to 'import' these laws from their home state.\n\nNevada has very liberal alcohol laws. Bars are permitted to remain open 24 hours, with no \"last call\". Liquor stores, convenience stores and supermarkets may also sell alcohol 24 hours per day, and may sell beer, wine and spirits.\n\nIn 2016, Nevada voters approved Question 2, which legalized the possession, transportation and cultivation of personal use amounts of marijuana for adults age 21 years and older, and authorized the creation of a regulated market for the sale of marijuana to adults age 21 years and older through state-licensed retail outlets. Nevada voters had previously approved medical marijuana in 2000, but rejected marijuana legalization in a similar referendum in 2006. Marijuana in all forms remains illegal under federal law.\n\nNon-alcohol drug laws are a notable exception to Nevada's otherwise libertarian principles. It is notable for having the harshest penalties for drug offenders in the country. Nevada remains the only state to still use mandatory minimum sentencing guidelines for possession of drugs.\n\nNevada voters enacted a smoking ban (\"The Nevada Clean Indoor Air Act\") in November 2006 that became effective on December 8, 2006. It outlaws smoking in most workplaces and public places. Smoking is permitted in bars, but only if the bar serves no food, or the bar is inside a larger casino. Smoking is also permitted in casinos, certain hotel rooms, tobacco shops, and brothels. However, some businesses do not obey this law and the government tends not to enforce it. In 2011, smoking restrictions in Nevada were loosened for certain places which allow only people age 21 or older inside.\n\nIn 2006, the crime rate in Nevada was about 24% higher than the national average rate, though crime has since decreased. Property crimes accounted for about 85% of the total crime rate in Nevada, which was 21% higher than the national rate. The remaining 20.3% were violent crimes. A complete listing of crime data in the state for 2013 can be found here:\n\nDue to heavy growth in the southern portion of the state, there is a noticeable divide between politics of northern and southern Nevada. The north has long maintained control of key positions in state government, even while the population of southern Nevada is larger than the rest of the state combined. The north sees the high population south becoming more influential and perhaps commanding majority rule. The south sees the north as the \"old guard\" trying to rule as an oligarchy. This has fostered some resentment, however, due to a term limit amendment passed by Nevada voters in 1994, and again in 1996, some of the north's hold over key positions will soon be forfeited to the south, leaving northern Nevada with less power.\n\nHistorically, northern Nevada has been very Republican. The more rural counties of the north are among the most conservative regions of the country. Carson City, the state's capital, is a Republican-leaning swing city/county. Washoe County, home to Reno, has historically been strongly Republican, but now has become more of a Democratic-leaning swing county. Clark County, home to Las Vegas, has been a stronghold for the Democratic Party since it was founded in 1909, having voted Republican only six times and once for a third party candidate.\nClark and Washoe counties have long dominated the state's politics. Between them, they cast 87 percent of Nevada's vote, and elect a substantial majority of the state legislature. The last Republican to carry Clark County was George H.W. Bush in 1988, and the last Republican to carry Washoe County was George W. Bush in 2004. The great majority of the state's elected officials are either from Las Vegas or Reno.\n\nNevada voted for the winner in every presidential election from 1912 to 2012, except in 1976 when it voted for Gerald Ford over Jimmy Carter. This includes Nevada supporting Democrats John F. Kennedy and Lyndon B. Johnson in 1960 and 1964, respectively. Republican Richard Nixon in 1968 and in 1972, Republican Ronald Reagan in 1980 and in 1984, Republican George H.W. Bush in 1988, Democrat Bill Clinton in 1992 and 1996, Republican George W. Bush in 2000 and 2004, and Democrat Barack Obama winning the state in both 2008 and 2012. This gives the state status as a political bellwether. From 1912 to 2012, Nevada has been carried by the presidential victor the most out of any state (26 of 27 elections). In 2016, Nevada lost its bellwether status when it narrowly cast its votes for Hillary Clinton, against Donald Trump, the latter of whom was the 2016 election winner. Nevada was one of only three states won by John F. Kennedy in the American West in the election of 1960, albeit narrowly.\n\nThe state's U.S. Senators are Democrat Catherine Cortez Masto, and Republican Dean Heller. The Governorship is held by Brian Sandoval, a Republican from Reno.\n\nNevada is the only U.S. state to have a none of the above option available on its ballots. Officially called None of These Candidates, the option was first added to the ballot in 1975 and is used in all statewide elections, including president, US Senate and all state constitutional positions. In the event none of These Candidates \"wins\" the election, the candidate with the next-highest total is still elected.\nEducation in Nevada is achieved through public and private elementary, middle, and high schools, as well as colleges and universities.\n\nA May 2015 educational reform law expanded school choice options to 450,000 Nevada students who are at up to 185% of the federal poverty level. Education savings accounts (ESAs) are enabled by the new law to help pay the tuition for private schools. Alternatively, families \"can use funds in these accounts to also pay for textbooks and tutoring.\"\n\nPublic school districts in Nevada include:\n\n\n\nThe Nevada Aerospace Hall of Fame provides educational resources and promotes the aerospace and aviation history of the state.\n\n\n\nThere are 68 designated wilderness areas in Nevada, protecting some under the jurisdiction of the National Park Service, U.S. Forest Service, and Bureau of Land Management.\n\nThe Nevada state parks comprise protected areas managed by the state of Nevada, including state parks, state historic sites, and state recreation areas. There are 24 state park units, including Van Sickle Bi-State Park which opened in July 2011 and is operated in partnership with the state of California.\n\nResort areas like Las Vegas, Reno, Lake Tahoe, and Laughlin attract visitors from around the nation and world. In FY08 the total of 266 casinos with gaming revenue over $1m for the year, brought in revenue of $12 billion in gaming revenue, and $13 billion in non-gaming revenue. A review of gaming statistics can be found at Nevada gaming area.\n\nNevada has by far the most hotel rooms per capita in the United States. According to the American Hotel and Lodging Association, there were 187,301 rooms in 584 hotels (of 15 or more rooms). The state is ranked just below California, Texas, Florida, and New York in total number of rooms, but those states have much larger populations. Nevada has one hotel room for every 14 residents, far above the national average of one hotel room per 67 residents.\n\nProstitution is legal in parts of Nevada in licensed brothels, but only counties with populations under 400,000 have the option to legalize it. Although prostitution is not a major part of the Nevada economy, employing roughly 300 women as independent contractors, it is a very visible endeavor. Of the 14 counties permitted to legalize prostitution under state law, 8 have chosen to legalize brothels. State law prohibits prostitution in Clark County (which contains Las Vegas), and Washoe County (which contains Reno). However, prostitution is legal in Storey County, which is part of the Reno–Sparks metropolitan area.\n\nNevada is not well known for its professional sports teams, mainly because major league sports in the past feared having direct involvement with the sports gambling industry. However, this situation lessened after they embraced daily fantasy sports (DFS) in 2014. The Las Vegas Valley is home to the Vegas Golden Knights of the National Hockey League who began play in the 2017-18 NHL season at T-Mobile Arena on the Las Vegas Strip in Paradise, Nevada. The Golden Knights are currently the only major North American professional sports franchise located in Nevada. \n\nThey will be joined by the Oakland Raiders who at the start of the 2016 NFL season expressed interest in moving their team to Las Vegas, and announced in January 2017 they would do so in either 2019 or 2020.\n\nNevada takes pride in college sports, most notably its college football. College teams in the state include the Nevada Wolf Pack (representing the University of Nevada, Reno) and the UNLV Rebels (representing the University of Nevada, Las Vegas), both in the Mountain West Conference (MW).\n\nUNLV is most remembered for its men's basketball program, which experienced its height of supremacy in the late 1980s and early 1990s. Coached by Jerry Tarkanian, the Runnin' Rebels became one of the most elite programs in the country. In 1990, UNLV won the Men's Division I Championship by defeating Duke 103–73, which set tournament records for most points scored by a team and largest margin of victory in the national title game.\n\nIn 1991, UNLV finished the regular season undefeated, a feat that would not be matched in Division I men's basketball for more than 20 years. Forward Larry Johnson won several awards, including the Naismith Award. UNLV reached the Final Four yet again, but lost their national semifinal against Duke 79–77. The Runnin' Rebels were the Associated Press pre-season No. 1 back to back (1989–90, 1990–91). North Carolina is the only other team to accomplish that (2007–08, 2008–09).\n\nThe state's involvement in major-college sports is not limited to its local schools. In the 21st century, the Las Vegas area has become a significant regional center for college basketball conference tournaments. The MW, West Coast Conference, and Western Athletic Conference all hold their men's and women's tournaments in the area, and the Pac-12 holds its men's tournament there as well. The Big Sky Conference, after decades of holding its men's and women's conference tournaments at campus sites, began holding both tournaments in Reno in 2016.\n\nLas Vegas has hosted several professional boxing matches, most recently at the MGM Grand Garden Arena with bouts such as Mike Tyson vs. Evander Holyfield, Evander Holyfield vs. Mike Tyson II, Oscar De La Hoya vs. Floyd Mayweather and Oscar De La Hoya vs. Manny Pacquiao and at the newer T-Mobile Arena with Canelo Álvarez vs. Amir Khan.\n\nAlong with significant rises in popularity in mixed martial arts (MMA), a number of fight leagues such as the UFC have taken interest in Las Vegas as a primary event location due to the number of suitable host venues. The Mandalay Bay Events Center and MGM Grand Garden Arena are among some of the more popular venues for fighting events such as MMA and have hosted several UFC and other MMA title fights. The city has held the most UFC events with 86 events.\n\nThe state is also home to the Las Vegas Motor Speedway, which hosts the Kobalt Tools 400. Two venues in the immediate Las Vegas area host major annual events in rodeo. The Thomas & Mack Center, built for UNLV men's basketball, hosts the National Finals Rodeo. The PBR World Finals, operated by the bull riding-only Professional Bull Riders, was also held at the Thomas & Mack Center before moving to T-Mobile Arena in 2016. Finally, Sam Boyd Stadium, home to the UNLV football team, also hosts the country's biggest rugby event, the USA Sevens tournament in the World Rugby Sevens Series, as well as the AMA Supercross Championship.\n\nThe state is also home to one of the most famous tennis players of all time, Andre Agassi, and current baseball superstar Bryce Harper.\n\nSeveral United States Navy ships have been named USS \"Nevada\" in honor of the state. They include:\n\nArea 51 is near Groom Lake, a dry salt lake bed. The much smaller Creech Air Force Base is in Indian Springs, Nevada; Hawthorne Army Depot in Hawthorne; the Tonopah Test Range near Tonopah; and Nellis AFB in the northeast part of the Las Vegas Valley. Naval Air Station Fallon in Fallon; NSAWC, (pronounced \"EN-SOCK\") in western Nevada. NSAWC consolidated three Command Centers into a single Command Structure under a flag officer on July 11, 1996. The Naval Strike Warfare Center (STRIKE \"U\") based at NAS Fallon since 1984, was joined with the Navy Fighter Weapons School (TOPGUN) and the Carrier Airborne Early Warning Weapons School (TOPDOME) which both moved from NAS Miramar as a result of a Base Realignment and Closure (BRAC) decision in 1993 which transferred that installation back to the Marine Corps as MCAS Miramar. The Seahawk Weapon School was added in 1998 to provide tactical training for Navy helicopters.\n\nThese bases host a number of activities including the Joint Unmanned Aerial Systems Center of Excellence, the Naval Strike and Air Warfare Center, Nevada Test and Training Range, Red Flag, the U.S. Air Force Thunderbirds, the United States Air Force Warfare Center, the United States Air Force Weapons School, and the United States Navy Fighter Weapons School.\n\n\nNevada enjoys many economic advantages, and the southern portion of the state enjoys mild winter weather, but rapid growth has led to some overcrowded roads and schools. Nevada has the nation's 5th largest school district in the Clark County School District (projected fall 2007 enrollment is 314,000 students grades K-12).\n\nCoyote Springs is a proposed community for 240,000 inhabitants in Clark and Lincoln counties. It would be Nevada's largest planned city. The town is being developed by Harvey Whittemore and has generated some controversy because of environmental concerns and allegations of political favoritism.\n\n\n",
                "Las Vegas\n\nLas Vegas (, Spanish for \"The Meadows\"), officially the City of Las Vegas and often known simply as Vegas, is the 28th-most populated city in the United States, the most populated city in the state of Nevada, and the county seat of Clark County. The city anchors the Las Vegas Valley metropolitan area and is the largest city within the greater Mojave Desert. Las Vegas is an internationally renowned major resort city, known primarily for its gambling, shopping, fine dining, entertainment, and nightlife. The Las Vegas Valley as a whole serves as the leading financial, commercial, and cultural center for Nevada.\n\nThe city bills itself as The Entertainment Capital of the World, and is famous for its mega casino–hotels and associated activities. It is a top three destination in the United States for business conventions and a global leader in the hospitality industry, claiming more AAA Five Diamond hotels than any other city in the world. Today, Las Vegas annually ranks as one of the world's most visited tourist destinations. The city's tolerance for numerous forms of adult entertainment earned it the title of Sin City, and has made Las Vegas a popular setting for literature, films, television programs, and music videos.\n\nLas Vegas was settled in 1905 and officially incorporated in 1911. At the close of the 20th century, it was the most populated American city founded within that century (a similar distinction earned by Chicago in the 1800s). Population growth has accelerated since the 1960s, and between 1990 and 2000 the population nearly doubled, increasing by 85.2%. Rapid growth has continued into the 21st century, and according to a 2013 estimate, the population is 603,488 with a regional population of 2,027,828.\n\n\"Las Vegas\" is often used to describe areas beyond official city limits—especially the areas on and near the Las Vegas Strip, which is actually located within the unincorporated communities of Paradise, Winchester, and Enterprise.\n\nPerhaps the earliest visitors to the Las Vegas area were nomadic Paleo-Indians, who traveled there 10,000 years ago, leaving behind petroglyphs. Anasazi and Paiute tribes followed at least 2,000 years ago.\n\nA young Mexican scout named Rafael Rivera is credited as the first non-Native American to encounter the valley, in 1829. Trader Antonio Armijo led a 60-man party along the Spanish Trail to Los Angeles, California in 1829. The area was named Las Vegas, which is Spanish for \"the meadows,\" as it featured abundant wild grasses, as well as the desert spring waters needed by westward travelers. The year 1844 marked the arrival of John C. Frémont, whose writings helped lure pioneers to the area. Downtown Las Vegas's Fremont Street is named after him.\n\nEleven years later members of the LDS Church chose Las Vegas as the site to build a fort halfway between Salt Lake City and Los Angeles, where they would travel to gather supplies. The fort was abandoned several years afterward. The remainder of this Old Mormon Fort can still be seen at the intersection of Las Vegas Boulevard and Washington Avenue.\n\nLas Vegas was founded as a city in 1905, when of land adjacent to the Union Pacific Railroad tracks were auctioned in what would become the downtown area. In 1911, Las Vegas was incorporated as a city.\n\n1931 was a pivotal year for Las Vegas. At that time, Nevada legalized casino gambling and reduced residency requirements for divorce to six weeks. This year also witnessed the beginning of construction on nearby Hoover Dam. The influx of construction workers and their families helped Las Vegas avoid economic calamity during the Great Depression. The construction work was completed in 1935.\n\nIn 1941, the Las Vegas Army Air Corps Gunnery School was established. Currently known as Nellis Air Force Base, it is home to the aerobatic team called the Thunderbirds.\n\nFollowing World War II, lavishly decorated hotels, gambling casinos, and big-name entertainment became synonymous with Las Vegas.\n\nIn the 1950s the Moulin Rouge opened and became the first racially integrated casino-hotel in Las Vegas.\n\nIn 1951, nuclear weapons testing began at the Nevada Test Site, northwest of Las Vegas. City residents and visitors were able to witness the mushroom clouds (and were exposed to the fallout) until 1963, when the limited Test Ban Treaty required that nuclear tests be moved underground.\n\nThe iconic \"Welcome to Las Vegas\" sign, which was never located in the city, was created in 1959 by Betty Willis.\n\nDuring the 1960s, corporations and business powerhouses such as Howard Hughes were building and buying hotel-casino properties. Gambling was referred to as \"gaming\" which transitioned into legitimate business.\n\nThe year 1995 marked the opening of the Fremont Street Experience in Las Vegas's downtown area. This canopied five-block area features 12.5 million LED lights and 550,000 watts of sound from dusk until midnight during shows held on the top of each hour.\n\nDue to the realization of many revitalization efforts, 2012 was dubbed \"The Year of Downtown.\" Hundreds of millions of dollars' worth of projects made their debut at this time. They included The Smith Center for the Performing Arts and DISCOVERY Children's Museum, Mob Museum, Neon Museum, a new City Hall complex and renovations for a new Zappos.com corporate headquarters in the old City Hall building.\n\nLas Vegas is situated within Clark County in a basin on the floor of the Mojave Desert and is surrounded by mountain ranges on all sides. Much of the landscape is rocky and arid with desert vegetation and wildlife. It can be subjected to torrential flash floods, although much has been done to mitigate the effects of flash floods through improved drainage systems.\n\nThe peaks surrounding Las Vegas reach elevations of over , and act as barriers to the strong flow of moisture from the surrounding area. The elevation is approximately above sea level. According to the United States Census Bureau, the city has a total area of , of which is land and (0.03%) is water.\n\nNevada is the third most seismically active state in the U.S. (after Alaska and California); it has been estimated by the United States Geological Survey (USGS) that over the next 50 years there is a 10–20% chance of a M6.0 or greater earthquake occurring within 50 km of Las Vegas.\n\nWithin the city there are many lawns, trees and other greenery. Due to water resource issues, there has been a movement to encourage xeriscapes. Another part of conservation efforts is scheduled watering days for residential landscaping. A U.S. Environmental Protection Agency grant in 2008 funded a program that analyzed and forecast growth and environmental impacts through the year 2019.\n\nLas Vegas has a subtropical hot desert climate (Köppen climate classification: BWh), typical of the Mojave Desert in which it lies. This climate is typified by long, very hot summers; warm transitional seasons; and short, mild to chilly winters. There is abundant sunshine throughout the year, with an average of 310 sunny days and bright sunshine during 86% of all daylight hours. Rainfall is scarce, with an average of dispersed between roughly 26 to 27 total rainy days per year. Las Vegas is among the sunniest, driest, and least humid locations in North America, with exceptionally low dew points and humidity that sometimes remains below 10%.\n\nThe summer months of June through September are very hot, though moderated by extremely low humidity. July is the hottest month, with an average daytime high of . On average, 134 days per year reach or exceed , of which 74 days reach and 7 days reach . During the peak intensity of summer, overnight lows frequently remain above and occasionally above . While most summer days are consistently hot, dry, and cloudless, the North American Monsoon sporadically interrupts this pattern and brings more cloud cover, thunderstorms, lightning, increased humidity, and brief spells of heavy rain. The window of opportunity for the monsoon to affect Las Vegas usually falls between July and August, although this is inconsistent and varies considerably in its impact from year to year.\n\nLas Vegas winters are short and generally very mild, with chilly (but rarely cold) daytime temperatures. Like all seasons, sunshine is abundant. December is both the year's coolest and cloudiest month, with an average daytime high of and sunshine occurring during 78% of its daylight hours. Winter evenings are defined by clear skies and swift drops in temperature after sunset, with overnight lows sinking to or lower during the majority of nights in December and January. Owing to its elevation that ranges from 2,000 feet to 3,000 feet, Las Vegas experiences markedly cooler winters than other areas of the Mojave Desert and the adjacent Sonoran Desert that are closer to sea level. Consequently, the city records freezing temperatures an average of 16 nights per winter. However, it is exceptionally rare for temperatures to fall to or below , or for temperatures to remain below for an entire day. Most of the annual precipitation falls during the winter months, but even the wettest month (February) averages only four days of measurable rain. The mountains immediately surrounding the Las Vegas Valley accumulate snow every winter, but significant or sustained accumulation within the city is rare. The most recent major event occurred on December 16, 2008, when Las Vegas received . \n\nAccording to the 2010 Census, the racial composition of Las Vegas was as follows:\n\n\nSource:\n\nThe city's most populous ethnic group, non-Hispanic Whites, have proportionally declined from 72.1% of the population in 1990 to 47.9% in 2010, even as total numbers of all ethnicities have increased with the population. Hispanics or Latinos of any race make up 31.5% of the population. Of those 24.0% are of Mexican, 1.4% of Salvadoran, 0.9% of Puerto Rican, 0.9% of Cuban, 0.6% of Guatemalan, 0.2% of Peruvian, 0.2% of Colombian, 0.2% of Honduran and 0.2% of Nicaraguan descent.\nHawaiians and Las Vegans sometimes refer to Las Vegas as the \"ninth island of Hawaii\" because so many Hawaiians have moved to the city.\n\nAs of the census of 2010, there were 583,756 people, 211,689 households, and 117,538 families residing in the city. The population density was . There are 190,724 housing units at an average density of .\n\nAs of 2006, there were 176,750 households, out of which 31.9% had children under the age of 18 living with them, 48.3% were married couples living together, 12.2% had a female householder with no husband present, and 33.5% were non-families. 25.0% of all households were made up of individuals and 7.5% had someone living alone who was 65 years of age or older. The average household size was 2.66 and the average family size was 3.20.\n\nIn the city, the population was spread out with 25.9% under the age of 18, 8.8% from 18 to 24, 32.0% from 25 to 44, 21.7% from 45 to 64, and 11.6% who were 65 years of age or older. The median age was 34 years. For every 100 females there were 103.3 males. For every 100 females age 18 and over, there were 102.5 males.\n\nThe median income for a household in the city was $53,000 and the median income for a family was $58,465. Males had a median income of $35,511 versus $27,554 for females. The per capita income for the city was $22,060. About 6.6% of families and 8.9% of the population were below the poverty line, including 5.4% of those under age 18 and 6.3% of those age 65 or over.\n\nAccording to a 2004 study, Las Vegas has one of the highest divorce rates. The city's high divorce rate is not wholly due to Las Vegans themselves getting divorced. Since divorce is easier in Nevada than most other states, many people come from across the country for the easier process. Similarly, Nevada marriages are notoriously easy to get. Las Vegas has one of the highest marriage rates of U.S. cities, with many licenses issued to people from outside the area (see Las Vegas weddings).\n\nThe primary drivers of the Las Vegas economy are tourism, gaming and conventions, which in turn feed the retail and restaurant industries.\n\nThe major attractions in Las Vegas are the casinos and the hotels, although in recent years other new attractions have begun to emerge.\n\nMost casinos in the downtown area are located on the Fremont Street Experience, The Stratosphere being one of the exceptions. Fremont East, adjacent to the Fremont Street Experience, was granted variances to allow bars to be closer together, similar to the Gaslamp Quarter of San Diego, the goal being to attract a different demographic than the Strip attracts.\n\nThe Golden Gate Hotel & Casino, located downtown along the Fremont Street Experience, is the oldest continuously operating hotel and casino in Las Vegas; it opened in 1906 as the Hotel Nevada.\n\nThe year 1931 marked the opening of the Northern Club (now the La Bayou). The most notable of the early casinos may have been Binion's Horseshoe (now Binion's Gambling Hall and Hotel) while it was run by Benny Binion.\n\nBoyd Gaming has a major presence downtown operating the California Hotel & Casino, Fremont Hotel & Casino and the Main Street Casino. Other casinos operations include the Four Queens Hotel & Casino, Las Vegas Club (currently undergoing renovation) and Mermaid's Casino, which are also located downtown along the Fremont Street Experience.\n\nDowntown casinos that have undergone major renovations and revitalization in recent years include the Golden Nugget Hotel & Casino, The D Las Vegas Hotel Casino (formerly Fitzgerald's), Downtown Grand (formerly Lady Luck), El Cortez Hotel & Casino and The Plaza Hotel & Casino.\n\nThe center of the gambling and entertainment industry, however, is located on the Las Vegas Strip, outside the city limits in the surrounding unincorporated communities of Paradise and Winchester in Clark County. The largest and most notable casinos and buildings are located there.\n\nWhen The Mirage opened in 1989, it started a trend of major resort development on the Las Vegas Strip outside of the city. This resulted in a drop in tourism in the downtown area, but many recent projects have increased the number of visitors to downtown.\n\nAn effort has been made by city officials to diversify the economy by attracting health-related, high-tech and other commercial interests. No state tax for individuals or corporations, as well as a lack of other forms of business-related taxes, have aided the success of these efforts.\n\nWith the Strip expansion in the 1990s, downtown Las Vegas – which has maintained an old Las Vegas feel – began to suffer. However, in recent years the city has made strides in turning around the fortunes of this urban area.\n\nThe Fremont Street Experience was built in an effort to draw tourists back to the area, and has been popular since its startup in 1995.\n\nThe city purchased of property from the Union Pacific Railroad in 1995 with the goal of creating a better draw for more people to the downtown area. In 2004, Las Vegas Mayor Oscar Goodman announced plans for Symphony Park, which could include a mixture of offerings, such as residential space and office buildings.\n\nAlready operating in Symphony Park is the Cleveland Clinic Lou Ruvo Center for Brain Health (opened in 2010), The Smith Center for the Performing Arts (opened in 2012) and the DISCOVERY Children's Museum (opened in 2013).\n\nOn land across from Symphony Park, the World Market Center Las Vegas opened in 2005. It currently encompasses three large buildings with a total of 5.1 million square feet. Trade shows for the furniture and furnishing industries are held there semiannually.\n\nAlso located nearby is the Las Vegas North Premium Outlets. A second expansion was completed in May 2015, with the mall currently offering 175 stores.\n\nA new Las Vegas City Hall opened in February 2013 on downtown's Main Street. The former City Hall building is now occupied by the corporate headquarters for the major online retailer, Zappos.com, which opened downtown in 2013. Zappos CEO Tony Hsieh has taken an interest in the urban area and has contributed $350 million toward a revitalization effort called the Downtown Project. Projects funded include Las Vegas's first independent bookstore, The Writer's Block.\n\nThe city is home to several museums, including the Neon Museum (the location for many of the historical signs from Las Vegas's mid-20th century heyday), The Mob Museum, the Las Vegas Natural History Museum, the DISCOVERY Children's Museum, the Nevada State Museum and the Old Las Vegas Mormon State Historic Park.\n\nThe city is home to an extensive Downtown Arts District, which hosts numerous galleries and events including the annual Las Vegas Film Festival. \"First Friday\" is a monthly celebration that includes arts, music, special presentations and food in a section of the city's downtown region called 18b, The Las Vegas Arts District. The festival extends into the Fremont East Entertainment District as well.\n\nThe Thursday prior to First Friday is known in the arts district as \"Preview Thursday.\" This evening event highlights new gallery exhibitions throughout the district.\n\nThe Las Vegas Academy of International Studies, Performing and Visual Arts is a Grammy award-winning magnet school located in downtown Las Vegas.\n\nThe Smith Center for the Performing Arts is situated downtown in Symphony Park. The world-class performing arts center hosts Broadway shows and other major touring attractions, as well as orchestral, opera, ballet, choir, jazz, and dance performances.\n\nLas Vegas is also known as the Gambling Capital of the World, as the city currently has the largest strip of land-based casinos in the world.\n\nThe Las Vegas Valley is the home of one major league professional team, the Vegas Golden Knights of the National Hockey League, an expansion team that began play in the 2017–18 NHL season out of T-Mobile Arena in nearby Paradise. The Oakland Raiders of the National Football League plan to relocate to the under-construction Las Vegas Stadium, also in Paradise, by the 2020 NFL season.\n\nThe only minor league sports team that plays in the city of Las Vegas is the Las Vegas 51s of the Pacific Coast League, the AAA farm club of the New York Mets.\n\nIn response to the original rumors of the eventual NHL expansion team in Las Vegas, ESPN writer Scott Burnside noted several obstacles that would be faced by the city if it were to become a professional sports market, including the presence of legal sports betting, scheduling conflicts with the large number of residents who work nighttime and overnight shifts, and that the casinos would be unlikely to give away tickets to such events as a promotion, as they run contrary to a goal of encouraging patrons to remain in their facilities.\n\nMajor league professional teams\nMinor league professional teams\nAmateur league teams\nCollege teams\n\nLas Vegas has 68 parks. The city owns the land for, but does not operate, four golf courses: Angel Park Golf Club, Desert Pines Golf Club, Durango Hills Golf Club, and the Las Vegas Municipal Golf Course. It is also responsible for 123 playgrounds, 23 softball fields, 10 football fields, 44 soccer fields, 10 dog parks, six community centers, four senior centers, 109 skates parks, six swimming pools, and more.\n\nThe city of Las Vegas government operates as a council–manager government. The Mayor sits as a Council member-at-large and presides over all of the City Council meetings. In the event that the Mayor cannot preside over a City Council meeting, the Mayor Pro-Tem is the presiding officer of the meeting until such time as the Mayor returns to his/her seat. The City Manager is responsible for the administration and the day-to-day operations of all municipal services and city departments. The City Manager maintains intergovernmental relationships with federal, state, county and other local governments.\n\nMuch of the Las Vegas metropolitan area is split into neighboring incorporated cities or unincorporated communities. Approximately 700,000 people live in unincorporated areas governed by Clark County, and another 465,000 live in incorporated cities such as North Las Vegas, Henderson and Boulder City. Las Vegas and Clark County share a police department, the Las Vegas Metropolitan Police Department, which was formed after a 1973 merger of the Las Vegas Police Department and the Clark County Sheriff's Department. North Las Vegas, Henderson, Boulder City and some colleges have their own police departments.\n\nA Paiute Indian reservation occupies about in the downtown area.\n\nLas Vegas, home to the Lloyd D. George Federal District Courthouse and the Regional Justice Center, draws numerous companies providing bail, marriage, divorce, tax, incorporation and other legal services.\n\nPrimary and secondary public education is provided by the Clark County School District, which is the fifth most populous school district in the nation. Students totaled 314,653 in grades K-12 for school year 2013–2014.\n\nThe College of Southern Nevada (the third largest community college in the United States by enrollment) is the main higher education facility in the city. Other institutions include the University of Nevada School of Medicine, with a campus in the city, and the for-profit private school Le Cordon Bleu College of Culinary Arts. Educational opportunities exist around the city; among them are the University of Nevada, Las Vegas and Nevada State College run by the Nevada System of Higher Education, Desert Research Institute, The International Academy of Design & Technology Las Vegas and Touro University Nevada.\n\nRTC Transit is a public transportation system providing bus service throughout Las Vegas, Henderson, North Las Vegas and other areas of the valley. Inter-city bus service to and from Las Vegas is provided by Greyhound, BoltBus, Orange Belt Stages, Tufesa, and several smaller carriers. Amtrak trains have not served Las Vegas since the service via the Desert Wind was discontinued in 1997. Though no Amtrak trains have served Las Vegas since the Desert Wind was cancelled in 1997, Amtrak California operates Thruway Motorcoach dedicated service between the city and its passenger rail stations in Bakersfield, California, as well as Los Angeles Union Station via Barstow.\n\nA bus rapid-transit link in Las Vegas called the Strip & Downtown Express (previously ACE Gold Line) with limited stops and frequent service was launched in March 2010, and connects downtown Las Vegas, the Strip and the Las Vegas Convention Center.\n\nWith some exceptions, including Las Vegas Boulevard, Boulder Highway (SR 582) and Rancho Drive (SR 599), the majority of surface streets in Las Vegas are laid out in a grid along Public Land Survey System section lines. Many are maintained by the Nevada Department of Transportation as state highways. The street numbering system is divided by the following streets:\n\n\nInterstates 15, 515, and US 95 lead out of the city in four directions. Two major freeways – Interstate 15 and Interstate 515/U.S. Route 95 – cross in downtown Las Vegas. I-15 connects Las Vegas to Los Angeles, and heads northeast to and beyond Salt Lake City. I-515 goes southeast to Henderson, beyond which US 93 continues over the Mike O'Callaghan–Pat Tillman Memorial Bridge towards Phoenix, Arizona. US 95 connects the city to northwestern Nevada, including Carson City and Reno. US 93 splits from I-15 northeast of Las Vegas and goes north through the eastern part of the state, serving Ely and Wells. US 95 heads south from US 93 near Henderson through far eastern California. A partial beltway has been built, consisting of Interstate 215 on the south and Clark County 215 on the west and north. Other radial routes include Blue Diamond Road (SR 160) to Pahrump and Lake Mead Boulevard (SR 147) to Lake Mead.\n\n\n\nMcCarran International Airport handles international and domestic flights into the Las Vegas Valley. The airport also serves private aircraft and freight/cargo flights. Most general aviation traffic uses the smaller North Las Vegas Airport and Henderson Executive Airport.\n\nThe Union Pacific Railroad is the only Class I railroad providing rail freight service to the city. Until 1997, the Amtrak Desert Wind train service ran through Las Vegas using the Union Pacific Railroad tracks.\n\n\n\n"
            ],
            "good_message": false,
            "loggedData": [
                {
                    "curr_message": "I",
                    "last_key_pressed": "I"
                },
                {
                    "curr_message": "It",
                    "last_key_pressed": "t"
                },
                {
                    "curr_message": "It ",
                    "last_key_pressed": " "
                },
                {
                    "curr_message": "It i",
                    "last_key_pressed": "i"
                },
                {
                    "curr_message": "It is",
                    "last_key_pressed": "s"
                },
                {
                    "curr_message": "It is ",
                    "last_key_pressed": " "
                },
                {
                    "curr_message": "It is a",
                    "last_key_pressed": "a"
                },
                {
                    "curr_message": "It is a ",
                    "last_key_pressed": " "
                },
                {
                    "curr_message": "It is a g",
                    "last_key_pressed": "g"
                },
                {
                    "curr_message": "It is a go",
                    "last_key_pressed": "o"
                },
                {
                    "curr_message": "It is a goo",
                    "last_key_pressed": "o"
                },
                {
                    "curr_message": "It is a good",
                    "last_key_pressed": "d"
                },
                {
                    "curr_message": "It is a good ",
                    "last_key_pressed": " "
                },
                {
                    "curr_message": "It is a good p",
                    "last_key_pressed": "p"
                },
                {
                    "curr_message": "It is a good pl",
                    "last_key_pressed": "l"
                },
                {
                    "curr_message": "It is a good pla",
                    "last_key_pressed": "a"
                },
                {
                    "curr_message": "It is a good plac",
                    "last_key_pressed": "c"
                },
                {
                    "curr_message": "It is a good place",
                    "last_key_pressed": "e"
                },
                {
                    "curr_message": "It is a good place ",
                    "last_key_pressed": " "
                },
                {
                    "curr_message": "It is a good place t",
                    "last_key_pressed": "t"
                },
                {
                    "curr_message": "It is a good place to",
                    "last_key_pressed": "o"
                },
                {
                    "curr_message": "It is a good place to ",
                    "last_key_pressed": " "
                },
                {
                    "curr_message": "It is a good place to b",
                    "last_key_pressed": "b"
                },
                {
                    "curr_message": "It is a good place to be",
                    "last_key_pressed": "e"
                },
                {
                    "curr_message": "It is a good place to be.",
                    "last_key_pressed": "."
                },
                {
                    "curr_message": "It is a good place to be. ",
                    "last_key_pressed": " "
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in the southern part of the U.S. state of Nevada.",
                    "last_key_pressed": "<<selected>>"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in the southern part of the U.S. state of Nevada",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in the southern part of the U.S. state of Nevad",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in the southern part of the U.S. state of Neva",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in the southern part of the U.S. state of Nev",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in the southern part of the U.S. state of Ne",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in the southern part of the U.S. state of N",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in the southern part of the U.S. state of ",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in the southern part of the U.S. state of",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in the southern part of the U.S. state o",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in the southern part of the U.S. state ",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in the southern part of the U.S. state",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in the southern part of the U.S. stat",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in the southern part of the U.S. sta",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in the southern part of the U.S. st",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in the southern part of the U.S. s",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in the southern part of the U.S. ",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in the southern part of the U.S.",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in the southern part of the U.S",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in the southern part of the U.",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in the southern part of the U",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in the southern part of the ",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in the southern part of the",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in the southern part of th",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in the southern part of t",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in the southern part of ",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in the southern part of",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in the southern part o",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in the southern part ",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in the southern part",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in the southern par",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in the southern pa",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in the southern p",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in the southern ",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in the southern",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in the souther",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in the southe",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in the south",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in the sout",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in the sou",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in the so",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in the s",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in the ",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in the",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in th",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in t",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in ",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area in",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area i",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area ",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area",
                    "last_key_pressed": "Backspace"
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area.",
                    "last_key_pressed": "."
                },
                {
                    "curr_message": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area. The state's largest urban agglomeration, it is the heart of the Las Vegas–Paradise-Henderson, NV MSA.",
                    "last_key_pressed": "<<selected>>"
                }
            ],
            "offensive": null,
            "selectedData": [
                "The Las Vegas Valley is a major metropolitan area in the southern part of the U.S. state of Nevada.",
                "The state's largest urban agglomeration, it is the heart of the Las Vegas–Paradise-Henderson, NV MSA."
            ],
            "shown_passages": [
                [
                    "Las Vegas Valley",
                    [
                        "The Las Vegas Valley is a major metropolitan area in the southern part of the U.S. state of Nevada.",
                        "The state's largest urban agglomeration, it is the heart of the Las Vegas–Paradise-Henderson, NV MSA.",
                        "The Valley is largely defined by the Las Vegas Valley landform, a basin area surrounded by mountains to the north, south, east and west of the metropolitan area.",
                        "The Valley is home to the three largest incorporated cities in Nevada: Las Vegas, Henderson and North Las Vegas.",
                        "Five unincorporated towns governed by the Clark County government are part of the Las Vegas Township and constitute the largest community in the state of Nevada."
                    ]
                ],
                [
                    "Las Vegas–Paradise, NV MSA",
                    [
                        "The Las Vegas–Paradise, NV MSA, also known as the Las Vegas–Henderson–Paradise, NV Metropolitan Statistical Area (2013), is in the southern part of the U.S. state of Nevada, coextensive since 2003 with Clark County, Nevada.",
                        "A central part of the metropolitan area is the Las Vegas Valley, a basin that includes the metropolitan area's largest city, Las Vegas as well as the other primary city, Paradise, Nevada.",
                        "The area contains the largest concentration of people in the state.",
                        "Cities in the metropolitan area include Las Vegas, Henderson, North Las Vegas, and Boulder City.",
                        "The metropolitan area is one of the top tourist destinations in the world, drawing over 40 million international and domestic visitors in 2013 with a GMP of US$103.3 billion."
                    ]
                ],
                [
                    "Nevada",
                    [
                        "Nevada (; see pronunciations) is a state in the Western, Mountain West, and Southwestern regions of the United States of America.",
                        "Nevada is the 7th most extensive, the 34th most populous, but the 9th least densely populated of the 50 United States.",
                        "Nearly three-quarters of Nevada's people live in Clark County, which contains the Las Vegas–Paradise metropolitan area where three of the state's four largest incorporated cities are located.",
                        "Nevada's capital is Carson City.",
                        "Nevada is officially known as the \"Silver State\" because of the importance of silver to its history and economy.",
                        "It is also known as the \"Battle Born State\", because it achieved statehood during the Civil War (the words \"Battle Born\" also appear on the state flag); as the \"Sagebrush State\", for the native plant of the same name; and as the \"Sage-hen State\"."
                    ]
                ],
                [
                    "Las Vegas",
                    [
                        "Las Vegas (, Spanish for \"The Meadows\"), officially the City of Las Vegas and often known simply as Vegas, is the 28th-most populated city in the United States, the most populated city in the state of Nevada, and the county seat of Clark County.",
                        "The city anchors the Las Vegas Valley metropolitan area and is the largest city within the greater Mojave Desert.",
                        "Las Vegas is an internationally renowned major resort city, known primarily for its gambling, shopping, fine dining, entertainment, and nightlife.",
                        "The Las Vegas Valley as a whole serves as the leading financial, commercial, and cultural center for Nevada."
                    ]
                ]
            ],
            "speaker": "0_Wizard",
            "text": "It is a good place to be.  The Las Vegas Valley is a major metropolitan area. The state's largest urban agglomeration, it is the heart of the Las Vegas–Paradise-Henderson, NV MSA.",
            "time": 1568483574.9221249,
            "turn": 2
        }
    ],
    "good_wizard_worker": "",
    "hit_ids": [
        "3FBEFUUYRKBV7SLQOV2SPWZ1VJY6AD"
    ],
    "n_turn": 2,
    "persona": {
        "i am an elementary school teacher.": [],
        "i live in toronto , canada.": [],
        "my favorite french fries are from mcdonald.": [],
        "my mom and dad are from japan.": [
            "History of Japan"
        ]
    },
    "relevant_topics": [
        "History of Japan (my mom and dad are from japan.)"
    ],
    "speaker_with_persona": "A2ACW7CBIDO9XE",
    "wizard_eval": 0,
    "wizard_good": false,
    "workers": [
        "A2ACW7CBIDO9XE"
    ]
}